Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK1_PI_RCS_ESCEVENT_Pos         _UINT32_(8)                                          /* (SPW_LINK1_PI_RCS Position) Escape Event x */
#define SPW_LINK1_PI_RCS_ESCEVENT_Msk         (_UINT32_(0x3) << SPW_LINK1_PI_RCS_ESCEVENT_Pos)     /* (SPW_LINK1_PI_RCS Mask) ESCEVENT */
#define SPW_LINK1_PI_RCS_ESCEVENT(value)      (SPW_LINK1_PI_RCS_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK1_PI_RCS_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_IM : (SPW Offset: 0x410) (R/W 32) SpW Link 1 Interrupt Mask -------- */
#define SPW_LINK1_IM_DISERR_Pos               _UINT32_(0)                                          /* (SPW_LINK1_IM) DisErr Position */
#define SPW_LINK1_IM_DISERR_Msk               (_UINT32_(0x1) << SPW_LINK1_IM_DISERR_Pos)           /* (SPW_LINK1_IM) DisErr Mask */
#define SPW_LINK1_IM_DISERR(value)            (SPW_LINK1_IM_DISERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_PARERR_Pos               _UINT32_(1)                                          /* (SPW_LINK1_IM) ParErr Position */
#define SPW_LINK1_IM_PARERR_Msk               (_UINT32_(0x1) << SPW_LINK1_IM_PARERR_Pos)           /* (SPW_LINK1_IM) ParErr Mask */
#define SPW_LINK1_IM_PARERR(value)            (SPW_LINK1_IM_PARERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_ESCERR_Pos               _UINT32_(2)                                          /* (SPW_LINK1_IM) ESCErr Position */
#define SPW_LINK1_IM_ESCERR_Msk               (_UINT32_(0x1) << SPW_LINK1_IM_ESCERR_Pos)           /* (SPW_LINK1_IM) ESCErr Mask */
#define SPW_LINK1_IM_ESCERR(value)            (SPW_LINK1_IM_ESCERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_CRERR_Pos                _UINT32_(3)                                          /* (SPW_LINK1_IM) CrErr Position */
#define SPW_LINK1_IM_CRERR_Msk                (_UINT32_(0x1) << SPW_LINK1_IM_CRERR_Pos)            /* (SPW_LINK1_IM) CrErr Mask */
#define SPW_LINK1_IM_CRERR(value)             (SPW_LINK1_IM_CRERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_LINKABORT_Pos            _UINT32_(4)                                          /* (SPW_LINK1_IM) LinkAbort Position */
#define SPW_LINK1_IM_LINKABORT_Msk            (_UINT32_(0x1) << SPW_LINK1_IM_LINKABORT_Pos)        /* (SPW_LINK1_IM) LinkAbort Mask */
#define SPW_LINK1_IM_LINKABORT(value)         (SPW_LINK1_IM_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK1_IM_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_EEPTRANS_Pos             _UINT32_(5)                                          /* (SPW_LINK1_IM) EEP transmitted Position */
#define SPW_LINK1_IM_EEPTRANS_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_EEPTRANS_Pos)         /* (SPW_LINK1_IM) EEP transmitted Mask */
#define SPW_LINK1_IM_EEPTRANS(value)          (SPW_LINK1_IM_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK1_IM_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_EEPREC_Pos               _UINT32_(6)                                          /* (SPW_LINK1_IM) EEP received Position */
#define SPW_LINK1_IM_EEPREC_Msk               (_UINT32_(0x1) << SPW_LINK1_IM_EEPREC_Pos)           /* (SPW_LINK1_IM) EEP received Mask */
#define SPW_LINK1_IM_EEPREC(value)            (SPW_LINK1_IM_EEPREC_Msk & (_UINT32_(value) << SPW_LINK1_IM_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_DISCARD_Pos              _UINT32_(7)                                          /* (SPW_LINK1_IM) Discard Position */
#define SPW_LINK1_IM_DISCARD_Msk              (_UINT32_(0x1) << SPW_LINK1_IM_DISCARD_Pos)          /* (SPW_LINK1_IM) Discard Mask */
#define SPW_LINK1_IM_DISCARD(value)           (SPW_LINK1_IM_DISCARD_Msk & (_UINT32_(value) << SPW_LINK1_IM_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_ESCEVENT2_Pos            _UINT32_(8)                                          /* (SPW_LINK1_IM) Escape Event 2 Position */
#define SPW_LINK1_IM_ESCEVENT2_Msk            (_UINT32_(0x1) << SPW_LINK1_IM_ESCEVENT2_Pos)        /* (SPW_LINK1_IM) Escape Event 2 Mask */
#define SPW_LINK1_IM_ESCEVENT2(value)         (SPW_LINK1_IM_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK1_IM_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_ESCEVENT1_Pos            _UINT32_(9)                                          /* (SPW_LINK1_IM) Escape Event 1 Position */
#define SPW_LINK1_IM_ESCEVENT1_Msk            (_UINT32_(0x1) << SPW_LINK1_IM_ESCEVENT1_Pos)        /* (SPW_LINK1_IM) Escape Event 1 Mask */
#define SPW_LINK1_IM_ESCEVENT1(value)         (SPW_LINK1_IM_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK1_IM_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK1_IM register */
#define SPW_LINK1_IM_Msk                      _UINT32_(0x000003FF)                                 /* (SPW_LINK1_IM) Register Mask  */

#define SPW_LINK1_IM_ESCEVENT_Pos             _UINT32_(8)                                          /* (SPW_LINK1_IM Position) Escape Event x */
#define SPW_LINK1_IM_ESCEVENT_Msk             (_UINT32_(0x3) << SPW_LINK1_IM_ESCEVENT_Pos)         /* (SPW_LINK1_IM Mask) ESCEVENT */
#define SPW_LINK1_IM_ESCEVENT(value)          (SPW_LINK1_IM_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK1_IM_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_PI_C : (SPW Offset: 0x414) ( /W 32) SpW Link 1 Clear Pending Interrupt -------- */
#define SPW_LINK1_PI_C_DISERR_Pos             _UINT32_(0)                                          /* (SPW_LINK1_PI_C) DisErr Position */
#define SPW_LINK1_PI_C_DISERR_Msk             (_UINT32_(0x1) << SPW_LINK1_PI_C_DISERR_Pos)         /* (SPW_LINK1_PI_C) DisErr Mask */
#define SPW_LINK1_PI_C_DISERR(value)          (SPW_LINK1_PI_C_DISERR_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_PARERR_Pos             _UINT32_(1)                                          /* (SPW_LINK1_PI_C) ParErr Position */
#define SPW_LINK1_PI_C_PARERR_Msk             (_UINT32_(0x1) << SPW_LINK1_PI_C_PARERR_Pos)         /* (SPW_LINK1_PI_C) ParErr Mask */
#define SPW_LINK1_PI_C_PARERR(value)          (SPW_LINK1_PI_C_PARERR_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_ESCERR_Pos             _UINT32_(2)                                          /* (SPW_LINK1_PI_C) ESCErr Position */
#define SPW_LINK1_PI_C_ESCERR_Msk             (_UINT32_(0x1) << SPW_LINK1_PI_C_ESCERR_Pos)         /* (SPW_LINK1_PI_C) ESCErr Mask */
#define SPW_LINK1_PI_C_ESCERR(value)          (SPW_LINK1_PI_C_ESCERR_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_CRERR_Pos              _UINT32_(3)                                          /* (SPW_LINK1_PI_C) CrErr Position */
#define SPW_LINK1_PI_C_CRERR_Msk              (_UINT32_(0x1) << SPW_LINK1_PI_C_CRERR_Pos)          /* (SPW_LINK1_PI_C) CrErr Mask */
#define SPW_LINK1_PI_C_CRERR(value)           (SPW_LINK1_PI_C_CRERR_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_LINKABORT_Pos          _UINT32_(4)                                          /* (SPW_LINK1_PI_C) LinkAbort Position */
#define SPW_LINK1_PI_C_LINKABORT_Msk          (_UINT32_(0x1) << SPW_LINK1_PI_C_LINKABORT_Pos)      /* (SPW_LINK1_PI_C) LinkAbort Mask */
#define SPW_LINK1_PI_C_LINKABORT(value)       (SPW_LINK1_PI_C_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_EEPTRANS_Pos           _UINT32_(5)                                          /* (SPW_LINK1_PI_C) EEP transmitted Position */
#define SPW_LINK1_PI_C_EEPTRANS_Msk           (_UINT32_(0x1) << SPW_LINK1_PI_C_EEPTRANS_Pos)       /* (SPW_LINK1_PI_C) EEP transmitted Mask */
#define SPW_LINK1_PI_C_EEPTRANS(value)        (SPW_LINK1_PI_C_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_EEPREC_Pos             _UINT32_(6)                                          /* (SPW_LINK1_PI_C) EEP received Position */
#define SPW_LINK1_PI_C_EEPREC_Msk             (_UINT32_(0x1) << SPW_LINK1_PI_C_EEPREC_Pos)         /* (SPW_LINK1_PI_C) EEP received Mask */
#define SPW_LINK1_PI_C_EEPREC(value)          (SPW_LINK1_PI_C_EEPREC_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_DISCARD_Pos            _UINT32_(7)                                          /* (SPW_LINK1_PI_C) Discard Position */
#define SPW_LINK1_PI_C_DISCARD_Msk            (_UINT32_(0x1) << SPW_LINK1_PI_C_DISCARD_Pos)        /* (SPW_LINK1_PI_C) Discard Mask */
#define SPW_LINK1_PI_C_DISCARD(value)         (SPW_LINK1_PI_C_DISCARD_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_ESCEVENT2_Pos          _UINT32_(8)                                          /* (SPW_LINK1_PI_C) Escape Event 2 Position */
#define SPW_LINK1_PI_C_ESCEVENT2_Msk          (_UINT32_(0x1) << SPW_LINK1_PI_C_ESCEVENT2_Pos)      /* (SPW_LINK1_PI_C) Escape Event 2 Mask */
#define SPW_LINK1_PI_C_ESCEVENT2(value)       (SPW_LINK1_PI_C_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_ESCEVENT1_Pos          _UINT32_(9)                                          /* (SPW_LINK1_PI_C) Escape Event 1 Position */
#define SPW_LINK1_PI_C_ESCEVENT1_Msk          (_UINT32_(0x1) << SPW_LINK1_PI_C_ESCEVENT1_Pos)      /* (SPW_LINK1_PI_C) Escape Event 1 Mask */
#define SPW_LINK1_PI_C_ESCEVENT1(value)       (SPW_LINK1_PI_C_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK1_PI_C register */
#define SPW_LINK1_PI_C_Msk                    _UINT32_(0x000003FF)                                 /* (SPW_LINK1_PI_C) Register Mask  */

#define SPW_LINK1_PI_C_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK1_PI_C Position) Escape Event x */
#define SPW_LINK1_PI_C_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK1_PI_C_ESCEVENT_Pos)       /* (SPW_LINK1_PI_C Mask) ESCEVENT */
#define SPW_LINK1_PI_C_ESCEVENT(value)        (SPW_LINK1_PI_C_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK1_PI_C_ESCEVENT_Pos)) 

