Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_LINK1_IM_S : (SPW Offset: 0x418) ( /W 32) SpW Link 1 Interrupt Set Mask -------- */
#define SPW_LINK1_IM_S_DISERR_Pos             _UINT32_(0)                                          /* (SPW_LINK1_IM_S) DisErr Position */
#define SPW_LINK1_IM_S_DISERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_S_DISERR_Pos)         /* (SPW_LINK1_IM_S) DisErr Mask */
#define SPW_LINK1_IM_S_DISERR(value)          (SPW_LINK1_IM_S_DISERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_PARERR_Pos             _UINT32_(1)                                          /* (SPW_LINK1_IM_S) ParErr Position */
#define SPW_LINK1_IM_S_PARERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_S_PARERR_Pos)         /* (SPW_LINK1_IM_S) ParErr Mask */
#define SPW_LINK1_IM_S_PARERR(value)          (SPW_LINK1_IM_S_PARERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_ESCERR_Pos             _UINT32_(2)                                          /* (SPW_LINK1_IM_S) ESCErr Position */
#define SPW_LINK1_IM_S_ESCERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_S_ESCERR_Pos)         /* (SPW_LINK1_IM_S) ESCErr Mask */
#define SPW_LINK1_IM_S_ESCERR(value)          (SPW_LINK1_IM_S_ESCERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_CRERR_Pos              _UINT32_(3)                                          /* (SPW_LINK1_IM_S) CrErr Position */
#define SPW_LINK1_IM_S_CRERR_Msk              (_UINT32_(0x1) << SPW_LINK1_IM_S_CRERR_Pos)          /* (SPW_LINK1_IM_S) CrErr Mask */
#define SPW_LINK1_IM_S_CRERR(value)           (SPW_LINK1_IM_S_CRERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_LINKABORT_Pos          _UINT32_(4)                                          /* (SPW_LINK1_IM_S) LinkAbort Position */
#define SPW_LINK1_IM_S_LINKABORT_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_S_LINKABORT_Pos)      /* (SPW_LINK1_IM_S) LinkAbort Mask */
#define SPW_LINK1_IM_S_LINKABORT(value)       (SPW_LINK1_IM_S_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_EEPTRANS_Pos           _UINT32_(5)                                          /* (SPW_LINK1_IM_S) EEP transmitted Position */
#define SPW_LINK1_IM_S_EEPTRANS_Msk           (_UINT32_(0x1) << SPW_LINK1_IM_S_EEPTRANS_Pos)       /* (SPW_LINK1_IM_S) EEP transmitted Mask */
#define SPW_LINK1_IM_S_EEPTRANS(value)        (SPW_LINK1_IM_S_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_EEPREC_Pos             _UINT32_(6)                                          /* (SPW_LINK1_IM_S) EEP received Position */
#define SPW_LINK1_IM_S_EEPREC_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_S_EEPREC_Pos)         /* (SPW_LINK1_IM_S) EEP received Mask */
#define SPW_LINK1_IM_S_EEPREC(value)          (SPW_LINK1_IM_S_EEPREC_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_DISCARD_Pos            _UINT32_(7)                                          /* (SPW_LINK1_IM_S) Discard Position */
#define SPW_LINK1_IM_S_DISCARD_Msk            (_UINT32_(0x1) << SPW_LINK1_IM_S_DISCARD_Pos)        /* (SPW_LINK1_IM_S) Discard Mask */
#define SPW_LINK1_IM_S_DISCARD(value)         (SPW_LINK1_IM_S_DISCARD_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_ESCEVENT2_Pos          _UINT32_(8)                                          /* (SPW_LINK1_IM_S) Escape Event 2 Position */
#define SPW_LINK1_IM_S_ESCEVENT2_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_S_ESCEVENT2_Pos)      /* (SPW_LINK1_IM_S) Escape Event 2 Mask */
#define SPW_LINK1_IM_S_ESCEVENT2(value)       (SPW_LINK1_IM_S_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_ESCEVENT1_Pos          _UINT32_(9)                                          /* (SPW_LINK1_IM_S) Escape Event 1 Position */
#define SPW_LINK1_IM_S_ESCEVENT1_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_S_ESCEVENT1_Pos)      /* (SPW_LINK1_IM_S) Escape Event 1 Mask */
#define SPW_LINK1_IM_S_ESCEVENT1(value)       (SPW_LINK1_IM_S_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK1_IM_S register */
#define SPW_LINK1_IM_S_Msk                    _UINT32_(0x000003FF)                                 /* (SPW_LINK1_IM_S) Register Mask  */

#define SPW_LINK1_IM_S_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK1_IM_S Position) Escape Event x */
#define SPW_LINK1_IM_S_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK1_IM_S_ESCEVENT_Pos)       /* (SPW_LINK1_IM_S Mask) ESCEVENT */
#define SPW_LINK1_IM_S_ESCEVENT(value)        (SPW_LINK1_IM_S_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK1_IM_S_ESCEVENT_Pos)) 

/* -------- SPW_LINK1_IM_C : (SPW Offset: 0x41C) ( /W 32) SpW Link 1 Interrupt Clear Mask -------- */
#define SPW_LINK1_IM_C_DISERR_Pos             _UINT32_(0)                                          /* (SPW_LINK1_IM_C) DisErr Position */
#define SPW_LINK1_IM_C_DISERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_C_DISERR_Pos)         /* (SPW_LINK1_IM_C) DisErr Mask */
#define SPW_LINK1_IM_C_DISERR(value)          (SPW_LINK1_IM_C_DISERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_PARERR_Pos             _UINT32_(1)                                          /* (SPW_LINK1_IM_C) ParErr Position */
#define SPW_LINK1_IM_C_PARERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_C_PARERR_Pos)         /* (SPW_LINK1_IM_C) ParErr Mask */
#define SPW_LINK1_IM_C_PARERR(value)          (SPW_LINK1_IM_C_PARERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_ESCERR_Pos             _UINT32_(2)                                          /* (SPW_LINK1_IM_C) ESCErr Position */
#define SPW_LINK1_IM_C_ESCERR_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_C_ESCERR_Pos)         /* (SPW_LINK1_IM_C) ESCErr Mask */
#define SPW_LINK1_IM_C_ESCERR(value)          (SPW_LINK1_IM_C_ESCERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_CRERR_Pos              _UINT32_(3)                                          /* (SPW_LINK1_IM_C) CrErr Position */
#define SPW_LINK1_IM_C_CRERR_Msk              (_UINT32_(0x1) << SPW_LINK1_IM_C_CRERR_Pos)          /* (SPW_LINK1_IM_C) CrErr Mask */
#define SPW_LINK1_IM_C_CRERR(value)           (SPW_LINK1_IM_C_CRERR_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_LINKABORT_Pos          _UINT32_(4)                                          /* (SPW_LINK1_IM_C) LinkAbort Position */
#define SPW_LINK1_IM_C_LINKABORT_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_C_LINKABORT_Pos)      /* (SPW_LINK1_IM_C) LinkAbort Mask */
#define SPW_LINK1_IM_C_LINKABORT(value)       (SPW_LINK1_IM_C_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_EEPTRANS_Pos           _UINT32_(5)                                          /* (SPW_LINK1_IM_C) EEP transmitted Position */
#define SPW_LINK1_IM_C_EEPTRANS_Msk           (_UINT32_(0x1) << SPW_LINK1_IM_C_EEPTRANS_Pos)       /* (SPW_LINK1_IM_C) EEP transmitted Mask */
#define SPW_LINK1_IM_C_EEPTRANS(value)        (SPW_LINK1_IM_C_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_EEPREC_Pos             _UINT32_(6)                                          /* (SPW_LINK1_IM_C) EEP received Position */
#define SPW_LINK1_IM_C_EEPREC_Msk             (_UINT32_(0x1) << SPW_LINK1_IM_C_EEPREC_Pos)         /* (SPW_LINK1_IM_C) EEP received Mask */
#define SPW_LINK1_IM_C_EEPREC(value)          (SPW_LINK1_IM_C_EEPREC_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_DISCARD_Pos            _UINT32_(7)                                          /* (SPW_LINK1_IM_C) Discard Position */
#define SPW_LINK1_IM_C_DISCARD_Msk            (_UINT32_(0x1) << SPW_LINK1_IM_C_DISCARD_Pos)        /* (SPW_LINK1_IM_C) Discard Mask */
#define SPW_LINK1_IM_C_DISCARD(value)         (SPW_LINK1_IM_C_DISCARD_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_ESCEVENT2_Pos          _UINT32_(8)                                          /* (SPW_LINK1_IM_C) Escape Event 2 Position */
#define SPW_LINK1_IM_C_ESCEVENT2_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_C_ESCEVENT2_Pos)      /* (SPW_LINK1_IM_C) Escape Event 2 Mask */
#define SPW_LINK1_IM_C_ESCEVENT2(value)       (SPW_LINK1_IM_C_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_ESCEVENT1_Pos          _UINT32_(9)                                          /* (SPW_LINK1_IM_C) Escape Event 1 Position */
#define SPW_LINK1_IM_C_ESCEVENT1_Msk          (_UINT32_(0x1) << SPW_LINK1_IM_C_ESCEVENT1_Pos)      /* (SPW_LINK1_IM_C) Escape Event 1 Mask */
#define SPW_LINK1_IM_C_ESCEVENT1(value)       (SPW_LINK1_IM_C_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK1_IM_C register */
#define SPW_LINK1_IM_C_Msk                    _UINT32_(0x000003FF)                                 /* (SPW_LINK1_IM_C) Register Mask  */

#define SPW_LINK1_IM_C_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK1_IM_C Position) Escape Event x */
#define SPW_LINK1_IM_C_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK1_IM_C_ESCEVENT_Pos)       /* (SPW_LINK1_IM_C Mask) ESCEVENT */
#define SPW_LINK1_IM_C_ESCEVENT(value)        (SPW_LINK1_IM_C_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK1_IM_C_ESCEVENT_Pos)) 

