Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_LINK1_CFG : (SPW Offset: 0x420) (R/W 32) SpW Link 1 Config -------- */
#define SPW_LINK1_CFG_COMMAND_Pos             _UINT32_(0)                                          /* (SPW_LINK1_CFG) Command Position */
#define SPW_LINK1_CFG_COMMAND_Msk             (_UINT32_(0x3) << SPW_LINK1_CFG_COMMAND_Pos)         /* (SPW_LINK1_CFG) Command Mask */
#define SPW_LINK1_CFG_COMMAND(value)          (SPW_LINK1_CFG_COMMAND_Msk & (_UINT32_(value) << SPW_LINK1_CFG_COMMAND_Pos)) /* Assigment of value for COMMAND in the SPW_LINK1_CFG register */
#define   SPW_LINK1_CFG_COMMAND_LINK_DISABLE_Val _UINT32_(0x0)                                        /* (SPW_LINK1_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state.  */
#define   SPW_LINK1_CFG_COMMAND_NO_COMMAND_Val _UINT32_(0x1)                                        /* (SPW_LINK1_CFG) State is not actively changed.  */
#define   SPW_LINK1_CFG_COMMAND_AUTO_START_Val _UINT32_(0x2)                                        /* (SPW_LINK1_CFG) The Codec will wait in state Ready until the first NULL character is received.  */
#define   SPW_LINK1_CFG_COMMAND_LINK_START_Val _UINT32_(0x3)                                        /* (SPW_LINK1_CFG) SpaceWire link can proceed to Started state.  */
#define SPW_LINK1_CFG_COMMAND_LINK_DISABLE    (SPW_LINK1_CFG_COMMAND_LINK_DISABLE_Val << SPW_LINK1_CFG_COMMAND_Pos) /* (SPW_LINK1_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state. Position  */
#define SPW_LINK1_CFG_COMMAND_NO_COMMAND      (SPW_LINK1_CFG_COMMAND_NO_COMMAND_Val << SPW_LINK1_CFG_COMMAND_Pos) /* (SPW_LINK1_CFG) State is not actively changed. Position  */
#define SPW_LINK1_CFG_COMMAND_AUTO_START      (SPW_LINK1_CFG_COMMAND_AUTO_START_Val << SPW_LINK1_CFG_COMMAND_Pos) /* (SPW_LINK1_CFG) The Codec will wait in state Ready until the first NULL character is received. Position  */
#define SPW_LINK1_CFG_COMMAND_LINK_START      (SPW_LINK1_CFG_COMMAND_LINK_START_Val << SPW_LINK1_CFG_COMMAND_Pos) /* (SPW_LINK1_CFG) SpaceWire link can proceed to Started state. Position  */
#define SPW_LINK1_CFG_Msk                     _UINT32_(0x00000003)                                 /* (SPW_LINK1_CFG) Register Mask  */


/* -------- SPW_LINK1_CLKDIV : (SPW Offset: 0x424) (R/W 32) SpW Link 1 Clock Division -------- */
#define SPW_LINK1_CLKDIV_TXOPERDIV_Pos        _UINT32_(0)                                          /* (SPW_LINK1_CLKDIV) TxOperDiv Position */
#define SPW_LINK1_CLKDIV_TXOPERDIV_Msk        (_UINT32_(0x1F) << SPW_LINK1_CLKDIV_TXOPERDIV_Pos)   /* (SPW_LINK1_CLKDIV) TxOperDiv Mask */
#define SPW_LINK1_CLKDIV_TXOPERDIV(value)     (SPW_LINK1_CLKDIV_TXOPERDIV_Msk & (_UINT32_(value) << SPW_LINK1_CLKDIV_TXOPERDIV_Pos)) /* Assigment of value for TXOPERDIV in the SPW_LINK1_CLKDIV register */
#define SPW_LINK1_CLKDIV_TXINITDIV_Pos        _UINT32_(16)                                         /* (SPW_LINK1_CLKDIV) TxInitDiv Position */
#define SPW_LINK1_CLKDIV_TXINITDIV_Msk        (_UINT32_(0x1F) << SPW_LINK1_CLKDIV_TXINITDIV_Pos)   /* (SPW_LINK1_CLKDIV) TxInitDiv Mask */
#define SPW_LINK1_CLKDIV_TXINITDIV(value)     (SPW_LINK1_CLKDIV_TXINITDIV_Msk & (_UINT32_(value) << SPW_LINK1_CLKDIV_TXINITDIV_Pos)) /* Assigment of value for TXINITDIV in the SPW_LINK1_CLKDIV register */
#define SPW_LINK1_CLKDIV_Msk                  _UINT32_(0x001F001F)                                 /* (SPW_LINK1_CLKDIV) Register Mask  */


/* -------- SPW_LINK1_STATUS : (SPW Offset: 0x428) ( R/ 32) SpW Link 1 Status -------- */
#define SPW_LINK1_STATUS_LINKSTATE_Pos        _UINT32_(0)                                          /* (SPW_LINK1_STATUS) LinkState Position */
#define SPW_LINK1_STATUS_LINKSTATE_Msk        (_UINT32_(0x7) << SPW_LINK1_STATUS_LINKSTATE_Pos)    /* (SPW_LINK1_STATUS) LinkState Mask */
#define SPW_LINK1_STATUS_LINKSTATE(value)     (SPW_LINK1_STATUS_LINKSTATE_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_LINKSTATE_Pos)) /* Assigment of value for LINKSTATE in the SPW_LINK1_STATUS register */
#define   SPW_LINK1_STATUS_LINKSTATE_ERRORRESET_Val _UINT32_(0x0)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in ErrorReset state  */
#define   SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT_Val _UINT32_(0x1)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in ErrorWait state  */
#define   SPW_LINK1_STATUS_LINKSTATE_READY_Val _UINT32_(0x2)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in Ready state  */
#define   SPW_LINK1_STATUS_LINKSTATE_STARTED_Val _UINT32_(0x3)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in Started state  */
#define   SPW_LINK1_STATUS_LINKSTATE_CONNECTING_Val _UINT32_(0x4)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in Connecting state  */
#define   SPW_LINK1_STATUS_LINKSTATE_RUN_Val  _UINT32_(0x5)                                        /* (SPW_LINK1_STATUS) CODEC link state machine in Run state  */
#define SPW_LINK1_STATUS_LINKSTATE_ERRORRESET (SPW_LINK1_STATUS_LINKSTATE_ERRORRESET_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in ErrorReset state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT  (SPW_LINK1_STATUS_LINKSTATE_ERRORWAIT_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in ErrorWait state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_READY      (SPW_LINK1_STATUS_LINKSTATE_READY_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in Ready state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_STARTED    (SPW_LINK1_STATUS_LINKSTATE_STARTED_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in Started state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_CONNECTING (SPW_LINK1_STATUS_LINKSTATE_CONNECTING_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in Connecting state Position  */
#define SPW_LINK1_STATUS_LINKSTATE_RUN        (SPW_LINK1_STATUS_LINKSTATE_RUN_Val << SPW_LINK1_STATUS_LINKSTATE_Pos) /* (SPW_LINK1_STATUS) CODEC link state machine in Run state Position  */
#define SPW_LINK1_STATUS_TXDEFDIV_Pos         _UINT32_(4)                                          /* (SPW_LINK1_STATUS) TxDefDiv Position */
#define SPW_LINK1_STATUS_TXDEFDIV_Msk         (_UINT32_(0x1F) << SPW_LINK1_STATUS_TXDEFDIV_Pos)    /* (SPW_LINK1_STATUS) TxDefDiv Mask */
#define SPW_LINK1_STATUS_TXDEFDIV(value)      (SPW_LINK1_STATUS_TXDEFDIV_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_TXDEFDIV_Pos)) /* Assigment of value for TXDEFDIV in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_TXEMPTY_Pos          _UINT32_(16)                                         /* (SPW_LINK1_STATUS) TxEmpty Position */
#define SPW_LINK1_STATUS_TXEMPTY_Msk          (_UINT32_(0x1) << SPW_LINK1_STATUS_TXEMPTY_Pos)      /* (SPW_LINK1_STATUS) TxEmpty Mask */
#define SPW_LINK1_STATUS_TXEMPTY(value)       (SPW_LINK1_STATUS_TXEMPTY_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_GOTNULL_Pos          _UINT32_(17)                                         /* (SPW_LINK1_STATUS) GotNull Position */
#define SPW_LINK1_STATUS_GOTNULL_Msk          (_UINT32_(0x1) << SPW_LINK1_STATUS_GOTNULL_Pos)      /* (SPW_LINK1_STATUS) GotNull Mask */
#define SPW_LINK1_STATUS_GOTNULL(value)       (SPW_LINK1_STATUS_GOTNULL_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_GOTNULL_Pos)) /* Assigment of value for GOTNULL in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_GOTFCT_Pos           _UINT32_(18)                                         /* (SPW_LINK1_STATUS) GotFCT Position */
#define SPW_LINK1_STATUS_GOTFCT_Msk           (_UINT32_(0x1) << SPW_LINK1_STATUS_GOTFCT_Pos)       /* (SPW_LINK1_STATUS) GotFCT Mask */
#define SPW_LINK1_STATUS_GOTFCT(value)        (SPW_LINK1_STATUS_GOTFCT_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_GOTFCT_Pos)) /* Assigment of value for GOTFCT in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_GOTNCHAR_Pos         _UINT32_(19)                                         /* (SPW_LINK1_STATUS) GotNChar Position */
#define SPW_LINK1_STATUS_GOTNCHAR_Msk         (_UINT32_(0x1) << SPW_LINK1_STATUS_GOTNCHAR_Pos)     /* (SPW_LINK1_STATUS) GotNChar Mask */
#define SPW_LINK1_STATUS_GOTNCHAR(value)      (SPW_LINK1_STATUS_GOTNCHAR_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_GOTNCHAR_Pos)) /* Assigment of value for GOTNCHAR in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN0_Pos            _UINT32_(20)                                         /* (SPW_LINK1_STATUS) SEEN0 Position */
#define SPW_LINK1_STATUS_SEEN0_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN0_Pos)        /* (SPW_LINK1_STATUS) SEEN0 Mask */
#define SPW_LINK1_STATUS_SEEN0(value)         (SPW_LINK1_STATUS_SEEN0_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN0_Pos)) /* Assigment of value for SEEN0 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN1_Pos            _UINT32_(21)                                         /* (SPW_LINK1_STATUS) SEEN1 Position */
#define SPW_LINK1_STATUS_SEEN1_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN1_Pos)        /* (SPW_LINK1_STATUS) SEEN1 Mask */
#define SPW_LINK1_STATUS_SEEN1(value)         (SPW_LINK1_STATUS_SEEN1_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN1_Pos)) /* Assigment of value for SEEN1 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN2_Pos            _UINT32_(22)                                         /* (SPW_LINK1_STATUS) SEEN2 Position */
#define SPW_LINK1_STATUS_SEEN2_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN2_Pos)        /* (SPW_LINK1_STATUS) SEEN2 Mask */
#define SPW_LINK1_STATUS_SEEN2(value)         (SPW_LINK1_STATUS_SEEN2_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN2_Pos)) /* Assigment of value for SEEN2 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN3_Pos            _UINT32_(23)                                         /* (SPW_LINK1_STATUS) SEEN3 Position */
#define SPW_LINK1_STATUS_SEEN3_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN3_Pos)        /* (SPW_LINK1_STATUS) SEEN3 Mask */
#define SPW_LINK1_STATUS_SEEN3(value)         (SPW_LINK1_STATUS_SEEN3_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN3_Pos)) /* Assigment of value for SEEN3 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN4_Pos            _UINT32_(24)                                         /* (SPW_LINK1_STATUS) SEEN4 Position */
#define SPW_LINK1_STATUS_SEEN4_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN4_Pos)        /* (SPW_LINK1_STATUS) SEEN4 Mask */
#define SPW_LINK1_STATUS_SEEN4(value)         (SPW_LINK1_STATUS_SEEN4_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN4_Pos)) /* Assigment of value for SEEN4 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_SEEN5_Pos            _UINT32_(25)                                         /* (SPW_LINK1_STATUS) SEEN5 Position */
#define SPW_LINK1_STATUS_SEEN5_Msk            (_UINT32_(0x1) << SPW_LINK1_STATUS_SEEN5_Pos)        /* (SPW_LINK1_STATUS) SEEN5 Mask */
#define SPW_LINK1_STATUS_SEEN5(value)         (SPW_LINK1_STATUS_SEEN5_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN5_Pos)) /* Assigment of value for SEEN5 in the SPW_LINK1_STATUS register */
#define SPW_LINK1_STATUS_Msk                  _UINT32_(0x03FF01F7)                                 /* (SPW_LINK1_STATUS) Register Mask  */

#define SPW_LINK1_STATUS_SEEN_Pos             _UINT32_(20)                                         /* (SPW_LINK1_STATUS Position) SEEN5 */
#define SPW_LINK1_STATUS_SEEN_Msk             (_UINT32_(0x3F) << SPW_LINK1_STATUS_SEEN_Pos)        /* (SPW_LINK1_STATUS Mask) SEEN */
#define SPW_LINK1_STATUS_SEEN(value)          (SPW_LINK1_STATUS_SEEN_Msk & (_UINT32_(value) << SPW_LINK1_STATUS_SEEN_Pos)) 

/* -------- SPW_LINK1_SWRESET : (SPW Offset: 0x42C) (R/W 32) SpW Link 1 Software Reset -------- */
#define SPW_LINK1_SWRESET_PATTERN_Pos         _UINT32_(0)                                          /* (SPW_LINK1_SWRESET) Pattern Position */
#define SPW_LINK1_SWRESET_PATTERN_Msk         (_UINT32_(0xFFFFFFFF) << SPW_LINK1_SWRESET_PATTERN_Pos) /* (SPW_LINK1_SWRESET) Pattern Mask */
#define SPW_LINK1_SWRESET_PATTERN(value)      (SPW_LINK1_SWRESET_PATTERN_Msk & (_UINT32_(value) << SPW_LINK1_SWRESET_PATTERN_Pos)) /* Assigment of value for PATTERN in the SPW_LINK1_SWRESET register */
#define SPW_LINK1_SWRESET_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (SPW_LINK1_SWRESET) Register Mask  */


