Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK1_DISTINTPI_R_DI_Pos          _UINT32_(0)                                          /* (SPW_LINK1_DISTINTPI_R Position) Distributed Interrupt */
#define SPW_LINK1_DISTINTPI_R_DI_Msk          (_UINT32_(0xFFFFFFFF) << SPW_LINK1_DISTINTPI_R_DI_Pos) /* (SPW_LINK1_DISTINTPI_R Mask) DI */
#define SPW_LINK1_DISTINTPI_R_DI(value)       (SPW_LINK1_DISTINTPI_R_DI_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_R_DI_Pos)) 

/* -------- SPW_LINK1_DISTINTPI_RCS : (SPW Offset: 0x44C) (R/W 32) SpW Link 1 Distributed Interrupt Pending Read and Clear Interrupt -------- */
#define SPW_LINK1_DISTINTPI_RCS_DI0_Pos       _UINT32_(0)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI0_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI0_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI0(value)    (SPW_LINK1_DISTINTPI_RCS_DI0_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI0_Pos)) /* Assigment of value for DI0 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI1_Pos       _UINT32_(1)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI1_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI1_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI1(value)    (SPW_LINK1_DISTINTPI_RCS_DI1_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI1_Pos)) /* Assigment of value for DI1 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI2_Pos       _UINT32_(2)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI2_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI2_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI2(value)    (SPW_LINK1_DISTINTPI_RCS_DI2_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI2_Pos)) /* Assigment of value for DI2 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI3_Pos       _UINT32_(3)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI3_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI3_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI3(value)    (SPW_LINK1_DISTINTPI_RCS_DI3_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI3_Pos)) /* Assigment of value for DI3 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI4_Pos       _UINT32_(4)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI4_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI4_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI4(value)    (SPW_LINK1_DISTINTPI_RCS_DI4_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI4_Pos)) /* Assigment of value for DI4 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI5_Pos       _UINT32_(5)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI5_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI5_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI5(value)    (SPW_LINK1_DISTINTPI_RCS_DI5_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI5_Pos)) /* Assigment of value for DI5 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI6_Pos       _UINT32_(6)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI6_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI6_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI6(value)    (SPW_LINK1_DISTINTPI_RCS_DI6_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI6_Pos)) /* Assigment of value for DI6 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI7_Pos       _UINT32_(7)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI7_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI7_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI7(value)    (SPW_LINK1_DISTINTPI_RCS_DI7_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI7_Pos)) /* Assigment of value for DI7 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI8_Pos       _UINT32_(8)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI8_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI8_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI8(value)    (SPW_LINK1_DISTINTPI_RCS_DI8_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI8_Pos)) /* Assigment of value for DI8 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI9_Pos       _UINT32_(9)                                          /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI9_Msk       (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI9_Pos)   /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI9(value)    (SPW_LINK1_DISTINTPI_RCS_DI9_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI9_Pos)) /* Assigment of value for DI9 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI10_Pos      _UINT32_(10)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI10_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI10_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI10(value)   (SPW_LINK1_DISTINTPI_RCS_DI10_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI10_Pos)) /* Assigment of value for DI10 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI11_Pos      _UINT32_(11)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI11_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI11_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI11(value)   (SPW_LINK1_DISTINTPI_RCS_DI11_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI11_Pos)) /* Assigment of value for DI11 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI12_Pos      _UINT32_(12)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI12_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI12_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI12(value)   (SPW_LINK1_DISTINTPI_RCS_DI12_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI12_Pos)) /* Assigment of value for DI12 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI13_Pos      _UINT32_(13)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI13_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI13_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI13(value)   (SPW_LINK1_DISTINTPI_RCS_DI13_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI13_Pos)) /* Assigment of value for DI13 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI14_Pos      _UINT32_(14)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI14_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI14_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI14(value)   (SPW_LINK1_DISTINTPI_RCS_DI14_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI14_Pos)) /* Assigment of value for DI14 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI15_Pos      _UINT32_(15)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI15_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI15_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI15(value)   (SPW_LINK1_DISTINTPI_RCS_DI15_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI15_Pos)) /* Assigment of value for DI15 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI16_Pos      _UINT32_(16)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI16_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI16_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI16(value)   (SPW_LINK1_DISTINTPI_RCS_DI16_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI16_Pos)) /* Assigment of value for DI16 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI17_Pos      _UINT32_(17)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI17_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI17_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI17(value)   (SPW_LINK1_DISTINTPI_RCS_DI17_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI17_Pos)) /* Assigment of value for DI17 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI18_Pos      _UINT32_(18)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI18_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI18_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI18(value)   (SPW_LINK1_DISTINTPI_RCS_DI18_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI18_Pos)) /* Assigment of value for DI18 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI19_Pos      _UINT32_(19)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI19_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI19_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI19(value)   (SPW_LINK1_DISTINTPI_RCS_DI19_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI19_Pos)) /* Assigment of value for DI19 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI20_Pos      _UINT32_(20)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI20_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI20_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI20(value)   (SPW_LINK1_DISTINTPI_RCS_DI20_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI20_Pos)) /* Assigment of value for DI20 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI21_Pos      _UINT32_(21)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI21_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI21_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI21(value)   (SPW_LINK1_DISTINTPI_RCS_DI21_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI21_Pos)) /* Assigment of value for DI21 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI22_Pos      _UINT32_(22)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI22_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI22_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI22(value)   (SPW_LINK1_DISTINTPI_RCS_DI22_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI22_Pos)) /* Assigment of value for DI22 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI23_Pos      _UINT32_(23)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI23_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI23_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI23(value)   (SPW_LINK1_DISTINTPI_RCS_DI23_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI23_Pos)) /* Assigment of value for DI23 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI24_Pos      _UINT32_(24)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI24_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI24_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI24(value)   (SPW_LINK1_DISTINTPI_RCS_DI24_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI24_Pos)) /* Assigment of value for DI24 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI25_Pos      _UINT32_(25)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI25_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI25_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI25(value)   (SPW_LINK1_DISTINTPI_RCS_DI25_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI25_Pos)) /* Assigment of value for DI25 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI26_Pos      _UINT32_(26)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI26_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI26_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI26(value)   (SPW_LINK1_DISTINTPI_RCS_DI26_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI26_Pos)) /* Assigment of value for DI26 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI27_Pos      _UINT32_(27)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI27_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI27_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI27(value)   (SPW_LINK1_DISTINTPI_RCS_DI27_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI27_Pos)) /* Assigment of value for DI27 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI28_Pos      _UINT32_(28)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI28_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI28_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI28(value)   (SPW_LINK1_DISTINTPI_RCS_DI28_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI28_Pos)) /* Assigment of value for DI28 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI29_Pos      _UINT32_(29)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI29_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI29_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI29(value)   (SPW_LINK1_DISTINTPI_RCS_DI29_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI29_Pos)) /* Assigment of value for DI29 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI30_Pos      _UINT32_(30)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI30_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI30_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI30(value)   (SPW_LINK1_DISTINTPI_RCS_DI30_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI30_Pos)) /* Assigment of value for DI30 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_DI31_Pos      _UINT32_(31)                                         /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Position */
#define SPW_LINK1_DISTINTPI_RCS_DI31_Msk      (_UINT32_(0x1) << SPW_LINK1_DISTINTPI_RCS_DI31_Pos)  /* (SPW_LINK1_DISTINTPI_RCS) Distributed Interrupt Mask */
#define SPW_LINK1_DISTINTPI_RCS_DI31(value)   (SPW_LINK1_DISTINTPI_RCS_DI31_Msk & (_UINT32_(value) << SPW_LINK1_DISTINTPI_RCS_DI31_Pos)) /* Assigment of value for DI31 in the SPW_LINK1_DISTINTPI_RCS register */
#define SPW_LINK1_DISTINTPI_RCS_Msk           _UINT32_(0xFFFFFFFF)                                 /* (SPW_LINK1_DISTINTPI_RCS) Register Mask  */

