Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK1_DISTACKIM_C_DA_Pos          _UINT32_(0)                                          /* (SPW_LINK1_DISTACKIM_C Position) Distributed Acknowledge mask */
#define SPW_LINK1_DISTACKIM_C_DA_Msk          (_UINT32_(0xFFFFFFFF) << SPW_LINK1_DISTACKIM_C_DA_Pos) /* (SPW_LINK1_DISTACKIM_C Mask) DA */
#define SPW_LINK1_DISTACKIM_C_DA(value)       (SPW_LINK1_DISTACKIM_C_DA_Msk & (_UINT32_(value) << SPW_LINK1_DISTACKIM_C_DA_Pos)) 

/* -------- SPW_LINK2_PI_RM : (SPW Offset: 0x480) ( R/ 32) SpW Link 2 Pending Read Masked Interrupt -------- */
#define SPW_LINK2_PI_RM_DISERR_Pos            _UINT32_(0)                                          /* (SPW_LINK2_PI_RM) DisErr Position */
#define SPW_LINK2_PI_RM_DISERR_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_RM_DISERR_Pos)        /* (SPW_LINK2_PI_RM) DisErr Mask */
#define SPW_LINK2_PI_RM_DISERR(value)         (SPW_LINK2_PI_RM_DISERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_PARERR_Pos            _UINT32_(1)                                          /* (SPW_LINK2_PI_RM) ParErr Position */
#define SPW_LINK2_PI_RM_PARERR_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_RM_PARERR_Pos)        /* (SPW_LINK2_PI_RM) ParErr Mask */
#define SPW_LINK2_PI_RM_PARERR(value)         (SPW_LINK2_PI_RM_PARERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_ESCERR_Pos            _UINT32_(2)                                          /* (SPW_LINK2_PI_RM) ESCErr Position */
#define SPW_LINK2_PI_RM_ESCERR_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_RM_ESCERR_Pos)        /* (SPW_LINK2_PI_RM) ESCErr Mask */
#define SPW_LINK2_PI_RM_ESCERR(value)         (SPW_LINK2_PI_RM_ESCERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_CRERR_Pos             _UINT32_(3)                                          /* (SPW_LINK2_PI_RM) CrErr Position */
#define SPW_LINK2_PI_RM_CRERR_Msk             (_UINT32_(0x1) << SPW_LINK2_PI_RM_CRERR_Pos)         /* (SPW_LINK2_PI_RM) CrErr Mask */
#define SPW_LINK2_PI_RM_CRERR(value)          (SPW_LINK2_PI_RM_CRERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_LINKABORT_Pos         _UINT32_(4)                                          /* (SPW_LINK2_PI_RM) LinkAbort Position */
#define SPW_LINK2_PI_RM_LINKABORT_Msk         (_UINT32_(0x1) << SPW_LINK2_PI_RM_LINKABORT_Pos)     /* (SPW_LINK2_PI_RM) LinkAbort Mask */
#define SPW_LINK2_PI_RM_LINKABORT(value)      (SPW_LINK2_PI_RM_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_EEPTRANS_Pos          _UINT32_(5)                                          /* (SPW_LINK2_PI_RM) EEP transmitted Position */
#define SPW_LINK2_PI_RM_EEPTRANS_Msk          (_UINT32_(0x1) << SPW_LINK2_PI_RM_EEPTRANS_Pos)      /* (SPW_LINK2_PI_RM) EEP transmitted Mask */
#define SPW_LINK2_PI_RM_EEPTRANS(value)       (SPW_LINK2_PI_RM_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_EEPREC_Pos            _UINT32_(6)                                          /* (SPW_LINK2_PI_RM) EEP received Position */
#define SPW_LINK2_PI_RM_EEPREC_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_RM_EEPREC_Pos)        /* (SPW_LINK2_PI_RM) EEP received Mask */
#define SPW_LINK2_PI_RM_EEPREC(value)         (SPW_LINK2_PI_RM_EEPREC_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_DISCARD_Pos           _UINT32_(7)                                          /* (SPW_LINK2_PI_RM) Discard Position */
#define SPW_LINK2_PI_RM_DISCARD_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_RM_DISCARD_Pos)       /* (SPW_LINK2_PI_RM) Discard Mask */
#define SPW_LINK2_PI_RM_DISCARD(value)        (SPW_LINK2_PI_RM_DISCARD_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_ESCEVENT2_Pos         _UINT32_(8)                                          /* (SPW_LINK2_PI_RM) Escape Event 2 Position */
#define SPW_LINK2_PI_RM_ESCEVENT2_Msk         (_UINT32_(0x1) << SPW_LINK2_PI_RM_ESCEVENT2_Pos)     /* (SPW_LINK2_PI_RM) Escape Event 2 Mask */
#define SPW_LINK2_PI_RM_ESCEVENT2(value)      (SPW_LINK2_PI_RM_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_ESCEVENT1_Pos         _UINT32_(9)                                          /* (SPW_LINK2_PI_RM) Escape Event 1 Position */
#define SPW_LINK2_PI_RM_ESCEVENT1_Msk         (_UINT32_(0x1) << SPW_LINK2_PI_RM_ESCEVENT1_Pos)     /* (SPW_LINK2_PI_RM) Escape Event 1 Mask */
#define SPW_LINK2_PI_RM_ESCEVENT1(value)      (SPW_LINK2_PI_RM_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK2_PI_RM register */
#define SPW_LINK2_PI_RM_Msk                   _UINT32_(0x000003FF)                                 /* (SPW_LINK2_PI_RM) Register Mask  */

#define SPW_LINK2_PI_RM_ESCEVENT_Pos          _UINT32_(8)                                          /* (SPW_LINK2_PI_RM Position) Escape Event x */
#define SPW_LINK2_PI_RM_ESCEVENT_Msk          (_UINT32_(0x3) << SPW_LINK2_PI_RM_ESCEVENT_Pos)      /* (SPW_LINK2_PI_RM Mask) ESCEVENT */
#define SPW_LINK2_PI_RM_ESCEVENT(value)       (SPW_LINK2_PI_RM_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_PI_RM_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_PI_R : (SPW Offset: 0x488) ( R/ 32) SpW Link 2 Pending Read Interrupt -------- */
#define SPW_LINK2_PI_R_DISERR_Pos             _UINT32_(0)                                          /* (SPW_LINK2_PI_R) DisErr Position */
#define SPW_LINK2_PI_R_DISERR_Msk             (_UINT32_(0x1) << SPW_LINK2_PI_R_DISERR_Pos)         /* (SPW_LINK2_PI_R) DisErr Mask */
#define SPW_LINK2_PI_R_DISERR(value)          (SPW_LINK2_PI_R_DISERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_PARERR_Pos             _UINT32_(1)                                          /* (SPW_LINK2_PI_R) ParErr Position */
#define SPW_LINK2_PI_R_PARERR_Msk             (_UINT32_(0x1) << SPW_LINK2_PI_R_PARERR_Pos)         /* (SPW_LINK2_PI_R) ParErr Mask */
#define SPW_LINK2_PI_R_PARERR(value)          (SPW_LINK2_PI_R_PARERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_ESCERR_Pos             _UINT32_(2)                                          /* (SPW_LINK2_PI_R) ESCErr Position */
#define SPW_LINK2_PI_R_ESCERR_Msk             (_UINT32_(0x1) << SPW_LINK2_PI_R_ESCERR_Pos)         /* (SPW_LINK2_PI_R) ESCErr Mask */
#define SPW_LINK2_PI_R_ESCERR(value)          (SPW_LINK2_PI_R_ESCERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_CRERR_Pos              _UINT32_(3)                                          /* (SPW_LINK2_PI_R) CrErr Position */
#define SPW_LINK2_PI_R_CRERR_Msk              (_UINT32_(0x1) << SPW_LINK2_PI_R_CRERR_Pos)          /* (SPW_LINK2_PI_R) CrErr Mask */
#define SPW_LINK2_PI_R_CRERR(value)           (SPW_LINK2_PI_R_CRERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_LINKABORT_Pos          _UINT32_(4)                                          /* (SPW_LINK2_PI_R) LinkAbort Position */
#define SPW_LINK2_PI_R_LINKABORT_Msk          (_UINT32_(0x1) << SPW_LINK2_PI_R_LINKABORT_Pos)      /* (SPW_LINK2_PI_R) LinkAbort Mask */
#define SPW_LINK2_PI_R_LINKABORT(value)       (SPW_LINK2_PI_R_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_EEPTRANS_Pos           _UINT32_(5)                                          /* (SPW_LINK2_PI_R) EEP transmitted Position */
#define SPW_LINK2_PI_R_EEPTRANS_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_R_EEPTRANS_Pos)       /* (SPW_LINK2_PI_R) EEP transmitted Mask */
#define SPW_LINK2_PI_R_EEPTRANS(value)        (SPW_LINK2_PI_R_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_EEPREC_Pos             _UINT32_(6)                                          /* (SPW_LINK2_PI_R) EEP received Position */
#define SPW_LINK2_PI_R_EEPREC_Msk             (_UINT32_(0x1) << SPW_LINK2_PI_R_EEPREC_Pos)         /* (SPW_LINK2_PI_R) EEP received Mask */
#define SPW_LINK2_PI_R_EEPREC(value)          (SPW_LINK2_PI_R_EEPREC_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_DISCARD_Pos            _UINT32_(7)                                          /* (SPW_LINK2_PI_R) Discard Position */
#define SPW_LINK2_PI_R_DISCARD_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_R_DISCARD_Pos)        /* (SPW_LINK2_PI_R) Discard Mask */
#define SPW_LINK2_PI_R_DISCARD(value)         (SPW_LINK2_PI_R_DISCARD_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_ESCEVENT2_Pos          _UINT32_(8)                                          /* (SPW_LINK2_PI_R) Escape Event 2 Position */
#define SPW_LINK2_PI_R_ESCEVENT2_Msk          (_UINT32_(0x1) << SPW_LINK2_PI_R_ESCEVENT2_Pos)      /* (SPW_LINK2_PI_R) Escape Event 2 Mask */
#define SPW_LINK2_PI_R_ESCEVENT2(value)       (SPW_LINK2_PI_R_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_ESCEVENT1_Pos          _UINT32_(9)                                          /* (SPW_LINK2_PI_R) Escape Event 1 Position */
#define SPW_LINK2_PI_R_ESCEVENT1_Msk          (_UINT32_(0x1) << SPW_LINK2_PI_R_ESCEVENT1_Pos)      /* (SPW_LINK2_PI_R) Escape Event 1 Mask */
#define SPW_LINK2_PI_R_ESCEVENT1(value)       (SPW_LINK2_PI_R_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK2_PI_R register */
#define SPW_LINK2_PI_R_Msk                    _UINT32_(0x000003FF)                                 /* (SPW_LINK2_PI_R) Register Mask  */

#define SPW_LINK2_PI_R_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK2_PI_R Position) Escape Event x */
#define SPW_LINK2_PI_R_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK2_PI_R_ESCEVENT_Pos)       /* (SPW_LINK2_PI_R Mask) ESCEVENT */
#define SPW_LINK2_PI_R_ESCEVENT(value)        (SPW_LINK2_PI_R_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_PI_R_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_PI_RCS : (SPW Offset: 0x48C) (R/W 32) SpW Link 2 Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_LINK2_PI_RCS_DISERR_Pos           _UINT32_(0)                                          /* (SPW_LINK2_PI_RCS) DisErr Position */
#define SPW_LINK2_PI_RCS_DISERR_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_RCS_DISERR_Pos)       /* (SPW_LINK2_PI_RCS) DisErr Mask */
#define SPW_LINK2_PI_RCS_DISERR(value)        (SPW_LINK2_PI_RCS_DISERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_PARERR_Pos           _UINT32_(1)                                          /* (SPW_LINK2_PI_RCS) ParErr Position */
#define SPW_LINK2_PI_RCS_PARERR_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_RCS_PARERR_Pos)       /* (SPW_LINK2_PI_RCS) ParErr Mask */
#define SPW_LINK2_PI_RCS_PARERR(value)        (SPW_LINK2_PI_RCS_PARERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_ESCERR_Pos           _UINT32_(2)                                          /* (SPW_LINK2_PI_RCS) ESCErr Position */
#define SPW_LINK2_PI_RCS_ESCERR_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_RCS_ESCERR_Pos)       /* (SPW_LINK2_PI_RCS) ESCErr Mask */
#define SPW_LINK2_PI_RCS_ESCERR(value)        (SPW_LINK2_PI_RCS_ESCERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_CRERR_Pos            _UINT32_(3)                                          /* (SPW_LINK2_PI_RCS) CrErr Position */
#define SPW_LINK2_PI_RCS_CRERR_Msk            (_UINT32_(0x1) << SPW_LINK2_PI_RCS_CRERR_Pos)        /* (SPW_LINK2_PI_RCS) CrErr Mask */
#define SPW_LINK2_PI_RCS_CRERR(value)         (SPW_LINK2_PI_RCS_CRERR_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_LINKABORT_Pos        _UINT32_(4)                                          /* (SPW_LINK2_PI_RCS) LinkAbort Position */
#define SPW_LINK2_PI_RCS_LINKABORT_Msk        (_UINT32_(0x1) << SPW_LINK2_PI_RCS_LINKABORT_Pos)    /* (SPW_LINK2_PI_RCS) LinkAbort Mask */
#define SPW_LINK2_PI_RCS_LINKABORT(value)     (SPW_LINK2_PI_RCS_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_EEPTRANS_Pos         _UINT32_(5)                                          /* (SPW_LINK2_PI_RCS) EEP transmitted Position */
#define SPW_LINK2_PI_RCS_EEPTRANS_Msk         (_UINT32_(0x1) << SPW_LINK2_PI_RCS_EEPTRANS_Pos)     /* (SPW_LINK2_PI_RCS) EEP transmitted Mask */
#define SPW_LINK2_PI_RCS_EEPTRANS(value)      (SPW_LINK2_PI_RCS_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_EEPREC_Pos           _UINT32_(6)                                          /* (SPW_LINK2_PI_RCS) EEP received Position */
#define SPW_LINK2_PI_RCS_EEPREC_Msk           (_UINT32_(0x1) << SPW_LINK2_PI_RCS_EEPREC_Pos)       /* (SPW_LINK2_PI_RCS) EEP received Mask */
#define SPW_LINK2_PI_RCS_EEPREC(value)        (SPW_LINK2_PI_RCS_EEPREC_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_DISCARD_Pos          _UINT32_(7)                                          /* (SPW_LINK2_PI_RCS) Discard Position */
#define SPW_LINK2_PI_RCS_DISCARD_Msk          (_UINT32_(0x1) << SPW_LINK2_PI_RCS_DISCARD_Pos)      /* (SPW_LINK2_PI_RCS) Discard Mask */
#define SPW_LINK2_PI_RCS_DISCARD(value)       (SPW_LINK2_PI_RCS_DISCARD_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_ESCEVENT2_Pos        _UINT32_(8)                                          /* (SPW_LINK2_PI_RCS) Escape Event 2 Position */
#define SPW_LINK2_PI_RCS_ESCEVENT2_Msk        (_UINT32_(0x1) << SPW_LINK2_PI_RCS_ESCEVENT2_Pos)    /* (SPW_LINK2_PI_RCS) Escape Event 2 Mask */
#define SPW_LINK2_PI_RCS_ESCEVENT2(value)     (SPW_LINK2_PI_RCS_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_ESCEVENT1_Pos        _UINT32_(9)                                          /* (SPW_LINK2_PI_RCS) Escape Event 1 Position */
#define SPW_LINK2_PI_RCS_ESCEVENT1_Msk        (_UINT32_(0x1) << SPW_LINK2_PI_RCS_ESCEVENT1_Pos)    /* (SPW_LINK2_PI_RCS) Escape Event 1 Mask */
#define SPW_LINK2_PI_RCS_ESCEVENT1(value)     (SPW_LINK2_PI_RCS_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK2_PI_RCS register */
#define SPW_LINK2_PI_RCS_Msk                  _UINT32_(0x000003FF)                                 /* (SPW_LINK2_PI_RCS) Register Mask  */

#define SPW_LINK2_PI_RCS_ESCEVENT_Pos         _UINT32_(8)                                          /* (SPW_LINK2_PI_RCS Position) Escape Event x */
#define SPW_LINK2_PI_RCS_ESCEVENT_Msk         (_UINT32_(0x3) << SPW_LINK2_PI_RCS_ESCEVENT_Pos)     /* (SPW_LINK2_PI_RCS Mask) ESCEVENT */
#define SPW_LINK2_PI_RCS_ESCEVENT(value)      (SPW_LINK2_PI_RCS_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_PI_RCS_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_IM : (SPW Offset: 0x490) (R/W 32) SpW Link 2 Interrupt Mask -------- */
#define SPW_LINK2_IM_DISERR_Pos               _UINT32_(0)                                          /* (SPW_LINK2_IM) DisErr Position */
#define SPW_LINK2_IM_DISERR_Msk               (_UINT32_(0x1) << SPW_LINK2_IM_DISERR_Pos)           /* (SPW_LINK2_IM) DisErr Mask */
#define SPW_LINK2_IM_DISERR(value)            (SPW_LINK2_IM_DISERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_PARERR_Pos               _UINT32_(1)                                          /* (SPW_LINK2_IM) ParErr Position */
#define SPW_LINK2_IM_PARERR_Msk               (_UINT32_(0x1) << SPW_LINK2_IM_PARERR_Pos)           /* (SPW_LINK2_IM) ParErr Mask */
#define SPW_LINK2_IM_PARERR(value)            (SPW_LINK2_IM_PARERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_ESCERR_Pos               _UINT32_(2)                                          /* (SPW_LINK2_IM) ESCErr Position */
#define SPW_LINK2_IM_ESCERR_Msk               (_UINT32_(0x1) << SPW_LINK2_IM_ESCERR_Pos)           /* (SPW_LINK2_IM) ESCErr Mask */
#define SPW_LINK2_IM_ESCERR(value)            (SPW_LINK2_IM_ESCERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_CRERR_Pos                _UINT32_(3)                                          /* (SPW_LINK2_IM) CrErr Position */
#define SPW_LINK2_IM_CRERR_Msk                (_UINT32_(0x1) << SPW_LINK2_IM_CRERR_Pos)            /* (SPW_LINK2_IM) CrErr Mask */
#define SPW_LINK2_IM_CRERR(value)             (SPW_LINK2_IM_CRERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_LINKABORT_Pos            _UINT32_(4)                                          /* (SPW_LINK2_IM) LinkAbort Position */
#define SPW_LINK2_IM_LINKABORT_Msk            (_UINT32_(0x1) << SPW_LINK2_IM_LINKABORT_Pos)        /* (SPW_LINK2_IM) LinkAbort Mask */
#define SPW_LINK2_IM_LINKABORT(value)         (SPW_LINK2_IM_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK2_IM_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_EEPTRANS_Pos             _UINT32_(5)                                          /* (SPW_LINK2_IM) EEP transmitted Position */
#define SPW_LINK2_IM_EEPTRANS_Msk             (_UINT32_(0x1) << SPW_LINK2_IM_EEPTRANS_Pos)         /* (SPW_LINK2_IM) EEP transmitted Mask */
#define SPW_LINK2_IM_EEPTRANS(value)          (SPW_LINK2_IM_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK2_IM_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_EEPREC_Pos               _UINT32_(6)                                          /* (SPW_LINK2_IM) EEP received Position */
#define SPW_LINK2_IM_EEPREC_Msk               (_UINT32_(0x1) << SPW_LINK2_IM_EEPREC_Pos)           /* (SPW_LINK2_IM) EEP received Mask */
#define SPW_LINK2_IM_EEPREC(value)            (SPW_LINK2_IM_EEPREC_Msk & (_UINT32_(value) << SPW_LINK2_IM_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_DISCARD_Pos              _UINT32_(7)                                          /* (SPW_LINK2_IM) Discard Position */
#define SPW_LINK2_IM_DISCARD_Msk              (_UINT32_(0x1) << SPW_LINK2_IM_DISCARD_Pos)          /* (SPW_LINK2_IM) Discard Mask */
#define SPW_LINK2_IM_DISCARD(value)           (SPW_LINK2_IM_DISCARD_Msk & (_UINT32_(value) << SPW_LINK2_IM_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_ESCEVENT2_Pos            _UINT32_(8)                                          /* (SPW_LINK2_IM) Escape Event 2 Position */
#define SPW_LINK2_IM_ESCEVENT2_Msk            (_UINT32_(0x1) << SPW_LINK2_IM_ESCEVENT2_Pos)        /* (SPW_LINK2_IM) Escape Event 2 Mask */
#define SPW_LINK2_IM_ESCEVENT2(value)         (SPW_LINK2_IM_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK2_IM_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_ESCEVENT1_Pos            _UINT32_(9)                                          /* (SPW_LINK2_IM) Escape Event 1 Position */
#define SPW_LINK2_IM_ESCEVENT1_Msk            (_UINT32_(0x1) << SPW_LINK2_IM_ESCEVENT1_Pos)        /* (SPW_LINK2_IM) Escape Event 1 Mask */
#define SPW_LINK2_IM_ESCEVENT1(value)         (SPW_LINK2_IM_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK2_IM_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK2_IM register */
#define SPW_LINK2_IM_Msk                      _UINT32_(0x000003FF)                                 /* (SPW_LINK2_IM) Register Mask  */

#define SPW_LINK2_IM_ESCEVENT_Pos             _UINT32_(8)                                          /* (SPW_LINK2_IM Position) Escape Event x */
#define SPW_LINK2_IM_ESCEVENT_Msk             (_UINT32_(0x3) << SPW_LINK2_IM_ESCEVENT_Pos)         /* (SPW_LINK2_IM Mask) ESCEVENT */
#define SPW_LINK2_IM_ESCEVENT(value)          (SPW_LINK2_IM_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_IM_ESCEVENT_Pos)) 

