Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK2_IM_S_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK2_IM_S Position) Escape Event x */
#define SPW_LINK2_IM_S_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK2_IM_S_ESCEVENT_Pos)       /* (SPW_LINK2_IM_S Mask) ESCEVENT */
#define SPW_LINK2_IM_S_ESCEVENT(value)        (SPW_LINK2_IM_S_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_IM_S_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_IM_C : (SPW Offset: 0x49C) ( /W 32) SpW Link 2 Interrupt Clear Mask -------- */
#define SPW_LINK2_IM_C_DISERR_Pos             _UINT32_(0)                                          /* (SPW_LINK2_IM_C) DisErr Position */
#define SPW_LINK2_IM_C_DISERR_Msk             (_UINT32_(0x1) << SPW_LINK2_IM_C_DISERR_Pos)         /* (SPW_LINK2_IM_C) DisErr Mask */
#define SPW_LINK2_IM_C_DISERR(value)          (SPW_LINK2_IM_C_DISERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_DISERR_Pos)) /* Assigment of value for DISERR in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_PARERR_Pos             _UINT32_(1)                                          /* (SPW_LINK2_IM_C) ParErr Position */
#define SPW_LINK2_IM_C_PARERR_Msk             (_UINT32_(0x1) << SPW_LINK2_IM_C_PARERR_Pos)         /* (SPW_LINK2_IM_C) ParErr Mask */
#define SPW_LINK2_IM_C_PARERR(value)          (SPW_LINK2_IM_C_PARERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_PARERR_Pos)) /* Assigment of value for PARERR in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_ESCERR_Pos             _UINT32_(2)                                          /* (SPW_LINK2_IM_C) ESCErr Position */
#define SPW_LINK2_IM_C_ESCERR_Msk             (_UINT32_(0x1) << SPW_LINK2_IM_C_ESCERR_Pos)         /* (SPW_LINK2_IM_C) ESCErr Mask */
#define SPW_LINK2_IM_C_ESCERR(value)          (SPW_LINK2_IM_C_ESCERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_ESCERR_Pos)) /* Assigment of value for ESCERR in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_CRERR_Pos              _UINT32_(3)                                          /* (SPW_LINK2_IM_C) CrErr Position */
#define SPW_LINK2_IM_C_CRERR_Msk              (_UINT32_(0x1) << SPW_LINK2_IM_C_CRERR_Pos)          /* (SPW_LINK2_IM_C) CrErr Mask */
#define SPW_LINK2_IM_C_CRERR(value)           (SPW_LINK2_IM_C_CRERR_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_CRERR_Pos)) /* Assigment of value for CRERR in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_LINKABORT_Pos          _UINT32_(4)                                          /* (SPW_LINK2_IM_C) LinkAbort Position */
#define SPW_LINK2_IM_C_LINKABORT_Msk          (_UINT32_(0x1) << SPW_LINK2_IM_C_LINKABORT_Pos)      /* (SPW_LINK2_IM_C) LinkAbort Mask */
#define SPW_LINK2_IM_C_LINKABORT(value)       (SPW_LINK2_IM_C_LINKABORT_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_LINKABORT_Pos)) /* Assigment of value for LINKABORT in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_EEPTRANS_Pos           _UINT32_(5)                                          /* (SPW_LINK2_IM_C) EEP transmitted Position */
#define SPW_LINK2_IM_C_EEPTRANS_Msk           (_UINT32_(0x1) << SPW_LINK2_IM_C_EEPTRANS_Pos)       /* (SPW_LINK2_IM_C) EEP transmitted Mask */
#define SPW_LINK2_IM_C_EEPTRANS(value)        (SPW_LINK2_IM_C_EEPTRANS_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_EEPTRANS_Pos)) /* Assigment of value for EEPTRANS in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_EEPREC_Pos             _UINT32_(6)                                          /* (SPW_LINK2_IM_C) EEP received Position */
#define SPW_LINK2_IM_C_EEPREC_Msk             (_UINT32_(0x1) << SPW_LINK2_IM_C_EEPREC_Pos)         /* (SPW_LINK2_IM_C) EEP received Mask */
#define SPW_LINK2_IM_C_EEPREC(value)          (SPW_LINK2_IM_C_EEPREC_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_EEPREC_Pos)) /* Assigment of value for EEPREC in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_DISCARD_Pos            _UINT32_(7)                                          /* (SPW_LINK2_IM_C) Discard Position */
#define SPW_LINK2_IM_C_DISCARD_Msk            (_UINT32_(0x1) << SPW_LINK2_IM_C_DISCARD_Pos)        /* (SPW_LINK2_IM_C) Discard Mask */
#define SPW_LINK2_IM_C_DISCARD(value)         (SPW_LINK2_IM_C_DISCARD_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_ESCEVENT2_Pos          _UINT32_(8)                                          /* (SPW_LINK2_IM_C) Escape Event 2 Position */
#define SPW_LINK2_IM_C_ESCEVENT2_Msk          (_UINT32_(0x1) << SPW_LINK2_IM_C_ESCEVENT2_Pos)      /* (SPW_LINK2_IM_C) Escape Event 2 Mask */
#define SPW_LINK2_IM_C_ESCEVENT2(value)       (SPW_LINK2_IM_C_ESCEVENT2_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_ESCEVENT2_Pos)) /* Assigment of value for ESCEVENT2 in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_ESCEVENT1_Pos          _UINT32_(9)                                          /* (SPW_LINK2_IM_C) Escape Event 1 Position */
#define SPW_LINK2_IM_C_ESCEVENT1_Msk          (_UINT32_(0x1) << SPW_LINK2_IM_C_ESCEVENT1_Pos)      /* (SPW_LINK2_IM_C) Escape Event 1 Mask */
#define SPW_LINK2_IM_C_ESCEVENT1(value)       (SPW_LINK2_IM_C_ESCEVENT1_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_ESCEVENT1_Pos)) /* Assigment of value for ESCEVENT1 in the SPW_LINK2_IM_C register */
#define SPW_LINK2_IM_C_Msk                    _UINT32_(0x000003FF)                                 /* (SPW_LINK2_IM_C) Register Mask  */

#define SPW_LINK2_IM_C_ESCEVENT_Pos           _UINT32_(8)                                          /* (SPW_LINK2_IM_C Position) Escape Event x */
#define SPW_LINK2_IM_C_ESCEVENT_Msk           (_UINT32_(0x3) << SPW_LINK2_IM_C_ESCEVENT_Pos)       /* (SPW_LINK2_IM_C Mask) ESCEVENT */
#define SPW_LINK2_IM_C_ESCEVENT(value)        (SPW_LINK2_IM_C_ESCEVENT_Msk & (_UINT32_(value) << SPW_LINK2_IM_C_ESCEVENT_Pos)) 

/* -------- SPW_LINK2_CFG : (SPW Offset: 0x4A0) (R/W 32) SpW Link 2 Config -------- */
#define SPW_LINK2_CFG_COMMAND_Pos             _UINT32_(0)                                          /* (SPW_LINK2_CFG) Command Position */
#define SPW_LINK2_CFG_COMMAND_Msk             (_UINT32_(0x3) << SPW_LINK2_CFG_COMMAND_Pos)         /* (SPW_LINK2_CFG) Command Mask */
#define SPW_LINK2_CFG_COMMAND(value)          (SPW_LINK2_CFG_COMMAND_Msk & (_UINT32_(value) << SPW_LINK2_CFG_COMMAND_Pos)) /* Assigment of value for COMMAND in the SPW_LINK2_CFG register */
#define   SPW_LINK2_CFG_COMMAND_LINK_DISABLE_Val _UINT32_(0x0)                                        /* (SPW_LINK2_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state.  */
#define   SPW_LINK2_CFG_COMMAND_NO_COMMAND_Val _UINT32_(0x1)                                        /* (SPW_LINK2_CFG) State is not actively changed.  */
#define   SPW_LINK2_CFG_COMMAND_AUTO_START_Val _UINT32_(0x2)                                        /* (SPW_LINK2_CFG) The Codec will wait in state Ready until the first NULL character is received.  */
#define   SPW_LINK2_CFG_COMMAND_LINK_START_Val _UINT32_(0x3)                                        /* (SPW_LINK2_CFG) SpaceWire link can proceed to Started state.  */
#define SPW_LINK2_CFG_COMMAND_LINK_DISABLE    (SPW_LINK2_CFG_COMMAND_LINK_DISABLE_Val << SPW_LINK2_CFG_COMMAND_Pos) /* (SPW_LINK2_CFG) The link proceeds directly to the ErrorReset state when reaching the Run state. Position  */
#define SPW_LINK2_CFG_COMMAND_NO_COMMAND      (SPW_LINK2_CFG_COMMAND_NO_COMMAND_Val << SPW_LINK2_CFG_COMMAND_Pos) /* (SPW_LINK2_CFG) State is not actively changed. Position  */
#define SPW_LINK2_CFG_COMMAND_AUTO_START      (SPW_LINK2_CFG_COMMAND_AUTO_START_Val << SPW_LINK2_CFG_COMMAND_Pos) /* (SPW_LINK2_CFG) The Codec will wait in state Ready until the first NULL character is received. Position  */
#define SPW_LINK2_CFG_COMMAND_LINK_START      (SPW_LINK2_CFG_COMMAND_LINK_START_Val << SPW_LINK2_CFG_COMMAND_Pos) /* (SPW_LINK2_CFG) SpaceWire link can proceed to Started state. Position  */
#define SPW_LINK2_CFG_Msk                     _UINT32_(0x00000003)                                 /* (SPW_LINK2_CFG) Register Mask  */


/* -------- SPW_LINK2_CLKDIV : (SPW Offset: 0x4A4) (R/W 32) SpW Link 2 Clock Division -------- */
#define SPW_LINK2_CLKDIV_TXOPERDIV_Pos        _UINT32_(0)                                          /* (SPW_LINK2_CLKDIV) TxOperDiv Position */
#define SPW_LINK2_CLKDIV_TXOPERDIV_Msk        (_UINT32_(0x1F) << SPW_LINK2_CLKDIV_TXOPERDIV_Pos)   /* (SPW_LINK2_CLKDIV) TxOperDiv Mask */
#define SPW_LINK2_CLKDIV_TXOPERDIV(value)     (SPW_LINK2_CLKDIV_TXOPERDIV_Msk & (_UINT32_(value) << SPW_LINK2_CLKDIV_TXOPERDIV_Pos)) /* Assigment of value for TXOPERDIV in the SPW_LINK2_CLKDIV register */
#define SPW_LINK2_CLKDIV_TXINITDIV_Pos        _UINT32_(16)                                         /* (SPW_LINK2_CLKDIV) TxInitDiv Position */
#define SPW_LINK2_CLKDIV_TXINITDIV_Msk        (_UINT32_(0x1F) << SPW_LINK2_CLKDIV_TXINITDIV_Pos)   /* (SPW_LINK2_CLKDIV) TxInitDiv Mask */
#define SPW_LINK2_CLKDIV_TXINITDIV(value)     (SPW_LINK2_CLKDIV_TXINITDIV_Msk & (_UINT32_(value) << SPW_LINK2_CLKDIV_TXINITDIV_Pos)) /* Assigment of value for TXINITDIV in the SPW_LINK2_CLKDIV register */
#define SPW_LINK2_CLKDIV_Msk                  _UINT32_(0x001F001F)                                 /* (SPW_LINK2_CLKDIV) Register Mask  */


/* -------- SPW_LINK2_STATUS : (SPW Offset: 0x4A8) ( R/ 32) SpW Link 2 Status -------- */
#define SPW_LINK2_STATUS_LINKSTATE_Pos        _UINT32_(0)                                          /* (SPW_LINK2_STATUS) LinkState Position */
#define SPW_LINK2_STATUS_LINKSTATE_Msk        (_UINT32_(0x7) << SPW_LINK2_STATUS_LINKSTATE_Pos)    /* (SPW_LINK2_STATUS) LinkState Mask */
#define SPW_LINK2_STATUS_LINKSTATE(value)     (SPW_LINK2_STATUS_LINKSTATE_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_LINKSTATE_Pos)) /* Assigment of value for LINKSTATE in the SPW_LINK2_STATUS register */
#define   SPW_LINK2_STATUS_LINKSTATE_ERRORRESET_Val _UINT32_(0x0)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in ErrorReset state  */
#define   SPW_LINK2_STATUS_LINKSTATE_ERRORWAIT_Val _UINT32_(0x1)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in ErrorWait state  */
#define   SPW_LINK2_STATUS_LINKSTATE_READY_Val _UINT32_(0x2)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in Ready state  */
#define   SPW_LINK2_STATUS_LINKSTATE_STARTED_Val _UINT32_(0x3)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in Started state  */
#define   SPW_LINK2_STATUS_LINKSTATE_CONNECTING_Val _UINT32_(0x4)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in Connecting state  */
#define   SPW_LINK2_STATUS_LINKSTATE_RUN_Val  _UINT32_(0x5)                                        /* (SPW_LINK2_STATUS) CODEC link state machine in Run state  */
#define SPW_LINK2_STATUS_LINKSTATE_ERRORRESET (SPW_LINK2_STATUS_LINKSTATE_ERRORRESET_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in ErrorReset state Position  */
#define SPW_LINK2_STATUS_LINKSTATE_ERRORWAIT  (SPW_LINK2_STATUS_LINKSTATE_ERRORWAIT_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in ErrorWait state Position  */
#define SPW_LINK2_STATUS_LINKSTATE_READY      (SPW_LINK2_STATUS_LINKSTATE_READY_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in Ready state Position  */
#define SPW_LINK2_STATUS_LINKSTATE_STARTED    (SPW_LINK2_STATUS_LINKSTATE_STARTED_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in Started state Position  */
#define SPW_LINK2_STATUS_LINKSTATE_CONNECTING (SPW_LINK2_STATUS_LINKSTATE_CONNECTING_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in Connecting state Position  */
#define SPW_LINK2_STATUS_LINKSTATE_RUN        (SPW_LINK2_STATUS_LINKSTATE_RUN_Val << SPW_LINK2_STATUS_LINKSTATE_Pos) /* (SPW_LINK2_STATUS) CODEC link state machine in Run state Position  */
#define SPW_LINK2_STATUS_TXDEFDIV_Pos         _UINT32_(4)                                          /* (SPW_LINK2_STATUS) TxDefDiv Position */
#define SPW_LINK2_STATUS_TXDEFDIV_Msk         (_UINT32_(0x1F) << SPW_LINK2_STATUS_TXDEFDIV_Pos)    /* (SPW_LINK2_STATUS) TxDefDiv Mask */
#define SPW_LINK2_STATUS_TXDEFDIV(value)      (SPW_LINK2_STATUS_TXDEFDIV_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_TXDEFDIV_Pos)) /* Assigment of value for TXDEFDIV in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_TXEMPTY_Pos          _UINT32_(16)                                         /* (SPW_LINK2_STATUS) TxEmpty Position */
#define SPW_LINK2_STATUS_TXEMPTY_Msk          (_UINT32_(0x1) << SPW_LINK2_STATUS_TXEMPTY_Pos)      /* (SPW_LINK2_STATUS) TxEmpty Mask */
#define SPW_LINK2_STATUS_TXEMPTY(value)       (SPW_LINK2_STATUS_TXEMPTY_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_TXEMPTY_Pos)) /* Assigment of value for TXEMPTY in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_GOTNULL_Pos          _UINT32_(17)                                         /* (SPW_LINK2_STATUS) GotNull Position */
#define SPW_LINK2_STATUS_GOTNULL_Msk          (_UINT32_(0x1) << SPW_LINK2_STATUS_GOTNULL_Pos)      /* (SPW_LINK2_STATUS) GotNull Mask */
#define SPW_LINK2_STATUS_GOTNULL(value)       (SPW_LINK2_STATUS_GOTNULL_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_GOTNULL_Pos)) /* Assigment of value for GOTNULL in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_GOTFCT_Pos           _UINT32_(18)                                         /* (SPW_LINK2_STATUS) GotFCT Position */
#define SPW_LINK2_STATUS_GOTFCT_Msk           (_UINT32_(0x1) << SPW_LINK2_STATUS_GOTFCT_Pos)       /* (SPW_LINK2_STATUS) GotFCT Mask */
#define SPW_LINK2_STATUS_GOTFCT(value)        (SPW_LINK2_STATUS_GOTFCT_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_GOTFCT_Pos)) /* Assigment of value for GOTFCT in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_GOTNCHAR_Pos         _UINT32_(19)                                         /* (SPW_LINK2_STATUS) GotNChar Position */
#define SPW_LINK2_STATUS_GOTNCHAR_Msk         (_UINT32_(0x1) << SPW_LINK2_STATUS_GOTNCHAR_Pos)     /* (SPW_LINK2_STATUS) GotNChar Mask */
#define SPW_LINK2_STATUS_GOTNCHAR(value)      (SPW_LINK2_STATUS_GOTNCHAR_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_GOTNCHAR_Pos)) /* Assigment of value for GOTNCHAR in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN0_Pos            _UINT32_(20)                                         /* (SPW_LINK2_STATUS) SEEN0 Position */
#define SPW_LINK2_STATUS_SEEN0_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN0_Pos)        /* (SPW_LINK2_STATUS) SEEN0 Mask */
#define SPW_LINK2_STATUS_SEEN0(value)         (SPW_LINK2_STATUS_SEEN0_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN0_Pos)) /* Assigment of value for SEEN0 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN1_Pos            _UINT32_(21)                                         /* (SPW_LINK2_STATUS) SEEN1 Position */
#define SPW_LINK2_STATUS_SEEN1_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN1_Pos)        /* (SPW_LINK2_STATUS) SEEN1 Mask */
#define SPW_LINK2_STATUS_SEEN1(value)         (SPW_LINK2_STATUS_SEEN1_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN1_Pos)) /* Assigment of value for SEEN1 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN2_Pos            _UINT32_(22)                                         /* (SPW_LINK2_STATUS) SEEN2 Position */
#define SPW_LINK2_STATUS_SEEN2_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN2_Pos)        /* (SPW_LINK2_STATUS) SEEN2 Mask */
#define SPW_LINK2_STATUS_SEEN2(value)         (SPW_LINK2_STATUS_SEEN2_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN2_Pos)) /* Assigment of value for SEEN2 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN3_Pos            _UINT32_(23)                                         /* (SPW_LINK2_STATUS) SEEN3 Position */
#define SPW_LINK2_STATUS_SEEN3_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN3_Pos)        /* (SPW_LINK2_STATUS) SEEN3 Mask */
#define SPW_LINK2_STATUS_SEEN3(value)         (SPW_LINK2_STATUS_SEEN3_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN3_Pos)) /* Assigment of value for SEEN3 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN4_Pos            _UINT32_(24)                                         /* (SPW_LINK2_STATUS) SEEN4 Position */
#define SPW_LINK2_STATUS_SEEN4_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN4_Pos)        /* (SPW_LINK2_STATUS) SEEN4 Mask */
#define SPW_LINK2_STATUS_SEEN4(value)         (SPW_LINK2_STATUS_SEEN4_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN4_Pos)) /* Assigment of value for SEEN4 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_SEEN5_Pos            _UINT32_(25)                                         /* (SPW_LINK2_STATUS) SEEN5 Position */
#define SPW_LINK2_STATUS_SEEN5_Msk            (_UINT32_(0x1) << SPW_LINK2_STATUS_SEEN5_Pos)        /* (SPW_LINK2_STATUS) SEEN5 Mask */
#define SPW_LINK2_STATUS_SEEN5(value)         (SPW_LINK2_STATUS_SEEN5_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN5_Pos)) /* Assigment of value for SEEN5 in the SPW_LINK2_STATUS register */
#define SPW_LINK2_STATUS_Msk                  _UINT32_(0x03FF01F7)                                 /* (SPW_LINK2_STATUS) Register Mask  */

#define SPW_LINK2_STATUS_SEEN_Pos             _UINT32_(20)                                         /* (SPW_LINK2_STATUS Position) SEEN5 */
#define SPW_LINK2_STATUS_SEEN_Msk             (_UINT32_(0x3F) << SPW_LINK2_STATUS_SEEN_Pos)        /* (SPW_LINK2_STATUS Mask) SEEN */
#define SPW_LINK2_STATUS_SEEN(value)          (SPW_LINK2_STATUS_SEEN_Msk & (_UINT32_(value) << SPW_LINK2_STATUS_SEEN_Pos)) 

/* -------- SPW_LINK2_SWRESET : (SPW Offset: 0x4AC) (R/W 32) SpW Link 2 Software Reset -------- */
#define SPW_LINK2_SWRESET_PATTERN_Pos         _UINT32_(0)                                          /* (SPW_LINK2_SWRESET) Pattern Position */
#define SPW_LINK2_SWRESET_PATTERN_Msk         (_UINT32_(0xFFFFFFFF) << SPW_LINK2_SWRESET_PATTERN_Pos) /* (SPW_LINK2_SWRESET) Pattern Mask */
#define SPW_LINK2_SWRESET_PATTERN(value)      (SPW_LINK2_SWRESET_PATTERN_Msk & (_UINT32_(value) << SPW_LINK2_SWRESET_PATTERN_Pos)) /* Assigment of value for PATTERN in the SPW_LINK2_SWRESET register */
#define SPW_LINK2_SWRESET_Msk                 _UINT32_(0xFFFFFFFF)                                 /* (SPW_LINK2_SWRESET) Register Mask  */


/* -------- SPW_LINK2_ESCCHAREVENT : (SPW Offset: 0x4B0) (R/W 32) SpW Link 2 Escape Character Event -------- */
#define SPW_LINK2_ESCCHAREVENT_VALUE_Pos      _UINT32_(0)                                          /* (SPW_LINK2_ESCCHAREVENT) Value Position */
#define SPW_LINK2_ESCCHAREVENT_VALUE_Msk      (_UINT32_(0xFF) << SPW_LINK2_ESCCHAREVENT_VALUE_Pos) /* (SPW_LINK2_ESCCHAREVENT) Value Mask */
#define SPW_LINK2_ESCCHAREVENT_VALUE(value)   (SPW_LINK2_ESCCHAREVENT_VALUE_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHAREVENT_VALUE_Pos)) /* Assigment of value for VALUE in the SPW_LINK2_ESCCHAREVENT register */
#define SPW_LINK2_ESCCHAREVENT_MASK_Pos       _UINT32_(8)                                          /* (SPW_LINK2_ESCCHAREVENT) Mask Position */
#define SPW_LINK2_ESCCHAREVENT_MASK_Msk       (_UINT32_(0xFF) << SPW_LINK2_ESCCHAREVENT_MASK_Pos)  /* (SPW_LINK2_ESCCHAREVENT) Mask Mask */
#define SPW_LINK2_ESCCHAREVENT_MASK(value)    (SPW_LINK2_ESCCHAREVENT_MASK_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHAREVENT_MASK_Pos)) /* Assigment of value for MASK in the SPW_LINK2_ESCCHAREVENT register */
#define SPW_LINK2_ESCCHAREVENT_ACTIVE_Pos     _UINT32_(16)                                         /* (SPW_LINK2_ESCCHAREVENT) Active Position */
#define SPW_LINK2_ESCCHAREVENT_ACTIVE_Msk     (_UINT32_(0x1) << SPW_LINK2_ESCCHAREVENT_ACTIVE_Pos) /* (SPW_LINK2_ESCCHAREVENT) Active Mask */
#define SPW_LINK2_ESCCHAREVENT_ACTIVE(value)  (SPW_LINK2_ESCCHAREVENT_ACTIVE_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHAREVENT_ACTIVE_Pos)) /* Assigment of value for ACTIVE in the SPW_LINK2_ESCCHAREVENT register */
#define SPW_LINK2_ESCCHAREVENT_HWEVENT_Pos    _UINT32_(17)                                         /* (SPW_LINK2_ESCCHAREVENT) HwEvent Position */
#define SPW_LINK2_ESCCHAREVENT_HWEVENT_Msk    (_UINT32_(0x1) << SPW_LINK2_ESCCHAREVENT_HWEVENT_Pos) /* (SPW_LINK2_ESCCHAREVENT) HwEvent Mask */
#define SPW_LINK2_ESCCHAREVENT_HWEVENT(value) (SPW_LINK2_ESCCHAREVENT_HWEVENT_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHAREVENT_HWEVENT_Pos)) /* Assigment of value for HWEVENT in the SPW_LINK2_ESCCHAREVENT register */
#define SPW_LINK2_ESCCHAREVENT_Msk            _UINT32_(0x0003FFFF)                                 /* (SPW_LINK2_ESCCHAREVENT) Register Mask  */


/* -------- SPW_LINK2_ESCCHARSTS : (SPW Offset: 0x4B8) ( R/ 32) SpW Link 2 Escape Character Status -------- */
#define SPW_LINK2_ESCCHARSTS_CHAR1_Pos        _UINT32_(0)                                          /* (SPW_LINK2_ESCCHARSTS) Esc Char 1 Position */
#define SPW_LINK2_ESCCHARSTS_CHAR1_Msk        (_UINT32_(0xFF) << SPW_LINK2_ESCCHARSTS_CHAR1_Pos)   /* (SPW_LINK2_ESCCHARSTS) Esc Char 1 Mask */
#define SPW_LINK2_ESCCHARSTS_CHAR1(value)     (SPW_LINK2_ESCCHARSTS_CHAR1_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHARSTS_CHAR1_Pos)) /* Assigment of value for CHAR1 in the SPW_LINK2_ESCCHARSTS register */
#define SPW_LINK2_ESCCHARSTS_CHAR2_Pos        _UINT32_(8)                                          /* (SPW_LINK2_ESCCHARSTS) Esc Char 2 Position */
#define SPW_LINK2_ESCCHARSTS_CHAR2_Msk        (_UINT32_(0xFF) << SPW_LINK2_ESCCHARSTS_CHAR2_Pos)   /* (SPW_LINK2_ESCCHARSTS) Esc Char 2 Mask */
#define SPW_LINK2_ESCCHARSTS_CHAR2(value)     (SPW_LINK2_ESCCHARSTS_CHAR2_Msk & (_UINT32_(value) << SPW_LINK2_ESCCHARSTS_CHAR2_Pos)) /* Assigment of value for CHAR2 in the SPW_LINK2_ESCCHARSTS register */
#define SPW_LINK2_ESCCHARSTS_Msk              _UINT32_(0x0000FFFF)                                 /* (SPW_LINK2_ESCCHARSTS) Register Mask  */


