Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK2_DISTACKPI_RM_DA_Pos         _UINT32_(0)                                          /* (SPW_LINK2_DISTACKPI_RM Position) Distributed Acknowledge */
#define SPW_LINK2_DISTACKPI_RM_DA_Msk         (_UINT32_(0xFFFFFFFF) << SPW_LINK2_DISTACKPI_RM_DA_Pos) /* (SPW_LINK2_DISTACKPI_RM Mask) DA */
#define SPW_LINK2_DISTACKPI_RM_DA(value)      (SPW_LINK2_DISTACKPI_RM_DA_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RM_DA_Pos)) 

/* -------- SPW_LINK2_DISTACKPI_RCM : (SPW Offset: 0x4E4) ( R/ 32) SpW Link 2 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt -------- */
#define SPW_LINK2_DISTACKPI_RCM_DA0_Pos       _UINT32_(0)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA0_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA0_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA0(value)    (SPW_LINK2_DISTACKPI_RCM_DA0_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA0_Pos)) /* Assigment of value for DA0 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA1_Pos       _UINT32_(1)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA1_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA1_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA1(value)    (SPW_LINK2_DISTACKPI_RCM_DA1_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA1_Pos)) /* Assigment of value for DA1 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA2_Pos       _UINT32_(2)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA2_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA2_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA2(value)    (SPW_LINK2_DISTACKPI_RCM_DA2_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA2_Pos)) /* Assigment of value for DA2 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA3_Pos       _UINT32_(3)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA3_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA3_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA3(value)    (SPW_LINK2_DISTACKPI_RCM_DA3_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA3_Pos)) /* Assigment of value for DA3 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA4_Pos       _UINT32_(4)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA4_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA4_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA4(value)    (SPW_LINK2_DISTACKPI_RCM_DA4_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA4_Pos)) /* Assigment of value for DA4 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA5_Pos       _UINT32_(5)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA5_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA5_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA5(value)    (SPW_LINK2_DISTACKPI_RCM_DA5_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA5_Pos)) /* Assigment of value for DA5 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA6_Pos       _UINT32_(6)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA6_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA6_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA6(value)    (SPW_LINK2_DISTACKPI_RCM_DA6_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA6_Pos)) /* Assigment of value for DA6 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA7_Pos       _UINT32_(7)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA7_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA7_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA7(value)    (SPW_LINK2_DISTACKPI_RCM_DA7_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA7_Pos)) /* Assigment of value for DA7 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA8_Pos       _UINT32_(8)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA8_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA8_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA8(value)    (SPW_LINK2_DISTACKPI_RCM_DA8_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA8_Pos)) /* Assigment of value for DA8 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA9_Pos       _UINT32_(9)                                          /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA9_Msk       (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA9_Pos)   /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA9(value)    (SPW_LINK2_DISTACKPI_RCM_DA9_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA9_Pos)) /* Assigment of value for DA9 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA10_Pos      _UINT32_(10)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA10_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA10_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA10(value)   (SPW_LINK2_DISTACKPI_RCM_DA10_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA10_Pos)) /* Assigment of value for DA10 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA11_Pos      _UINT32_(11)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA11_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA11_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA11(value)   (SPW_LINK2_DISTACKPI_RCM_DA11_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA11_Pos)) /* Assigment of value for DA11 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA12_Pos      _UINT32_(12)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA12_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA12_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA12(value)   (SPW_LINK2_DISTACKPI_RCM_DA12_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA12_Pos)) /* Assigment of value for DA12 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA13_Pos      _UINT32_(13)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA13_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA13_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA13(value)   (SPW_LINK2_DISTACKPI_RCM_DA13_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA13_Pos)) /* Assigment of value for DA13 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA14_Pos      _UINT32_(14)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA14_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA14_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA14(value)   (SPW_LINK2_DISTACKPI_RCM_DA14_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA14_Pos)) /* Assigment of value for DA14 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA15_Pos      _UINT32_(15)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA15_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA15_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA15(value)   (SPW_LINK2_DISTACKPI_RCM_DA15_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA15_Pos)) /* Assigment of value for DA15 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA16_Pos      _UINT32_(16)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA16_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA16_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA16(value)   (SPW_LINK2_DISTACKPI_RCM_DA16_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA16_Pos)) /* Assigment of value for DA16 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA17_Pos      _UINT32_(17)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA17_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA17_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA17(value)   (SPW_LINK2_DISTACKPI_RCM_DA17_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA17_Pos)) /* Assigment of value for DA17 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA18_Pos      _UINT32_(18)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA18_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA18_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA18(value)   (SPW_LINK2_DISTACKPI_RCM_DA18_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA18_Pos)) /* Assigment of value for DA18 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA19_Pos      _UINT32_(19)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA19_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA19_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA19(value)   (SPW_LINK2_DISTACKPI_RCM_DA19_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA19_Pos)) /* Assigment of value for DA19 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA20_Pos      _UINT32_(20)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA20_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA20_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA20(value)   (SPW_LINK2_DISTACKPI_RCM_DA20_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA20_Pos)) /* Assigment of value for DA20 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA21_Pos      _UINT32_(21)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA21_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA21_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA21(value)   (SPW_LINK2_DISTACKPI_RCM_DA21_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA21_Pos)) /* Assigment of value for DA21 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA22_Pos      _UINT32_(22)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA22_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA22_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA22(value)   (SPW_LINK2_DISTACKPI_RCM_DA22_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA22_Pos)) /* Assigment of value for DA22 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA23_Pos      _UINT32_(23)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA23_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA23_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA23(value)   (SPW_LINK2_DISTACKPI_RCM_DA23_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA23_Pos)) /* Assigment of value for DA23 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA24_Pos      _UINT32_(24)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA24_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA24_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA24(value)   (SPW_LINK2_DISTACKPI_RCM_DA24_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA24_Pos)) /* Assigment of value for DA24 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA25_Pos      _UINT32_(25)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA25_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA25_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA25(value)   (SPW_LINK2_DISTACKPI_RCM_DA25_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA25_Pos)) /* Assigment of value for DA25 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA26_Pos      _UINT32_(26)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA26_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA26_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA26(value)   (SPW_LINK2_DISTACKPI_RCM_DA26_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA26_Pos)) /* Assigment of value for DA26 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA27_Pos      _UINT32_(27)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA27_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA27_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA27(value)   (SPW_LINK2_DISTACKPI_RCM_DA27_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA27_Pos)) /* Assigment of value for DA27 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA28_Pos      _UINT32_(28)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA28_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA28_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA28(value)   (SPW_LINK2_DISTACKPI_RCM_DA28_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA28_Pos)) /* Assigment of value for DA28 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA29_Pos      _UINT32_(29)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA29_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA29_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA29(value)   (SPW_LINK2_DISTACKPI_RCM_DA29_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA29_Pos)) /* Assigment of value for DA29 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA30_Pos      _UINT32_(30)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA30_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA30_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA30(value)   (SPW_LINK2_DISTACKPI_RCM_DA30_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA30_Pos)) /* Assigment of value for DA30 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_DA31_Pos      _UINT32_(31)                                         /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Position */
#define SPW_LINK2_DISTACKPI_RCM_DA31_Msk      (_UINT32_(0x1) << SPW_LINK2_DISTACKPI_RCM_DA31_Pos)  /* (SPW_LINK2_DISTACKPI_RCM) Distributed Acknowledge Mask */
#define SPW_LINK2_DISTACKPI_RCM_DA31(value)   (SPW_LINK2_DISTACKPI_RCM_DA31_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKPI_RCM_DA31_Pos)) /* Assigment of value for DA31 in the SPW_LINK2_DISTACKPI_RCM register */
#define SPW_LINK2_DISTACKPI_RCM_Msk           _UINT32_(0xFFFFFFFF)                                 /* (SPW_LINK2_DISTACKPI_RCM) Register Mask  */

