Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_LINK2_DISTACKIM_C_DA_Pos          _UINT32_(0)                                          /* (SPW_LINK2_DISTACKIM_C Position) Distributed Acknowledge mask */
#define SPW_LINK2_DISTACKIM_C_DA_Msk          (_UINT32_(0xFFFFFFFF) << SPW_LINK2_DISTACKIM_C_DA_Pos) /* (SPW_LINK2_DISTACKIM_C Mask) DA */
#define SPW_LINK2_DISTACKIM_C_DA(value)       (SPW_LINK2_DISTACKIM_C_DA_Msk & (_UINT32_(value) << SPW_LINK2_DISTACKIM_C_DA_Pos)) 

/* -------- SPW_PKTRX1_PI_RM : (SPW Offset: 0x800) ( R/ 32) PktRx Pending Read Masked Interrupt -------- */
#define SPW_PKTRX1_PI_RM_DEACT_Pos            _UINT32_(0)                                          /* (SPW_PKTRX1_PI_RM) Deactivated Position */
#define SPW_PKTRX1_PI_RM_DEACT_Msk            (_UINT32_(0x1) << SPW_PKTRX1_PI_RM_DEACT_Pos)        /* (SPW_PKTRX1_PI_RM) Deactivated Mask */
#define SPW_PKTRX1_PI_RM_DEACT(value)         (SPW_PKTRX1_PI_RM_DEACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RM_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTRX1_PI_RM register */
#define SPW_PKTRX1_PI_RM_EOP_Pos              _UINT32_(1)                                          /* (SPW_PKTRX1_PI_RM) EOP seen Position */
#define SPW_PKTRX1_PI_RM_EOP_Msk              (_UINT32_(0x1) << SPW_PKTRX1_PI_RM_EOP_Pos)          /* (SPW_PKTRX1_PI_RM) EOP seen Mask */
#define SPW_PKTRX1_PI_RM_EOP(value)           (SPW_PKTRX1_PI_RM_EOP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RM_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTRX1_PI_RM register */
#define SPW_PKTRX1_PI_RM_EEP_Pos              _UINT32_(2)                                          /* (SPW_PKTRX1_PI_RM) EEP seen Position */
#define SPW_PKTRX1_PI_RM_EEP_Msk              (_UINT32_(0x1) << SPW_PKTRX1_PI_RM_EEP_Pos)          /* (SPW_PKTRX1_PI_RM) EEP seen Mask */
#define SPW_PKTRX1_PI_RM_EEP(value)           (SPW_PKTRX1_PI_RM_EEP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RM_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTRX1_PI_RM register */
#define SPW_PKTRX1_PI_RM_DISCARD_Pos          _UINT32_(3)                                          /* (SPW_PKTRX1_PI_RM) Packet Discard Position */
#define SPW_PKTRX1_PI_RM_DISCARD_Msk          (_UINT32_(0x1) << SPW_PKTRX1_PI_RM_DISCARD_Pos)      /* (SPW_PKTRX1_PI_RM) Packet Discard Mask */
#define SPW_PKTRX1_PI_RM_DISCARD(value)       (SPW_PKTRX1_PI_RM_DISCARD_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RM_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_PKTRX1_PI_RM register */
#define SPW_PKTRX1_PI_RM_ACT_Pos              _UINT32_(4)                                          /* (SPW_PKTRX1_PI_RM) Activated Position */
#define SPW_PKTRX1_PI_RM_ACT_Msk              (_UINT32_(0x1) << SPW_PKTRX1_PI_RM_ACT_Pos)          /* (SPW_PKTRX1_PI_RM) Activated Mask */
#define SPW_PKTRX1_PI_RM_ACT(value)           (SPW_PKTRX1_PI_RM_ACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RM_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTRX1_PI_RM register */
#define SPW_PKTRX1_PI_RM_Msk                  _UINT32_(0x0000001F)                                 /* (SPW_PKTRX1_PI_RM) Register Mask  */


/* -------- SPW_PKTRX1_PI_R : (SPW Offset: 0x808) ( R/ 32) PktRx Pending Read Interrupt -------- */
#define SPW_PKTRX1_PI_R_DEACT_Pos             _UINT32_(0)                                          /* (SPW_PKTRX1_PI_R) Deactivated Position */
#define SPW_PKTRX1_PI_R_DEACT_Msk             (_UINT32_(0x1) << SPW_PKTRX1_PI_R_DEACT_Pos)         /* (SPW_PKTRX1_PI_R) Deactivated Mask */
#define SPW_PKTRX1_PI_R_DEACT(value)          (SPW_PKTRX1_PI_R_DEACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_R_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTRX1_PI_R register */
#define SPW_PKTRX1_PI_R_EOP_Pos               _UINT32_(1)                                          /* (SPW_PKTRX1_PI_R) EOP seen Position */
#define SPW_PKTRX1_PI_R_EOP_Msk               (_UINT32_(0x1) << SPW_PKTRX1_PI_R_EOP_Pos)           /* (SPW_PKTRX1_PI_R) EOP seen Mask */
#define SPW_PKTRX1_PI_R_EOP(value)            (SPW_PKTRX1_PI_R_EOP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_R_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTRX1_PI_R register */
#define SPW_PKTRX1_PI_R_EEP_Pos               _UINT32_(2)                                          /* (SPW_PKTRX1_PI_R) EEP seen Position */
#define SPW_PKTRX1_PI_R_EEP_Msk               (_UINT32_(0x1) << SPW_PKTRX1_PI_R_EEP_Pos)           /* (SPW_PKTRX1_PI_R) EEP seen Mask */
#define SPW_PKTRX1_PI_R_EEP(value)            (SPW_PKTRX1_PI_R_EEP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_R_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTRX1_PI_R register */
#define SPW_PKTRX1_PI_R_DISCARD_Pos           _UINT32_(3)                                          /* (SPW_PKTRX1_PI_R) Packet Discard Position */
#define SPW_PKTRX1_PI_R_DISCARD_Msk           (_UINT32_(0x1) << SPW_PKTRX1_PI_R_DISCARD_Pos)       /* (SPW_PKTRX1_PI_R) Packet Discard Mask */
#define SPW_PKTRX1_PI_R_DISCARD(value)        (SPW_PKTRX1_PI_R_DISCARD_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_R_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_PKTRX1_PI_R register */
#define SPW_PKTRX1_PI_R_ACT_Pos               _UINT32_(4)                                          /* (SPW_PKTRX1_PI_R) Activated Position */
#define SPW_PKTRX1_PI_R_ACT_Msk               (_UINT32_(0x1) << SPW_PKTRX1_PI_R_ACT_Pos)           /* (SPW_PKTRX1_PI_R) Activated Mask */
#define SPW_PKTRX1_PI_R_ACT(value)            (SPW_PKTRX1_PI_R_ACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_R_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTRX1_PI_R register */
#define SPW_PKTRX1_PI_R_Msk                   _UINT32_(0x0000001F)                                 /* (SPW_PKTRX1_PI_R) Register Mask  */


/* -------- SPW_PKTRX1_PI_RCS : (SPW Offset: 0x80C) (R/W 32) PktRx Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_PKTRX1_PI_RCS_DEACT_Pos           _UINT32_(0)                                          /* (SPW_PKTRX1_PI_RCS) Deactivated Position */
#define SPW_PKTRX1_PI_RCS_DEACT_Msk           (_UINT32_(0x1) << SPW_PKTRX1_PI_RCS_DEACT_Pos)       /* (SPW_PKTRX1_PI_RCS) Deactivated Mask */
#define SPW_PKTRX1_PI_RCS_DEACT(value)        (SPW_PKTRX1_PI_RCS_DEACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RCS_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTRX1_PI_RCS register */
#define SPW_PKTRX1_PI_RCS_EOP_Pos             _UINT32_(1)                                          /* (SPW_PKTRX1_PI_RCS) EOP seen Position */
#define SPW_PKTRX1_PI_RCS_EOP_Msk             (_UINT32_(0x1) << SPW_PKTRX1_PI_RCS_EOP_Pos)         /* (SPW_PKTRX1_PI_RCS) EOP seen Mask */
#define SPW_PKTRX1_PI_RCS_EOP(value)          (SPW_PKTRX1_PI_RCS_EOP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RCS_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTRX1_PI_RCS register */
#define SPW_PKTRX1_PI_RCS_EEP_Pos             _UINT32_(2)                                          /* (SPW_PKTRX1_PI_RCS) EEP seen Position */
#define SPW_PKTRX1_PI_RCS_EEP_Msk             (_UINT32_(0x1) << SPW_PKTRX1_PI_RCS_EEP_Pos)         /* (SPW_PKTRX1_PI_RCS) EEP seen Mask */
#define SPW_PKTRX1_PI_RCS_EEP(value)          (SPW_PKTRX1_PI_RCS_EEP_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RCS_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTRX1_PI_RCS register */
#define SPW_PKTRX1_PI_RCS_DISCARD_Pos         _UINT32_(3)                                          /* (SPW_PKTRX1_PI_RCS) Packet Discard Position */
#define SPW_PKTRX1_PI_RCS_DISCARD_Msk         (_UINT32_(0x1) << SPW_PKTRX1_PI_RCS_DISCARD_Pos)     /* (SPW_PKTRX1_PI_RCS) Packet Discard Mask */
#define SPW_PKTRX1_PI_RCS_DISCARD(value)      (SPW_PKTRX1_PI_RCS_DISCARD_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RCS_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_PKTRX1_PI_RCS register */
#define SPW_PKTRX1_PI_RCS_ACT_Pos             _UINT32_(4)                                          /* (SPW_PKTRX1_PI_RCS) Activated Position */
#define SPW_PKTRX1_PI_RCS_ACT_Msk             (_UINT32_(0x1) << SPW_PKTRX1_PI_RCS_ACT_Pos)         /* (SPW_PKTRX1_PI_RCS) Activated Mask */
#define SPW_PKTRX1_PI_RCS_ACT(value)          (SPW_PKTRX1_PI_RCS_ACT_Msk & (_UINT32_(value) << SPW_PKTRX1_PI_RCS_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTRX1_PI_RCS register */
#define SPW_PKTRX1_PI_RCS_Msk                 _UINT32_(0x0000001F)                                 /* (SPW_PKTRX1_PI_RCS) Register Mask  */


/* -------- SPW_PKTRX1_IM : (SPW Offset: 0x810) (R/W 32) PktRx Interrupt Mask -------- */
#define SPW_PKTRX1_IM_DEACT_Pos               _UINT32_(0)                                          /* (SPW_PKTRX1_IM) Deactivated Position */
#define SPW_PKTRX1_IM_DEACT_Msk               (_UINT32_(0x1) << SPW_PKTRX1_IM_DEACT_Pos)           /* (SPW_PKTRX1_IM) Deactivated Mask */
#define SPW_PKTRX1_IM_DEACT(value)            (SPW_PKTRX1_IM_DEACT_Msk & (_UINT32_(value) << SPW_PKTRX1_IM_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTRX1_IM register */
#define SPW_PKTRX1_IM_EOP_Pos                 _UINT32_(1)                                          /* (SPW_PKTRX1_IM) EOP seen Position */
#define SPW_PKTRX1_IM_EOP_Msk                 (_UINT32_(0x1) << SPW_PKTRX1_IM_EOP_Pos)             /* (SPW_PKTRX1_IM) EOP seen Mask */
#define SPW_PKTRX1_IM_EOP(value)              (SPW_PKTRX1_IM_EOP_Msk & (_UINT32_(value) << SPW_PKTRX1_IM_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTRX1_IM register */
#define SPW_PKTRX1_IM_EEP_Pos                 _UINT32_(2)                                          /* (SPW_PKTRX1_IM) EEP seen Position */
#define SPW_PKTRX1_IM_EEP_Msk                 (_UINT32_(0x1) << SPW_PKTRX1_IM_EEP_Pos)             /* (SPW_PKTRX1_IM) EEP seen Mask */
#define SPW_PKTRX1_IM_EEP(value)              (SPW_PKTRX1_IM_EEP_Msk & (_UINT32_(value) << SPW_PKTRX1_IM_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTRX1_IM register */
#define SPW_PKTRX1_IM_DISCARD_Pos             _UINT32_(3)                                          /* (SPW_PKTRX1_IM) Packet Discard Position */
#define SPW_PKTRX1_IM_DISCARD_Msk             (_UINT32_(0x1) << SPW_PKTRX1_IM_DISCARD_Pos)         /* (SPW_PKTRX1_IM) Packet Discard Mask */
#define SPW_PKTRX1_IM_DISCARD(value)          (SPW_PKTRX1_IM_DISCARD_Msk & (_UINT32_(value) << SPW_PKTRX1_IM_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_PKTRX1_IM register */
#define SPW_PKTRX1_IM_ACT_Pos                 _UINT32_(4)                                          /* (SPW_PKTRX1_IM) Activated Position */
#define SPW_PKTRX1_IM_ACT_Msk                 (_UINT32_(0x1) << SPW_PKTRX1_IM_ACT_Pos)             /* (SPW_PKTRX1_IM) Activated Mask */
#define SPW_PKTRX1_IM_ACT(value)              (SPW_PKTRX1_IM_ACT_Msk & (_UINT32_(value) << SPW_PKTRX1_IM_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTRX1_IM register */
#define SPW_PKTRX1_IM_Msk                     _UINT32_(0x0000001F)                                 /* (SPW_PKTRX1_IM) Register Mask  */


