Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_PKTRX1_CFG : (SPW Offset: 0x820) (R/W 32) PktRx Config -------- */
#define SPW_PKTRX1_CFG_DISCARD_Pos            _UINT32_(0)                                          /* (SPW_PKTRX1_CFG) Discard Position */
#define SPW_PKTRX1_CFG_DISCARD_Msk            (_UINT32_(0x1) << SPW_PKTRX1_CFG_DISCARD_Pos)        /* (SPW_PKTRX1_CFG) Discard Mask */
#define SPW_PKTRX1_CFG_DISCARD(value)         (SPW_PKTRX1_CFG_DISCARD_Msk & (_UINT32_(value) << SPW_PKTRX1_CFG_DISCARD_Pos)) /* Assigment of value for DISCARD in the SPW_PKTRX1_CFG register */
#define SPW_PKTRX1_CFG_Msk                    _UINT32_(0x00000001)                                 /* (SPW_PKTRX1_CFG) Register Mask  */


/* -------- SPW_PKTRX1_STATUS : (SPW Offset: 0x824) ( R/ 32) PktRx Status -------- */
#define SPW_PKTRX1_STATUS_COUNT_Pos           _UINT32_(0)                                          /* (SPW_PKTRX1_STATUS) Packet Count Position */
#define SPW_PKTRX1_STATUS_COUNT_Msk           (_UINT32_(0xFFFF) << SPW_PKTRX1_STATUS_COUNT_Pos)    /* (SPW_PKTRX1_STATUS) Packet Count Mask */
#define SPW_PKTRX1_STATUS_COUNT(value)        (SPW_PKTRX1_STATUS_COUNT_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_COUNT_Pos)) /* Assigment of value for COUNT in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_PACKET_Pos          _UINT32_(16)                                         /* (SPW_PKTRX1_STATUS) Packet Position */
#define SPW_PKTRX1_STATUS_PACKET_Msk          (_UINT32_(0x1) << SPW_PKTRX1_STATUS_PACKET_Pos)      /* (SPW_PKTRX1_STATUS) Packet Mask */
#define SPW_PKTRX1_STATUS_PACKET(value)       (SPW_PKTRX1_STATUS_PACKET_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_PACKET_Pos)) /* Assigment of value for PACKET in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_LOCKED_Pos          _UINT32_(17)                                         /* (SPW_PKTRX1_STATUS) Locked Position */
#define SPW_PKTRX1_STATUS_LOCKED_Msk          (_UINT32_(0x1) << SPW_PKTRX1_STATUS_LOCKED_Pos)      /* (SPW_PKTRX1_STATUS) Locked Mask */
#define SPW_PKTRX1_STATUS_LOCKED(value)       (SPW_PKTRX1_STATUS_LOCKED_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_LOCKED_Pos)) /* Assigment of value for LOCKED in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_ARM_Pos             _UINT32_(18)                                         /* (SPW_PKTRX1_STATUS) Armed Position */
#define SPW_PKTRX1_STATUS_ARM_Msk             (_UINT32_(0x1) << SPW_PKTRX1_STATUS_ARM_Pos)         /* (SPW_PKTRX1_STATUS) Armed Mask */
#define SPW_PKTRX1_STATUS_ARM(value)          (SPW_PKTRX1_STATUS_ARM_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_ARM_Pos)) /* Assigment of value for ARM in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_ACT_Pos             _UINT32_(19)                                         /* (SPW_PKTRX1_STATUS) Active Position */
#define SPW_PKTRX1_STATUS_ACT_Msk             (_UINT32_(0x1) << SPW_PKTRX1_STATUS_ACT_Pos)         /* (SPW_PKTRX1_STATUS) Active Mask */
#define SPW_PKTRX1_STATUS_ACT(value)          (SPW_PKTRX1_STATUS_ACT_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_PENDING_Pos         _UINT32_(20)                                         /* (SPW_PKTRX1_STATUS) Pending Position */
#define SPW_PKTRX1_STATUS_PENDING_Msk         (_UINT32_(0x1) << SPW_PKTRX1_STATUS_PENDING_Pos)     /* (SPW_PKTRX1_STATUS) Pending Mask */
#define SPW_PKTRX1_STATUS_PENDING(value)      (SPW_PKTRX1_STATUS_PENDING_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_PENDING_Pos)) /* Assigment of value for PENDING in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_DEACT_Pos           _UINT32_(21)                                         /* (SPW_PKTRX1_STATUS) Deactivating Position */
#define SPW_PKTRX1_STATUS_DEACT_Msk           (_UINT32_(0x1) << SPW_PKTRX1_STATUS_DEACT_Pos)       /* (SPW_PKTRX1_STATUS) Deactivating Mask */
#define SPW_PKTRX1_STATUS_DEACT(value)        (SPW_PKTRX1_STATUS_DEACT_Msk & (_UINT32_(value) << SPW_PKTRX1_STATUS_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTRX1_STATUS register */
#define SPW_PKTRX1_STATUS_Msk                 _UINT32_(0x003FFFFF)                                 /* (SPW_PKTRX1_STATUS) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFDATAADDR : (SPW Offset: 0x830) (R/W 32) PktRx Next Buffer Data Address -------- */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos    _UINT32_(0)                                          /* (SPW_PKTRX1_NXTBUFDATAADDR) Address Position */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Msk    (_UINT32_(0xFFFFFFFF) << SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos) /* (SPW_PKTRX1_NXTBUFDATAADDR) Address Mask */
#define SPW_PKTRX1_NXTBUFDATAADDR_ADDR(value) (SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFDATAADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SPW_PKTRX1_NXTBUFDATAADDR register */
#define SPW_PKTRX1_NXTBUFDATAADDR_Msk         _UINT32_(0xFFFFFFFF)                                 /* (SPW_PKTRX1_NXTBUFDATAADDR) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFDATALEN : (SPW Offset: 0x834) (R/W 32) PktRx Next Buffer Data Length -------- */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos      _UINT32_(0)                                          /* (SPW_PKTRX1_NXTBUFDATALEN) Length Position */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN_Msk      (_UINT32_(0xFFFFFF) << SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos) /* (SPW_PKTRX1_NXTBUFDATALEN) Length Mask */
#define SPW_PKTRX1_NXTBUFDATALEN_LEN(value)   (SPW_PKTRX1_NXTBUFDATALEN_LEN_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFDATALEN_LEN_Pos)) /* Assigment of value for LEN in the SPW_PKTRX1_NXTBUFDATALEN register */
#define SPW_PKTRX1_NXTBUFDATALEN_Msk          _UINT32_(0x00FFFFFF)                                 /* (SPW_PKTRX1_NXTBUFDATALEN) Register Mask  */


/* -------- SPW_PKTRX1_NXTBUFPKTADDR : (SPW Offset: 0x838) (R/W 32) PktRx Next Buffer Packet Address -------- */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos     _UINT32_(0)                                          /* (SPW_PKTRX1_NXTBUFPKTADDR) Address Position */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Msk     (_UINT32_(0xFFFFFFFF) << SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos) /* (SPW_PKTRX1_NXTBUFPKTADDR) Address Mask */
#define SPW_PKTRX1_NXTBUFPKTADDR_ADDR(value)  (SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFPKTADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SPW_PKTRX1_NXTBUFPKTADDR register */
#define SPW_PKTRX1_NXTBUFPKTADDR_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SPW_PKTRX1_NXTBUFPKTADDR) Register Mask  */


