Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_PKTRX1_NXTBUFCFG : (SPW Offset: 0x83C) (R/W 32) PktRx Next Buffer Config -------- */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos       _UINT32_(0)                                          /* (SPW_PKTRX1_NXTBUFCFG) Max Count Position */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT_Msk       (_UINT32_(0xFFFF) << SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos) /* (SPW_PKTRX1_NXTBUFCFG) Max Count Mask */
#define SPW_PKTRX1_NXTBUFCFG_MAXCNT(value)    (SPW_PKTRX1_NXTBUFCFG_MAXCNT_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFCFG_MAXCNT_Pos)) /* Assigment of value for MAXCNT in the SPW_PKTRX1_NXTBUFCFG register */
#define SPW_PKTRX1_NXTBUFCFG_VALUE_Pos        _UINT32_(16)                                         /* (SPW_PKTRX1_NXTBUFCFG) Start Value Position */
#define SPW_PKTRX1_NXTBUFCFG_VALUE_Msk        (_UINT32_(0x3F) << SPW_PKTRX1_NXTBUFCFG_VALUE_Pos)   /* (SPW_PKTRX1_NXTBUFCFG) Start Value Mask */
#define SPW_PKTRX1_NXTBUFCFG_VALUE(value)     (SPW_PKTRX1_NXTBUFCFG_VALUE_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFCFG_VALUE_Pos)) /* Assigment of value for VALUE in the SPW_PKTRX1_NXTBUFCFG register */
#define SPW_PKTRX1_NXTBUFCFG_START_Pos        _UINT32_(22)                                         /* (SPW_PKTRX1_NXTBUFCFG) Start Mode Position */
#define SPW_PKTRX1_NXTBUFCFG_START_Msk        (_UINT32_(0x7) << SPW_PKTRX1_NXTBUFCFG_START_Pos)    /* (SPW_PKTRX1_NXTBUFCFG) Start Mode Mask */
#define SPW_PKTRX1_NXTBUFCFG_START(value)     (SPW_PKTRX1_NXTBUFCFG_START_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFCFG_START_Pos)) /* Assigment of value for START in the SPW_PKTRX1_NXTBUFCFG register */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT_Val _UINT32_(0x0)                                        /* (SPW_PKTRX1_NXTBUFCFG) Start if any bit in Start Value matches an incoming event  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTNOW_Val _UINT32_(0x1)                                        /* (SPW_PKTRX1_NXTBUFCFG) Start immediately. Request a deactivation on next packet boundary.  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1_Val _UINT32_(0x2)                                        /* (SPW_PKTRX1_NXTBUFCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1  */
#define   SPW_PKTRX1_NXTBUFCFG_START_STARTLATER_Val _UINT32_(0x4)                                        /* (SPW_PKTRX1_NXTBUFCFG) Start when Current Buffer is deactivated, e.g. by becoming full  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT (SPW_PKTRX1_NXTBUFCFG_START_STARTEVENT_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /* (SPW_PKTRX1_NXTBUFCFG) Start if any bit in Start Value matches an incoming event Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTNOW   (SPW_PKTRX1_NXTBUFCFG_START_STARTNOW_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /* (SPW_PKTRX1_NXTBUFCFG) Start immediately. Request a deactivation on next packet boundary. Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1  (SPW_PKTRX1_NXTBUFCFG_START_STARTTCH1_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /* (SPW_PKTRX1_NXTBUFCFG) Start if Start Value matches an incoming Time Code from Time Code Handler 1 Position  */
#define SPW_PKTRX1_NXTBUFCFG_START_STARTLATER (SPW_PKTRX1_NXTBUFCFG_START_STARTLATER_Val << SPW_PKTRX1_NXTBUFCFG_START_Pos) /* (SPW_PKTRX1_NXTBUFCFG) Start when Current Buffer is deactivated, e.g. by becoming full Position  */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos        _UINT32_(30)                                         /* (SPW_PKTRX1_NXTBUFCFG) Split Pkt Position */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT_Msk        (_UINT32_(0x1) << SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos)    /* (SPW_PKTRX1_NXTBUFCFG) Split Pkt Mask */
#define SPW_PKTRX1_NXTBUFCFG_SPLIT(value)     (SPW_PKTRX1_NXTBUFCFG_SPLIT_Msk & (_UINT32_(value) << SPW_PKTRX1_NXTBUFCFG_SPLIT_Pos)) /* Assigment of value for SPLIT in the SPW_PKTRX1_NXTBUFCFG register */
#define SPW_PKTRX1_NXTBUFCFG_Msk              _UINT32_(0x41FFFFFF)                                 /* (SPW_PKTRX1_NXTBUFCFG) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFDATAADDR : (SPW Offset: 0x840) ( R/ 32) PktRx Current Buffer Data Address -------- */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos    _UINT32_(0)                                          /* (SPW_PKTRX1_CURBUFDATAADDR) Address Position */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR_Msk    (_UINT32_(0xFFFFFFFF) << SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos) /* (SPW_PKTRX1_CURBUFDATAADDR) Address Mask */
#define SPW_PKTRX1_CURBUFDATAADDR_ADDR(value) (SPW_PKTRX1_CURBUFDATAADDR_ADDR_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFDATAADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SPW_PKTRX1_CURBUFDATAADDR register */
#define SPW_PKTRX1_CURBUFDATAADDR_Msk         _UINT32_(0xFFFFFFFF)                                 /* (SPW_PKTRX1_CURBUFDATAADDR) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFDATALEN : (SPW Offset: 0x844) ( R/ 32) PktRx Current Buffer Data Length -------- */
#define SPW_PKTRX1_CURBUFDATALEN_LEN_Pos      _UINT32_(0)                                          /* (SPW_PKTRX1_CURBUFDATALEN) Length Position */
#define SPW_PKTRX1_CURBUFDATALEN_LEN_Msk      (_UINT32_(0xFFFFFF) << SPW_PKTRX1_CURBUFDATALEN_LEN_Pos) /* (SPW_PKTRX1_CURBUFDATALEN) Length Mask */
#define SPW_PKTRX1_CURBUFDATALEN_LEN(value)   (SPW_PKTRX1_CURBUFDATALEN_LEN_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFDATALEN_LEN_Pos)) /* Assigment of value for LEN in the SPW_PKTRX1_CURBUFDATALEN register */
#define SPW_PKTRX1_CURBUFDATALEN_Msk          _UINT32_(0x00FFFFFF)                                 /* (SPW_PKTRX1_CURBUFDATALEN) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFPKTADDR : (SPW Offset: 0x848) ( R/ 32) PktRx Current Buffer Packet Address -------- */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos     _UINT32_(0)                                          /* (SPW_PKTRX1_CURBUFPKTADDR) Address Position */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR_Msk     (_UINT32_(0xFFFFFFFF) << SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos) /* (SPW_PKTRX1_CURBUFPKTADDR) Address Mask */
#define SPW_PKTRX1_CURBUFPKTADDR_ADDR(value)  (SPW_PKTRX1_CURBUFPKTADDR_ADDR_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFPKTADDR_ADDR_Pos)) /* Assigment of value for ADDR in the SPW_PKTRX1_CURBUFPKTADDR register */
#define SPW_PKTRX1_CURBUFPKTADDR_Msk          _UINT32_(0xFFFFFFFF)                                 /* (SPW_PKTRX1_CURBUFPKTADDR) Register Mask  */


/* -------- SPW_PKTRX1_CURBUFCFG : (SPW Offset: 0x84C) (R/W 32) PktRx Current Buffer Config -------- */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos       _UINT32_(0)                                          /* (SPW_PKTRX1_CURBUFCFG) Max Count Position */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT_Msk       (_UINT32_(0xFFFF) << SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos) /* (SPW_PKTRX1_CURBUFCFG) Max Count Mask */
#define SPW_PKTRX1_CURBUFCFG_MAXCNT(value)    (SPW_PKTRX1_CURBUFCFG_MAXCNT_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFCFG_MAXCNT_Pos)) /* Assigment of value for MAXCNT in the SPW_PKTRX1_CURBUFCFG register */
#define SPW_PKTRX1_CURBUFCFG_SPLIT_Pos        _UINT32_(30)                                         /* (SPW_PKTRX1_CURBUFCFG) Split Position */
#define SPW_PKTRX1_CURBUFCFG_SPLIT_Msk        (_UINT32_(0x1) << SPW_PKTRX1_CURBUFCFG_SPLIT_Pos)    /* (SPW_PKTRX1_CURBUFCFG) Split Mask */
#define SPW_PKTRX1_CURBUFCFG_SPLIT(value)     (SPW_PKTRX1_CURBUFCFG_SPLIT_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFCFG_SPLIT_Pos)) /* Assigment of value for SPLIT in the SPW_PKTRX1_CURBUFCFG register */
#define SPW_PKTRX1_CURBUFCFG_ABORT_Pos        _UINT32_(31)                                         /* (SPW_PKTRX1_CURBUFCFG) Abort Position */
#define SPW_PKTRX1_CURBUFCFG_ABORT_Msk        (_UINT32_(0x1) << SPW_PKTRX1_CURBUFCFG_ABORT_Pos)    /* (SPW_PKTRX1_CURBUFCFG) Abort Mask */
#define SPW_PKTRX1_CURBUFCFG_ABORT(value)     (SPW_PKTRX1_CURBUFCFG_ABORT_Msk & (_UINT32_(value) << SPW_PKTRX1_CURBUFCFG_ABORT_Pos)) /* Assigment of value for ABORT in the SPW_PKTRX1_CURBUFCFG register */
#define SPW_PKTRX1_CURBUFCFG_Msk              _UINT32_(0xC000FFFF)                                 /* (SPW_PKTRX1_CURBUFCFG) Register Mask  */


/* -------- SPW_PKTRX1_PREVBUFDATALEN : (SPW Offset: 0x850) ( R/ 32) PktRx Previous Buffer Data Length -------- */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos     _UINT32_(0)                                          /* (SPW_PKTRX1_PREVBUFDATALEN) Length Position */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN_Msk     (_UINT32_(0xFFFFFF) << SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos) /* (SPW_PKTRX1_PREVBUFDATALEN) Length Mask */
#define SPW_PKTRX1_PREVBUFDATALEN_LEN(value)  (SPW_PKTRX1_PREVBUFDATALEN_LEN_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFDATALEN_LEN_Pos)) /* Assigment of value for LEN in the SPW_PKTRX1_PREVBUFDATALEN register */
#define SPW_PKTRX1_PREVBUFDATALEN_Msk         _UINT32_(0x00FFFFFF)                                 /* (SPW_PKTRX1_PREVBUFDATALEN) Register Mask  */


