Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_PKTRX1_PREVBUFSTS : (SPW Offset: 0x854) ( R/ 32) PktRx Previous Buffer Status -------- */
#define SPW_PKTRX1_PREVBUFSTS_CNT_Pos         _UINT32_(0)                                          /* (SPW_PKTRX1_PREVBUFSTS) Count Position */
#define SPW_PKTRX1_PREVBUFSTS_CNT_Msk         (_UINT32_(0xFFFF) << SPW_PKTRX1_PREVBUFSTS_CNT_Pos)  /* (SPW_PKTRX1_PREVBUFSTS) Count Mask */
#define SPW_PKTRX1_PREVBUFSTS_CNT(value)      (SPW_PKTRX1_PREVBUFSTS_CNT_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_CNT_Pos)) /* Assigment of value for CNT in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_EEP_Pos         _UINT32_(16)                                         /* (SPW_PKTRX1_PREVBUFSTS) EEP seen Position */
#define SPW_PKTRX1_PREVBUFSTS_EEP_Msk         (_UINT32_(0x1) << SPW_PKTRX1_PREVBUFSTS_EEP_Pos)     /* (SPW_PKTRX1_PREVBUFSTS) EEP seen Mask */
#define SPW_PKTRX1_PREVBUFSTS_EEP(value)      (SPW_PKTRX1_PREVBUFSTS_EEP_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_FULLI_Pos       _UINT32_(17)                                         /* (SPW_PKTRX1_PREVBUFSTS) Buffer Info Full Position */
#define SPW_PKTRX1_PREVBUFSTS_FULLI_Msk       (_UINT32_(0x1) << SPW_PKTRX1_PREVBUFSTS_FULLI_Pos)   /* (SPW_PKTRX1_PREVBUFSTS) Buffer Info Full Mask */
#define SPW_PKTRX1_PREVBUFSTS_FULLI(value)    (SPW_PKTRX1_PREVBUFSTS_FULLI_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_FULLI_Pos)) /* Assigment of value for FULLI in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_FULLD_Pos       _UINT32_(18)                                         /* (SPW_PKTRX1_PREVBUFSTS) Buffer Data Full Position */
#define SPW_PKTRX1_PREVBUFSTS_FULLD_Msk       (_UINT32_(0x1) << SPW_PKTRX1_PREVBUFSTS_FULLD_Pos)   /* (SPW_PKTRX1_PREVBUFSTS) Buffer Data Full Mask */
#define SPW_PKTRX1_PREVBUFSTS_FULLD(value)    (SPW_PKTRX1_PREVBUFSTS_FULLD_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_FULLD_Pos)) /* Assigment of value for FULLD in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos      _UINT32_(19)                                         /* (SPW_PKTRX1_PREVBUFSTS) DMA Error Position */
#define SPW_PKTRX1_PREVBUFSTS_DMAERR_Msk      (_UINT32_(0x1) << SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos)  /* (SPW_PKTRX1_PREVBUFSTS) DMA Error Mask */
#define SPW_PKTRX1_PREVBUFSTS_DMAERR(value)   (SPW_PKTRX1_PREVBUFSTS_DMAERR_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_DMAERR_Pos)) /* Assigment of value for DMAERR in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos      _UINT32_(31)                                         /* (SPW_PKTRX1_PREVBUFSTS) Locked Position */
#define SPW_PKTRX1_PREVBUFSTS_LOCKED_Msk      (_UINT32_(0x1) << SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos)  /* (SPW_PKTRX1_PREVBUFSTS) Locked Mask */
#define SPW_PKTRX1_PREVBUFSTS_LOCKED(value)   (SPW_PKTRX1_PREVBUFSTS_LOCKED_Msk & (_UINT32_(value) << SPW_PKTRX1_PREVBUFSTS_LOCKED_Pos)) /* Assigment of value for LOCKED in the SPW_PKTRX1_PREVBUFSTS register */
#define SPW_PKTRX1_PREVBUFSTS_Msk             _UINT32_(0x800FFFFF)                                 /* (SPW_PKTRX1_PREVBUFSTS) Register Mask  */


/* -------- SPW_PKTRX1_SWRESET : (SPW Offset: 0x87C) (R/W 32) PktRx Software Reset -------- */
#define SPW_PKTRX1_SWRESET_PATTERN_Pos        _UINT32_(0)                                          /* (SPW_PKTRX1_SWRESET) Pattern Position */
#define SPW_PKTRX1_SWRESET_PATTERN_Msk        (_UINT32_(0xFFFFFFFF) << SPW_PKTRX1_SWRESET_PATTERN_Pos) /* (SPW_PKTRX1_SWRESET) Pattern Mask */
#define SPW_PKTRX1_SWRESET_PATTERN(value)     (SPW_PKTRX1_SWRESET_PATTERN_Msk & (_UINT32_(value) << SPW_PKTRX1_SWRESET_PATTERN_Pos)) /* Assigment of value for PATTERN in the SPW_PKTRX1_SWRESET register */
#define SPW_PKTRX1_SWRESET_Msk                _UINT32_(0xFFFFFFFF)                                 /* (SPW_PKTRX1_SWRESET) Register Mask  */


/* -------- SPW_PKTTX1_PI_RM : (SPW Offset: 0xC00) ( R/ 32) PktTx Pending Read Masked Interrupt -------- */
#define SPW_PKTTX1_PI_RM_DEACT_Pos            _UINT32_(0)                                          /* (SPW_PKTTX1_PI_RM) Deactivated Position */
#define SPW_PKTTX1_PI_RM_DEACT_Msk            (_UINT32_(0x1) << SPW_PKTTX1_PI_RM_DEACT_Pos)        /* (SPW_PKTTX1_PI_RM) Deactivated Mask */
#define SPW_PKTTX1_PI_RM_DEACT(value)         (SPW_PKTTX1_PI_RM_DEACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RM_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTTX1_PI_RM register */
#define SPW_PKTTX1_PI_RM_ACT_Pos              _UINT32_(1)                                          /* (SPW_PKTTX1_PI_RM) Activated Position */
#define SPW_PKTTX1_PI_RM_ACT_Msk              (_UINT32_(0x1) << SPW_PKTTX1_PI_RM_ACT_Pos)          /* (SPW_PKTTX1_PI_RM) Activated Mask */
#define SPW_PKTTX1_PI_RM_ACT(value)           (SPW_PKTTX1_PI_RM_ACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RM_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTTX1_PI_RM register */
#define SPW_PKTTX1_PI_RM_EOP_Pos              _UINT32_(2)                                          /* (SPW_PKTTX1_PI_RM) EOP sent Position */
#define SPW_PKTTX1_PI_RM_EOP_Msk              (_UINT32_(0x1) << SPW_PKTTX1_PI_RM_EOP_Pos)          /* (SPW_PKTTX1_PI_RM) EOP sent Mask */
#define SPW_PKTTX1_PI_RM_EOP(value)           (SPW_PKTTX1_PI_RM_EOP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RM_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTTX1_PI_RM register */
#define SPW_PKTTX1_PI_RM_EEP_Pos              _UINT32_(3)                                          /* (SPW_PKTTX1_PI_RM) EEP sent Position */
#define SPW_PKTTX1_PI_RM_EEP_Msk              (_UINT32_(0x1) << SPW_PKTTX1_PI_RM_EEP_Pos)          /* (SPW_PKTTX1_PI_RM) EEP sent Mask */
#define SPW_PKTTX1_PI_RM_EEP(value)           (SPW_PKTTX1_PI_RM_EEP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RM_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTTX1_PI_RM register */
#define SPW_PKTTX1_PI_RM_Msk                  _UINT32_(0x0000000F)                                 /* (SPW_PKTTX1_PI_RM) Register Mask  */


/* -------- SPW_PKTTX1_PI_R : (SPW Offset: 0xC08) ( R/ 32) PktTx Pending Read Interrupt -------- */
#define SPW_PKTTX1_PI_R_DEACT_Pos             _UINT32_(0)                                          /* (SPW_PKTTX1_PI_R) Deactivated Position */
#define SPW_PKTTX1_PI_R_DEACT_Msk             (_UINT32_(0x1) << SPW_PKTTX1_PI_R_DEACT_Pos)         /* (SPW_PKTTX1_PI_R) Deactivated Mask */
#define SPW_PKTTX1_PI_R_DEACT(value)          (SPW_PKTTX1_PI_R_DEACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_R_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTTX1_PI_R register */
#define SPW_PKTTX1_PI_R_ACT_Pos               _UINT32_(1)                                          /* (SPW_PKTTX1_PI_R) Activated Position */
#define SPW_PKTTX1_PI_R_ACT_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_R_ACT_Pos)           /* (SPW_PKTTX1_PI_R) Activated Mask */
#define SPW_PKTTX1_PI_R_ACT(value)            (SPW_PKTTX1_PI_R_ACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_R_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTTX1_PI_R register */
#define SPW_PKTTX1_PI_R_EOP_Pos               _UINT32_(2)                                          /* (SPW_PKTTX1_PI_R) EOP sent Position */
#define SPW_PKTTX1_PI_R_EOP_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_R_EOP_Pos)           /* (SPW_PKTTX1_PI_R) EOP sent Mask */
#define SPW_PKTTX1_PI_R_EOP(value)            (SPW_PKTTX1_PI_R_EOP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_R_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTTX1_PI_R register */
#define SPW_PKTTX1_PI_R_EEP_Pos               _UINT32_(3)                                          /* (SPW_PKTTX1_PI_R) EEP sent Position */
#define SPW_PKTTX1_PI_R_EEP_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_R_EEP_Pos)           /* (SPW_PKTTX1_PI_R) EEP sent Mask */
#define SPW_PKTTX1_PI_R_EEP(value)            (SPW_PKTTX1_PI_R_EEP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_R_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTTX1_PI_R register */
#define SPW_PKTTX1_PI_R_Msk                   _UINT32_(0x0000000F)                                 /* (SPW_PKTTX1_PI_R) Register Mask  */


