Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_PKTTX1_PI_RCS : (SPW Offset: 0xC0C) (R/W 32) PktTx Pending Read, Clear and Enabled Interrupt -------- */
#define SPW_PKTTX1_PI_RCS_DEACT_Pos           _UINT32_(0)                                          /* (SPW_PKTTX1_PI_RCS) Deactivated Position */
#define SPW_PKTTX1_PI_RCS_DEACT_Msk           (_UINT32_(0x1) << SPW_PKTTX1_PI_RCS_DEACT_Pos)       /* (SPW_PKTTX1_PI_RCS) Deactivated Mask */
#define SPW_PKTTX1_PI_RCS_DEACT(value)        (SPW_PKTTX1_PI_RCS_DEACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RCS_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTTX1_PI_RCS register */
#define SPW_PKTTX1_PI_RCS_ACT_Pos             _UINT32_(1)                                          /* (SPW_PKTTX1_PI_RCS) Activated Position */
#define SPW_PKTTX1_PI_RCS_ACT_Msk             (_UINT32_(0x1) << SPW_PKTTX1_PI_RCS_ACT_Pos)         /* (SPW_PKTTX1_PI_RCS) Activated Mask */
#define SPW_PKTTX1_PI_RCS_ACT(value)          (SPW_PKTTX1_PI_RCS_ACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RCS_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTTX1_PI_RCS register */
#define SPW_PKTTX1_PI_RCS_EOP_Pos             _UINT32_(2)                                          /* (SPW_PKTTX1_PI_RCS) EOP sent Position */
#define SPW_PKTTX1_PI_RCS_EOP_Msk             (_UINT32_(0x1) << SPW_PKTTX1_PI_RCS_EOP_Pos)         /* (SPW_PKTTX1_PI_RCS) EOP sent Mask */
#define SPW_PKTTX1_PI_RCS_EOP(value)          (SPW_PKTTX1_PI_RCS_EOP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RCS_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTTX1_PI_RCS register */
#define SPW_PKTTX1_PI_RCS_EEP_Pos             _UINT32_(3)                                          /* (SPW_PKTTX1_PI_RCS) EEP sent Position */
#define SPW_PKTTX1_PI_RCS_EEP_Msk             (_UINT32_(0x1) << SPW_PKTTX1_PI_RCS_EEP_Pos)         /* (SPW_PKTTX1_PI_RCS) EEP sent Mask */
#define SPW_PKTTX1_PI_RCS_EEP(value)          (SPW_PKTTX1_PI_RCS_EEP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_RCS_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTTX1_PI_RCS register */
#define SPW_PKTTX1_PI_RCS_Msk                 _UINT32_(0x0000000F)                                 /* (SPW_PKTTX1_PI_RCS) Register Mask  */


/* -------- SPW_PKTTX1_IM : (SPW Offset: 0xC10) (R/W 32) PktTx Interrupt Mask -------- */
#define SPW_PKTTX1_IM_DEACT_Pos               _UINT32_(0)                                          /* (SPW_PKTTX1_IM) Deactivated Position */
#define SPW_PKTTX1_IM_DEACT_Msk               (_UINT32_(0x1) << SPW_PKTTX1_IM_DEACT_Pos)           /* (SPW_PKTTX1_IM) Deactivated Mask */
#define SPW_PKTTX1_IM_DEACT(value)            (SPW_PKTTX1_IM_DEACT_Msk & (_UINT32_(value) << SPW_PKTTX1_IM_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTTX1_IM register */
#define SPW_PKTTX1_IM_ACT_Pos                 _UINT32_(1)                                          /* (SPW_PKTTX1_IM) Activated Position */
#define SPW_PKTTX1_IM_ACT_Msk                 (_UINT32_(0x1) << SPW_PKTTX1_IM_ACT_Pos)             /* (SPW_PKTTX1_IM) Activated Mask */
#define SPW_PKTTX1_IM_ACT(value)              (SPW_PKTTX1_IM_ACT_Msk & (_UINT32_(value) << SPW_PKTTX1_IM_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTTX1_IM register */
#define SPW_PKTTX1_IM_EOP_Pos                 _UINT32_(2)                                          /* (SPW_PKTTX1_IM) EOP sent Position */
#define SPW_PKTTX1_IM_EOP_Msk                 (_UINT32_(0x1) << SPW_PKTTX1_IM_EOP_Pos)             /* (SPW_PKTTX1_IM) EOP sent Mask */
#define SPW_PKTTX1_IM_EOP(value)              (SPW_PKTTX1_IM_EOP_Msk & (_UINT32_(value) << SPW_PKTTX1_IM_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTTX1_IM register */
#define SPW_PKTTX1_IM_EEP_Pos                 _UINT32_(3)                                          /* (SPW_PKTTX1_IM) EEP sent Position */
#define SPW_PKTTX1_IM_EEP_Msk                 (_UINT32_(0x1) << SPW_PKTTX1_IM_EEP_Pos)             /* (SPW_PKTTX1_IM) EEP sent Mask */
#define SPW_PKTTX1_IM_EEP(value)              (SPW_PKTTX1_IM_EEP_Msk & (_UINT32_(value) << SPW_PKTTX1_IM_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTTX1_IM register */
#define SPW_PKTTX1_IM_Msk                     _UINT32_(0x0000000F)                                 /* (SPW_PKTTX1_IM) Register Mask  */


/* -------- SPW_PKTTX1_PI_C : (SPW Offset: 0xC14) ( /W 32) PktTx Clear Pending Interrupt -------- */
#define SPW_PKTTX1_PI_C_DEACT_Pos             _UINT32_(0)                                          /* (SPW_PKTTX1_PI_C) Deactivated Position */
#define SPW_PKTTX1_PI_C_DEACT_Msk             (_UINT32_(0x1) << SPW_PKTTX1_PI_C_DEACT_Pos)         /* (SPW_PKTTX1_PI_C) Deactivated Mask */
#define SPW_PKTTX1_PI_C_DEACT(value)          (SPW_PKTTX1_PI_C_DEACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_C_DEACT_Pos)) /* Assigment of value for DEACT in the SPW_PKTTX1_PI_C register */
#define SPW_PKTTX1_PI_C_ACT_Pos               _UINT32_(1)                                          /* (SPW_PKTTX1_PI_C) Activated Position */
#define SPW_PKTTX1_PI_C_ACT_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_C_ACT_Pos)           /* (SPW_PKTTX1_PI_C) Activated Mask */
#define SPW_PKTTX1_PI_C_ACT(value)            (SPW_PKTTX1_PI_C_ACT_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_C_ACT_Pos)) /* Assigment of value for ACT in the SPW_PKTTX1_PI_C register */
#define SPW_PKTTX1_PI_C_EOP_Pos               _UINT32_(2)                                          /* (SPW_PKTTX1_PI_C) EOP sent Position */
#define SPW_PKTTX1_PI_C_EOP_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_C_EOP_Pos)           /* (SPW_PKTTX1_PI_C) EOP sent Mask */
#define SPW_PKTTX1_PI_C_EOP(value)            (SPW_PKTTX1_PI_C_EOP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_C_EOP_Pos)) /* Assigment of value for EOP in the SPW_PKTTX1_PI_C register */
#define SPW_PKTTX1_PI_C_EEP_Pos               _UINT32_(3)                                          /* (SPW_PKTTX1_PI_C) EEP sent Position */
#define SPW_PKTTX1_PI_C_EEP_Msk               (_UINT32_(0x1) << SPW_PKTTX1_PI_C_EEP_Pos)           /* (SPW_PKTTX1_PI_C) EEP sent Mask */
#define SPW_PKTTX1_PI_C_EEP(value)            (SPW_PKTTX1_PI_C_EEP_Msk & (_UINT32_(value) << SPW_PKTTX1_PI_C_EEP_Pos)) /* Assigment of value for EEP in the SPW_PKTTX1_PI_C register */
#define SPW_PKTTX1_PI_C_Msk                   _UINT32_(0x0000000F)                                 /* (SPW_PKTTX1_PI_C) Register Mask  */


