Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_TCH_IM_C : (SPW Offset: 0xE9C) ( /W 32) SpW Tch Interrupt Clear Mask -------- */
#define SPW_TCH_IM_C_TCEVENT_Pos              _UINT32_(0)                                          /* (SPW_TCH_IM_C) TcEvent Position */
#define SPW_TCH_IM_C_TCEVENT_Msk              (_UINT32_(0x1) << SPW_TCH_IM_C_TCEVENT_Pos)          /* (SPW_TCH_IM_C) TcEvent Mask */
#define SPW_TCH_IM_C_TCEVENT(value)           (SPW_TCH_IM_C_TCEVENT_Msk & (_UINT32_(value) << SPW_TCH_IM_C_TCEVENT_Pos)) /* Assigment of value for TCEVENT in the SPW_TCH_IM_C register */
#define SPW_TCH_IM_C_TIMECODE_Pos             _UINT32_(1)                                          /* (SPW_TCH_IM_C) Time Code Position */
#define SPW_TCH_IM_C_TIMECODE_Msk             (_UINT32_(0x1) << SPW_TCH_IM_C_TIMECODE_Pos)         /* (SPW_TCH_IM_C) Time Code Mask */
#define SPW_TCH_IM_C_TIMECODE(value)          (SPW_TCH_IM_C_TIMECODE_Msk & (_UINT32_(value) << SPW_TCH_IM_C_TIMECODE_Pos)) /* Assigment of value for TIMECODE in the SPW_TCH_IM_C register */
#define SPW_TCH_IM_C_ANYTIMECODE_Pos          _UINT32_(2)                                          /* (SPW_TCH_IM_C) Any Time Code Position */
#define SPW_TCH_IM_C_ANYTIMECODE_Msk          (_UINT32_(0x1) << SPW_TCH_IM_C_ANYTIMECODE_Pos)      /* (SPW_TCH_IM_C) Any Time Code Mask */
#define SPW_TCH_IM_C_ANYTIMECODE(value)       (SPW_TCH_IM_C_ANYTIMECODE_Msk & (_UINT32_(value) << SPW_TCH_IM_C_ANYTIMECODE_Pos)) /* Assigment of value for ANYTIMECODE in the SPW_TCH_IM_C register */
#define SPW_TCH_IM_C_LATEWD_Pos               _UINT32_(3)                                          /* (SPW_TCH_IM_C) Late Watchdog Position */
#define SPW_TCH_IM_C_LATEWD_Msk               (_UINT32_(0x1) << SPW_TCH_IM_C_LATEWD_Pos)           /* (SPW_TCH_IM_C) Late Watchdog Mask */
#define SPW_TCH_IM_C_LATEWD(value)            (SPW_TCH_IM_C_LATEWD_Msk & (_UINT32_(value) << SPW_TCH_IM_C_LATEWD_Pos)) /* Assigment of value for LATEWD in the SPW_TCH_IM_C register */
#define SPW_TCH_IM_C_EARLYWD_Pos              _UINT32_(4)                                          /* (SPW_TCH_IM_C) Early Watchdog Position */
#define SPW_TCH_IM_C_EARLYWD_Msk              (_UINT32_(0x1) << SPW_TCH_IM_C_EARLYWD_Pos)          /* (SPW_TCH_IM_C) Early Watchdog Mask */
#define SPW_TCH_IM_C_EARLYWD(value)           (SPW_TCH_IM_C_EARLYWD_Msk & (_UINT32_(value) << SPW_TCH_IM_C_EARLYWD_Pos)) /* Assigment of value for EARLYWD in the SPW_TCH_IM_C register */
#define SPW_TCH_IM_C_Msk                      _UINT32_(0x0000001F)                                 /* (SPW_TCH_IM_C) Register Mask  */


/* -------- SPW_TCH_CFGLISTEN : (SPW Offset: 0xEA0) (R/W 32) SpW Tch Config Listener -------- */
#define SPW_TCH_CFGLISTEN_L1_Pos              _UINT32_(0)                                          /* (SPW_TCH_CFGLISTEN) Listen link 1 Position */
#define SPW_TCH_CFGLISTEN_L1_Msk              (_UINT32_(0x1) << SPW_TCH_CFGLISTEN_L1_Pos)          /* (SPW_TCH_CFGLISTEN) Listen link 1 Mask */
#define SPW_TCH_CFGLISTEN_L1(value)           (SPW_TCH_CFGLISTEN_L1_Msk & (_UINT32_(value) << SPW_TCH_CFGLISTEN_L1_Pos)) /* Assigment of value for L1 in the SPW_TCH_CFGLISTEN register */
#define SPW_TCH_CFGLISTEN_L2_Pos              _UINT32_(1)                                          /* (SPW_TCH_CFGLISTEN) Listen link 2 Position */
#define SPW_TCH_CFGLISTEN_L2_Msk              (_UINT32_(0x1) << SPW_TCH_CFGLISTEN_L2_Pos)          /* (SPW_TCH_CFGLISTEN) Listen link 2 Mask */
#define SPW_TCH_CFGLISTEN_L2(value)           (SPW_TCH_CFGLISTEN_L2_Msk & (_UINT32_(value) << SPW_TCH_CFGLISTEN_L2_Pos)) /* Assigment of value for L2 in the SPW_TCH_CFGLISTEN register */
#define SPW_TCH_CFGLISTEN_Msk                 _UINT32_(0x00000003)                                 /* (SPW_TCH_CFGLISTEN) Register Mask  */

#define SPW_TCH_CFGLISTEN_L_Pos               _UINT32_(0)                                          /* (SPW_TCH_CFGLISTEN Position) Listen link 2 */
#define SPW_TCH_CFGLISTEN_L_Msk               (_UINT32_(0x3) << SPW_TCH_CFGLISTEN_L_Pos)           /* (SPW_TCH_CFGLISTEN Mask) L */
#define SPW_TCH_CFGLISTEN_L(value)            (SPW_TCH_CFGLISTEN_L_Msk & (_UINT32_(value) << SPW_TCH_CFGLISTEN_L_Pos)) 

/* -------- SPW_TCH_CFGSEND : (SPW Offset: 0xEA4) (R/W 32) SpW Tch Config Sender -------- */
#define SPW_TCH_CFGSEND_S1_Pos                _UINT32_(0)                                          /* (SPW_TCH_CFGSEND) Send link 1 Position */
#define SPW_TCH_CFGSEND_S1_Msk                (_UINT32_(0x1) << SPW_TCH_CFGSEND_S1_Pos)            /* (SPW_TCH_CFGSEND) Send link 1 Mask */
#define SPW_TCH_CFGSEND_S1(value)             (SPW_TCH_CFGSEND_S1_Msk & (_UINT32_(value) << SPW_TCH_CFGSEND_S1_Pos)) /* Assigment of value for S1 in the SPW_TCH_CFGSEND register */
#define SPW_TCH_CFGSEND_S2_Pos                _UINT32_(1)                                          /* (SPW_TCH_CFGSEND) Send link 2 Position */
#define SPW_TCH_CFGSEND_S2_Msk                (_UINT32_(0x1) << SPW_TCH_CFGSEND_S2_Pos)            /* (SPW_TCH_CFGSEND) Send link 2 Mask */
#define SPW_TCH_CFGSEND_S2(value)             (SPW_TCH_CFGSEND_S2_Msk & (_UINT32_(value) << SPW_TCH_CFGSEND_S2_Pos)) /* Assigment of value for S2 in the SPW_TCH_CFGSEND register */
#define SPW_TCH_CFGSEND_Msk                   _UINT32_(0x00000003)                                 /* (SPW_TCH_CFGSEND) Register Mask  */

#define SPW_TCH_CFGSEND_S_Pos                 _UINT32_(0)                                          /* (SPW_TCH_CFGSEND Position) Send link 2 */
#define SPW_TCH_CFGSEND_S_Msk                 (_UINT32_(0x3) << SPW_TCH_CFGSEND_S_Pos)             /* (SPW_TCH_CFGSEND Mask) S */
#define SPW_TCH_CFGSEND_S(value)              (SPW_TCH_CFGSEND_S_Msk & (_UINT32_(value) << SPW_TCH_CFGSEND_S_Pos)) 

/* -------- SPW_TCH_CFG : (SPW Offset: 0xEA8) (R/W 32) SpW Tch Config -------- */
#define SPW_TCH_CFG_EVENT_Pos                 _UINT32_(0)                                          /* (SPW_TCH_CFG) Event Position */
#define SPW_TCH_CFG_EVENT_Msk                 (_UINT32_(0x3F) << SPW_TCH_CFG_EVENT_Pos)            /* (SPW_TCH_CFG) Event Mask */
#define SPW_TCH_CFG_EVENT(value)              (SPW_TCH_CFG_EVENT_Msk & (_UINT32_(value) << SPW_TCH_CFG_EVENT_Pos)) /* Assigment of value for EVENT in the SPW_TCH_CFG register */
#define SPW_TCH_CFG_Msk                       _UINT32_(0x0000003F)                                 /* (SPW_TCH_CFG) Register Mask  */


/* -------- SPW_TCH_CFGRESTART : (SPW Offset: 0xEAC) (R/W 32) SpW Tch Config Restart -------- */
#define SPW_TCH_CFGRESTART_VALUE_Pos          _UINT32_(0)                                          /* (SPW_TCH_CFGRESTART) Value Position */
#define SPW_TCH_CFGRESTART_VALUE_Msk          (_UINT32_(0x3F) << SPW_TCH_CFGRESTART_VALUE_Pos)     /* (SPW_TCH_CFGRESTART) Value Mask */
#define SPW_TCH_CFGRESTART_VALUE(value)       (SPW_TCH_CFGRESTART_VALUE_Msk & (_UINT32_(value) << SPW_TCH_CFGRESTART_VALUE_Pos)) /* Assigment of value for VALUE in the SPW_TCH_CFGRESTART register */
#define SPW_TCH_CFGRESTART_EVENT_Pos          _UINT32_(8)                                          /* (SPW_TCH_CFGRESTART) Event Position */
#define SPW_TCH_CFGRESTART_EVENT_Msk          (_UINT32_(0x3F) << SPW_TCH_CFGRESTART_EVENT_Pos)     /* (SPW_TCH_CFGRESTART) Event Mask */
#define SPW_TCH_CFGRESTART_EVENT(value)       (SPW_TCH_CFGRESTART_EVENT_Msk & (_UINT32_(value) << SPW_TCH_CFGRESTART_EVENT_Pos)) /* Assigment of value for EVENT in the SPW_TCH_CFGRESTART register */
#define SPW_TCH_CFGRESTART_PPS_Pos            _UINT32_(14)                                         /* (SPW_TCH_CFGRESTART) Pps Position */
#define SPW_TCH_CFGRESTART_PPS_Msk            (_UINT32_(0x1) << SPW_TCH_CFGRESTART_PPS_Pos)        /* (SPW_TCH_CFGRESTART) Pps Mask */
#define SPW_TCH_CFGRESTART_PPS(value)         (SPW_TCH_CFGRESTART_PPS_Msk & (_UINT32_(value) << SPW_TCH_CFGRESTART_PPS_Pos)) /* Assigment of value for PPS in the SPW_TCH_CFGRESTART register */
#define SPW_TCH_CFGRESTART_ONESHOT_Pos        _UINT32_(15)                                         /* (SPW_TCH_CFGRESTART) One Shot Position */
#define SPW_TCH_CFGRESTART_ONESHOT_Msk        (_UINT32_(0x1) << SPW_TCH_CFGRESTART_ONESHOT_Pos)    /* (SPW_TCH_CFGRESTART) One Shot Mask */
#define SPW_TCH_CFGRESTART_ONESHOT(value)     (SPW_TCH_CFGRESTART_ONESHOT_Msk & (_UINT32_(value) << SPW_TCH_CFGRESTART_ONESHOT_Pos)) /* Assigment of value for ONESHOT in the SPW_TCH_CFGRESTART register */
#define SPW_TCH_CFGRESTART_Msk                _UINT32_(0x0000FF3F)                                 /* (SPW_TCH_CFGRESTART) Register Mask  */


