Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_TCH_CFGTCEVENT : (SPW Offset: 0xEB0) (R/W 32) SpW Tch Config Tc Event -------- */
#define SPW_TCH_CFGTCEVENT_VALUE_Pos          _UINT32_(0)                                          /* (SPW_TCH_CFGTCEVENT) Value Position */
#define SPW_TCH_CFGTCEVENT_VALUE_Msk          (_UINT32_(0x3F) << SPW_TCH_CFGTCEVENT_VALUE_Pos)     /* (SPW_TCH_CFGTCEVENT) Value Mask */
#define SPW_TCH_CFGTCEVENT_VALUE(value)       (SPW_TCH_CFGTCEVENT_VALUE_Msk & (_UINT32_(value) << SPW_TCH_CFGTCEVENT_VALUE_Pos)) /* Assigment of value for VALUE in the SPW_TCH_CFGTCEVENT register */
#define SPW_TCH_CFGTCEVENT_MASK_Pos           _UINT32_(8)                                          /* (SPW_TCH_CFGTCEVENT) Mask Position */
#define SPW_TCH_CFGTCEVENT_MASK_Msk           (_UINT32_(0x3F) << SPW_TCH_CFGTCEVENT_MASK_Pos)      /* (SPW_TCH_CFGTCEVENT) Mask Mask */
#define SPW_TCH_CFGTCEVENT_MASK(value)        (SPW_TCH_CFGTCEVENT_MASK_Msk & (_UINT32_(value) << SPW_TCH_CFGTCEVENT_MASK_Pos)) /* Assigment of value for MASK in the SPW_TCH_CFGTCEVENT register */
#define SPW_TCH_CFGTCEVENT_Msk                _UINT32_(0x00003F3F)                                 /* (SPW_TCH_CFGTCEVENT) Register Mask  */


/* -------- SPW_TCH_CFGWD : (SPW Offset: 0xEB4) (R/W 32) SpW Tch Config Watchdog -------- */
#define SPW_TCH_CFGWD_LATE_Pos                _UINT32_(0)                                          /* (SPW_TCH_CFGWD) Late Position */
#define SPW_TCH_CFGWD_LATE_Msk                (_UINT32_(0xFFFF) << SPW_TCH_CFGWD_LATE_Pos)         /* (SPW_TCH_CFGWD) Late Mask */
#define SPW_TCH_CFGWD_LATE(value)             (SPW_TCH_CFGWD_LATE_Msk & (_UINT32_(value) << SPW_TCH_CFGWD_LATE_Pos)) /* Assigment of value for LATE in the SPW_TCH_CFGWD register */
#define SPW_TCH_CFGWD_EARLY_Pos               _UINT32_(16)                                         /* (SPW_TCH_CFGWD) Early Position */
#define SPW_TCH_CFGWD_EARLY_Msk               (_UINT32_(0xFFFF) << SPW_TCH_CFGWD_EARLY_Pos)        /* (SPW_TCH_CFGWD) Early Mask */
#define SPW_TCH_CFGWD_EARLY(value)            (SPW_TCH_CFGWD_EARLY_Msk & (_UINT32_(value) << SPW_TCH_CFGWD_EARLY_Pos)) /* Assigment of value for EARLY in the SPW_TCH_CFGWD register */
#define SPW_TCH_CFGWD_Msk                     _UINT32_(0xFFFFFFFF)                                 /* (SPW_TCH_CFGWD) Register Mask  */


/* -------- SPW_TCH_LASTTIMECODE : (SPW Offset: 0xEB8) (R/W 32) SpW Tch Last Time Code -------- */
#define SPW_TCH_LASTTIMECODE_VALUE_Pos        _UINT32_(0)                                          /* (SPW_TCH_LASTTIMECODE) Value Position */
#define SPW_TCH_LASTTIMECODE_VALUE_Msk        (_UINT32_(0x3F) << SPW_TCH_LASTTIMECODE_VALUE_Pos)   /* (SPW_TCH_LASTTIMECODE) Value Mask */
#define SPW_TCH_LASTTIMECODE_VALUE(value)     (SPW_TCH_LASTTIMECODE_VALUE_Msk & (_UINT32_(value) << SPW_TCH_LASTTIMECODE_VALUE_Pos)) /* Assigment of value for VALUE in the SPW_TCH_LASTTIMECODE register */
#define SPW_TCH_LASTTIMECODE_SEND_Pos         _UINT32_(8)                                          /* (SPW_TCH_LASTTIMECODE) Send Now Position */
#define SPW_TCH_LASTTIMECODE_SEND_Msk         (_UINT32_(0x1) << SPW_TCH_LASTTIMECODE_SEND_Pos)     /* (SPW_TCH_LASTTIMECODE) Send Now Mask */
#define SPW_TCH_LASTTIMECODE_SEND(value)      (SPW_TCH_LASTTIMECODE_SEND_Msk & (_UINT32_(value) << SPW_TCH_LASTTIMECODE_SEND_Pos)) /* Assigment of value for SEND in the SPW_TCH_LASTTIMECODE register */
#define SPW_TCH_LASTTIMECODE_Msk              _UINT32_(0x0000013F)                                 /* (SPW_TCH_LASTTIMECODE) Register Mask  */


/* -------- SPW_TCH_SWRESET : (SPW Offset: 0xEBC) (R/W 32) SpW Tch Software Reset -------- */
#define SPW_TCH_SWRESET_PATTERN_Pos           _UINT32_(0)                                          /* (SPW_TCH_SWRESET) Pattern Position */
#define SPW_TCH_SWRESET_PATTERN_Msk           (_UINT32_(0xFFFFFFFF) << SPW_TCH_SWRESET_PATTERN_Pos) /* (SPW_TCH_SWRESET) Pattern Mask */
#define SPW_TCH_SWRESET_PATTERN(value)        (SPW_TCH_SWRESET_PATTERN_Msk & (_UINT32_(value) << SPW_TCH_SWRESET_PATTERN_Pos)) /* Assigment of value for PATTERN in the SPW_TCH_SWRESET register */
#define SPW_TCH_SWRESET_Msk                   _UINT32_(0xFFFFFFFF)                                 /* (SPW_TCH_SWRESET) Register Mask  */


/* -------- SPW_GROUP_IRQSTS1 : (SPW Offset: 0xF00) ( R/ 32) SpW Group Interrupt status 1 -------- */
#define SPW_GROUP_IRQSTS1_TX1_Pos             _UINT32_(7)                                          /* (SPW_GROUP_IRQSTS1) Tx 1 Position */
#define SPW_GROUP_IRQSTS1_TX1_Msk             (_UINT32_(0x1) << SPW_GROUP_IRQSTS1_TX1_Pos)         /* (SPW_GROUP_IRQSTS1) Tx 1 Mask */
#define SPW_GROUP_IRQSTS1_TX1(value)          (SPW_GROUP_IRQSTS1_TX1_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS1_TX1_Pos)) /* Assigment of value for TX1 in the SPW_GROUP_IRQSTS1 register */
#define SPW_GROUP_IRQSTS1_RX1_Pos             _UINT32_(15)                                         /* (SPW_GROUP_IRQSTS1) Rx 1 Position */
#define SPW_GROUP_IRQSTS1_RX1_Msk             (_UINT32_(0x1) << SPW_GROUP_IRQSTS1_RX1_Pos)         /* (SPW_GROUP_IRQSTS1) Rx 1 Mask */
#define SPW_GROUP_IRQSTS1_RX1(value)          (SPW_GROUP_IRQSTS1_RX1_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS1_RX1_Pos)) /* Assigment of value for RX1 in the SPW_GROUP_IRQSTS1 register */
#define SPW_GROUP_IRQSTS1_TCH_Pos             _UINT32_(16)                                         /* (SPW_GROUP_IRQSTS1) Time Code Handler Position */
#define SPW_GROUP_IRQSTS1_TCH_Msk             (_UINT32_(0x1) << SPW_GROUP_IRQSTS1_TCH_Pos)         /* (SPW_GROUP_IRQSTS1) Time Code Handler Mask */
#define SPW_GROUP_IRQSTS1_TCH(value)          (SPW_GROUP_IRQSTS1_TCH_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS1_TCH_Pos)) /* Assigment of value for TCH in the SPW_GROUP_IRQSTS1 register */
#define SPW_GROUP_IRQSTS1_Msk                 _UINT32_(0x00018080)                                 /* (SPW_GROUP_IRQSTS1) Register Mask  */

#define SPW_GROUP_IRQSTS1_TX_Pos              _UINT32_(7)                                          /* (SPW_GROUP_IRQSTS1 Position) Tx x */
#define SPW_GROUP_IRQSTS1_TX_Msk              (_UINT32_(0x1) << SPW_GROUP_IRQSTS1_TX_Pos)          /* (SPW_GROUP_IRQSTS1 Mask) TX */
#define SPW_GROUP_IRQSTS1_TX(value)           (SPW_GROUP_IRQSTS1_TX_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS1_TX_Pos)) 
#define SPW_GROUP_IRQSTS1_RX_Pos              _UINT32_(15)                                         /* (SPW_GROUP_IRQSTS1 Position) Rx x */
#define SPW_GROUP_IRQSTS1_RX_Msk              (_UINT32_(0x1) << SPW_GROUP_IRQSTS1_RX_Pos)          /* (SPW_GROUP_IRQSTS1 Mask) RX */
#define SPW_GROUP_IRQSTS1_RX(value)           (SPW_GROUP_IRQSTS1_RX_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS1_RX_Pos)) 

/* -------- SPW_GROUP_IRQSTS2 : (SPW Offset: 0xF04) ( R/ 32) SpW Group Interrupt status 2 -------- */
#define SPW_GROUP_IRQSTS2_Link2_Pos           _UINT32_(18)                                         /* (SPW_GROUP_IRQSTS2) Link 2 Position */
#define SPW_GROUP_IRQSTS2_Link2_Msk           (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Link2_Pos)       /* (SPW_GROUP_IRQSTS2) Link 2 Mask */
#define SPW_GROUP_IRQSTS2_Link2(value)        (SPW_GROUP_IRQSTS2_Link2_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Link2_Pos)) /* Assigment of value for Link2 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Dia2_Pos            _UINT32_(19)                                         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt Acknowledge, Link 2 Position */
#define SPW_GROUP_IRQSTS2_Dia2_Msk            (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Dia2_Pos)        /* (SPW_GROUP_IRQSTS2) Distributed Interrupt Acknowledge, Link 2 Mask */
#define SPW_GROUP_IRQSTS2_Dia2(value)         (SPW_GROUP_IRQSTS2_Dia2_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Dia2_Pos)) /* Assigment of value for Dia2 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Di2_Pos             _UINT32_(20)                                         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt 2 Position */
#define SPW_GROUP_IRQSTS2_Di2_Msk             (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Di2_Pos)         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt 2 Mask */
#define SPW_GROUP_IRQSTS2_Di2(value)          (SPW_GROUP_IRQSTS2_Di2_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Di2_Pos)) /* Assigment of value for Di2 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Link1_Pos           _UINT32_(21)                                         /* (SPW_GROUP_IRQSTS2) Link 1 Position */
#define SPW_GROUP_IRQSTS2_Link1_Msk           (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Link1_Pos)       /* (SPW_GROUP_IRQSTS2) Link 1 Mask */
#define SPW_GROUP_IRQSTS2_Link1(value)        (SPW_GROUP_IRQSTS2_Link1_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Link1_Pos)) /* Assigment of value for Link1 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Dia1_Pos            _UINT32_(22)                                         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt Acknowledge, Link 1 Position */
#define SPW_GROUP_IRQSTS2_Dia1_Msk            (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Dia1_Pos)        /* (SPW_GROUP_IRQSTS2) Distributed Interrupt Acknowledge, Link 1 Mask */
#define SPW_GROUP_IRQSTS2_Dia1(value)         (SPW_GROUP_IRQSTS2_Dia1_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Dia1_Pos)) /* Assigment of value for Dia1 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Di1_Pos             _UINT32_(23)                                         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt 1 Position */
#define SPW_GROUP_IRQSTS2_Di1_Msk             (_UINT32_(0x1) << SPW_GROUP_IRQSTS2_Di1_Pos)         /* (SPW_GROUP_IRQSTS2) Distributed Interrupt 1 Mask */
#define SPW_GROUP_IRQSTS2_Di1(value)          (SPW_GROUP_IRQSTS2_Di1_Msk & (_UINT32_(value) << SPW_GROUP_IRQSTS2_Di1_Pos)) /* Assigment of value for Di1 in the SPW_GROUP_IRQSTS2 register */
#define SPW_GROUP_IRQSTS2_Msk                 _UINT32_(0x00FC0000)                                 /* (SPW_GROUP_IRQSTS2) Register Mask  */


