Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
/* -------- SPW_GROUP_EDACSTS : (SPW Offset: 0xF0C) ( R/ 32) SpW Group Interrupt status -------- */
#define SPW_GROUP_EDACSTS_CORR_Pos            _UINT32_(0)                                          /* (SPW_GROUP_EDACSTS) Correction Count Position */
#define SPW_GROUP_EDACSTS_CORR_Msk            (_UINT32_(0xFF) << SPW_GROUP_EDACSTS_CORR_Pos)       /* (SPW_GROUP_EDACSTS) Correction Count Mask */
#define SPW_GROUP_EDACSTS_CORR(value)         (SPW_GROUP_EDACSTS_CORR_Msk & (_UINT32_(value) << SPW_GROUP_EDACSTS_CORR_Pos)) /* Assigment of value for CORR in the SPW_GROUP_EDACSTS register */
#define SPW_GROUP_EDACSTS_UNCORR_Pos          _UINT32_(8)                                          /* (SPW_GROUP_EDACSTS) Uncorrectable Error Position */
#define SPW_GROUP_EDACSTS_UNCORR_Msk          (_UINT32_(0xFF) << SPW_GROUP_EDACSTS_UNCORR_Pos)     /* (SPW_GROUP_EDACSTS) Uncorrectable Error Mask */
#define SPW_GROUP_EDACSTS_UNCORR(value)       (SPW_GROUP_EDACSTS_UNCORR_Msk & (_UINT32_(value) << SPW_GROUP_EDACSTS_UNCORR_Pos)) /* Assigment of value for UNCORR in the SPW_GROUP_EDACSTS register */
#define SPW_GROUP_EDACSTS_Msk                 _UINT32_(0x0000FFFF)                                 /* (SPW_GROUP_EDACSTS) Register Mask  */


/** \brief SPW register offsets definitions */
#define SPW_ROUTER_STS_REG_OFST        _UINT32_(0x00)      /* (SPW_ROUTER_STS) SpW Router Status Offset */
#define SPW_ROUTER_CFG_REG_OFST        _UINT32_(0x04)      /* (SPW_ROUTER_CFG) SpW Router Config Offset */
#define SPW_ROUTER_TIMEOUT_REG_OFST    _UINT32_(0x08)      /* (SPW_ROUTER_TIMEOUT) SpW Router Timeout Offset */
#define SPW_ROUTER_TABLE_REG_OFST      _UINT32_(0x80)      /* (SPW_ROUTER_TABLE) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE0_REG_OFST     _UINT32_(0x80)      /* (SPW_ROUTER_TABLE0) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE1_REG_OFST     _UINT32_(0x84)      /* (SPW_ROUTER_TABLE1) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE2_REG_OFST     _UINT32_(0x88)      /* (SPW_ROUTER_TABLE2) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE3_REG_OFST     _UINT32_(0x8C)      /* (SPW_ROUTER_TABLE3) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE4_REG_OFST     _UINT32_(0x90)      /* (SPW_ROUTER_TABLE4) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE5_REG_OFST     _UINT32_(0x94)      /* (SPW_ROUTER_TABLE5) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE6_REG_OFST     _UINT32_(0x98)      /* (SPW_ROUTER_TABLE6) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE7_REG_OFST     _UINT32_(0x9C)      /* (SPW_ROUTER_TABLE7) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE8_REG_OFST     _UINT32_(0xA0)      /* (SPW_ROUTER_TABLE8) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE9_REG_OFST     _UINT32_(0xA4)      /* (SPW_ROUTER_TABLE9) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE10_REG_OFST    _UINT32_(0xA8)      /* (SPW_ROUTER_TABLE10) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE11_REG_OFST    _UINT32_(0xAC)      /* (SPW_ROUTER_TABLE11) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE12_REG_OFST    _UINT32_(0xB0)      /* (SPW_ROUTER_TABLE12) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE13_REG_OFST    _UINT32_(0xB4)      /* (SPW_ROUTER_TABLE13) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE14_REG_OFST    _UINT32_(0xB8)      /* (SPW_ROUTER_TABLE14) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE15_REG_OFST    _UINT32_(0xBC)      /* (SPW_ROUTER_TABLE15) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE16_REG_OFST    _UINT32_(0xC0)      /* (SPW_ROUTER_TABLE16) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE17_REG_OFST    _UINT32_(0xC4)      /* (SPW_ROUTER_TABLE17) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE18_REG_OFST    _UINT32_(0xC8)      /* (SPW_ROUTER_TABLE18) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE19_REG_OFST    _UINT32_(0xCC)      /* (SPW_ROUTER_TABLE19) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE20_REG_OFST    _UINT32_(0xD0)      /* (SPW_ROUTER_TABLE20) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE21_REG_OFST    _UINT32_(0xD4)      /* (SPW_ROUTER_TABLE21) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE22_REG_OFST    _UINT32_(0xD8)      /* (SPW_ROUTER_TABLE22) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE23_REG_OFST    _UINT32_(0xDC)      /* (SPW_ROUTER_TABLE23) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE24_REG_OFST    _UINT32_(0xE0)      /* (SPW_ROUTER_TABLE24) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE25_REG_OFST    _UINT32_(0xE4)      /* (SPW_ROUTER_TABLE25) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE26_REG_OFST    _UINT32_(0xE8)      /* (SPW_ROUTER_TABLE26) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE27_REG_OFST    _UINT32_(0xEC)      /* (SPW_ROUTER_TABLE27) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE28_REG_OFST    _UINT32_(0xF0)      /* (SPW_ROUTER_TABLE28) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE29_REG_OFST    _UINT32_(0xF4)      /* (SPW_ROUTER_TABLE29) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE30_REG_OFST    _UINT32_(0xF8)      /* (SPW_ROUTER_TABLE30) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE31_REG_OFST    _UINT32_(0xFC)      /* (SPW_ROUTER_TABLE31) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE32_REG_OFST    _UINT32_(0x100)     /* (SPW_ROUTER_TABLE32) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE33_REG_OFST    _UINT32_(0x104)     /* (SPW_ROUTER_TABLE33) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE34_REG_OFST    _UINT32_(0x108)     /* (SPW_ROUTER_TABLE34) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE35_REG_OFST    _UINT32_(0x10C)     /* (SPW_ROUTER_TABLE35) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE36_REG_OFST    _UINT32_(0x110)     /* (SPW_ROUTER_TABLE36) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE37_REG_OFST    _UINT32_(0x114)     /* (SPW_ROUTER_TABLE37) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE38_REG_OFST    _UINT32_(0x118)     /* (SPW_ROUTER_TABLE38) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE39_REG_OFST    _UINT32_(0x11C)     /* (SPW_ROUTER_TABLE39) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE40_REG_OFST    _UINT32_(0x120)     /* (SPW_ROUTER_TABLE40) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE41_REG_OFST    _UINT32_(0x124)     /* (SPW_ROUTER_TABLE41) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE42_REG_OFST    _UINT32_(0x128)     /* (SPW_ROUTER_TABLE42) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE43_REG_OFST    _UINT32_(0x12C)     /* (SPW_ROUTER_TABLE43) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE44_REG_OFST    _UINT32_(0x130)     /* (SPW_ROUTER_TABLE44) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE45_REG_OFST    _UINT32_(0x134)     /* (SPW_ROUTER_TABLE45) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE46_REG_OFST    _UINT32_(0x138)     /* (SPW_ROUTER_TABLE46) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE47_REG_OFST    _UINT32_(0x13C)     /* (SPW_ROUTER_TABLE47) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE48_REG_OFST    _UINT32_(0x140)     /* (SPW_ROUTER_TABLE48) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE49_REG_OFST    _UINT32_(0x144)     /* (SPW_ROUTER_TABLE49) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE50_REG_OFST    _UINT32_(0x148)     /* (SPW_ROUTER_TABLE50) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE51_REG_OFST    _UINT32_(0x14C)     /* (SPW_ROUTER_TABLE51) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE52_REG_OFST    _UINT32_(0x150)     /* (SPW_ROUTER_TABLE52) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE53_REG_OFST    _UINT32_(0x154)     /* (SPW_ROUTER_TABLE53) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE54_REG_OFST    _UINT32_(0x158)     /* (SPW_ROUTER_TABLE54) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE55_REG_OFST    _UINT32_(0x15C)     /* (SPW_ROUTER_TABLE55) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE56_REG_OFST    _UINT32_(0x160)     /* (SPW_ROUTER_TABLE56) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE57_REG_OFST    _UINT32_(0x164)     /* (SPW_ROUTER_TABLE57) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE58_REG_OFST    _UINT32_(0x168)     /* (SPW_ROUTER_TABLE58) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE59_REG_OFST    _UINT32_(0x16C)     /* (SPW_ROUTER_TABLE59) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE60_REG_OFST    _UINT32_(0x170)     /* (SPW_ROUTER_TABLE60) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE61_REG_OFST    _UINT32_(0x174)     /* (SPW_ROUTER_TABLE61) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE62_REG_OFST    _UINT32_(0x178)     /* (SPW_ROUTER_TABLE62) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE63_REG_OFST    _UINT32_(0x17C)     /* (SPW_ROUTER_TABLE63) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE64_REG_OFST    _UINT32_(0x180)     /* (SPW_ROUTER_TABLE64) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE65_REG_OFST    _UINT32_(0x184)     /* (SPW_ROUTER_TABLE65) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE66_REG_OFST    _UINT32_(0x188)     /* (SPW_ROUTER_TABLE66) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE67_REG_OFST    _UINT32_(0x18C)     /* (SPW_ROUTER_TABLE67) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE68_REG_OFST    _UINT32_(0x190)     /* (SPW_ROUTER_TABLE68) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE69_REG_OFST    _UINT32_(0x194)     /* (SPW_ROUTER_TABLE69) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE70_REG_OFST    _UINT32_(0x198)     /* (SPW_ROUTER_TABLE70) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE71_REG_OFST    _UINT32_(0x19C)     /* (SPW_ROUTER_TABLE71) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE72_REG_OFST    _UINT32_(0x1A0)     /* (SPW_ROUTER_TABLE72) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE73_REG_OFST    _UINT32_(0x1A4)     /* (SPW_ROUTER_TABLE73) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE74_REG_OFST    _UINT32_(0x1A8)     /* (SPW_ROUTER_TABLE74) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE75_REG_OFST    _UINT32_(0x1AC)     /* (SPW_ROUTER_TABLE75) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE76_REG_OFST    _UINT32_(0x1B0)     /* (SPW_ROUTER_TABLE76) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE77_REG_OFST    _UINT32_(0x1B4)     /* (SPW_ROUTER_TABLE77) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE78_REG_OFST    _UINT32_(0x1B8)     /* (SPW_ROUTER_TABLE78) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE79_REG_OFST    _UINT32_(0x1BC)     /* (SPW_ROUTER_TABLE79) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE80_REG_OFST    _UINT32_(0x1C0)     /* (SPW_ROUTER_TABLE80) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE81_REG_OFST    _UINT32_(0x1C4)     /* (SPW_ROUTER_TABLE81) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE82_REG_OFST    _UINT32_(0x1C8)     /* (SPW_ROUTER_TABLE82) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE83_REG_OFST    _UINT32_(0x1CC)     /* (SPW_ROUTER_TABLE83) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE84_REG_OFST    _UINT32_(0x1D0)     /* (SPW_ROUTER_TABLE84) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE85_REG_OFST    _UINT32_(0x1D4)     /* (SPW_ROUTER_TABLE85) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE86_REG_OFST    _UINT32_(0x1D8)     /* (SPW_ROUTER_TABLE86) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE87_REG_OFST    _UINT32_(0x1DC)     /* (SPW_ROUTER_TABLE87) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE88_REG_OFST    _UINT32_(0x1E0)     /* (SPW_ROUTER_TABLE88) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE89_REG_OFST    _UINT32_(0x1E4)     /* (SPW_ROUTER_TABLE89) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE90_REG_OFST    _UINT32_(0x1E8)     /* (SPW_ROUTER_TABLE90) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE91_REG_OFST    _UINT32_(0x1EC)     /* (SPW_ROUTER_TABLE91) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE92_REG_OFST    _UINT32_(0x1F0)     /* (SPW_ROUTER_TABLE92) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE93_REG_OFST    _UINT32_(0x1F4)     /* (SPW_ROUTER_TABLE93) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE94_REG_OFST    _UINT32_(0x1F8)     /* (SPW_ROUTER_TABLE94) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE95_REG_OFST    _UINT32_(0x1FC)     /* (SPW_ROUTER_TABLE95) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE96_REG_OFST    _UINT32_(0x200)     /* (SPW_ROUTER_TABLE96) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE97_REG_OFST    _UINT32_(0x204)     /* (SPW_ROUTER_TABLE97) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE98_REG_OFST    _UINT32_(0x208)     /* (SPW_ROUTER_TABLE98) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE99_REG_OFST    _UINT32_(0x20C)     /* (SPW_ROUTER_TABLE99) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE100_REG_OFST   _UINT32_(0x210)     /* (SPW_ROUTER_TABLE100) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE101_REG_OFST   _UINT32_(0x214)     /* (SPW_ROUTER_TABLE101) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE102_REG_OFST   _UINT32_(0x218)     /* (SPW_ROUTER_TABLE102) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE103_REG_OFST   _UINT32_(0x21C)     /* (SPW_ROUTER_TABLE103) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE104_REG_OFST   _UINT32_(0x220)     /* (SPW_ROUTER_TABLE104) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE105_REG_OFST   _UINT32_(0x224)     /* (SPW_ROUTER_TABLE105) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE106_REG_OFST   _UINT32_(0x228)     /* (SPW_ROUTER_TABLE106) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE107_REG_OFST   _UINT32_(0x22C)     /* (SPW_ROUTER_TABLE107) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE108_REG_OFST   _UINT32_(0x230)     /* (SPW_ROUTER_TABLE108) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE109_REG_OFST   _UINT32_(0x234)     /* (SPW_ROUTER_TABLE109) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE110_REG_OFST   _UINT32_(0x238)     /* (SPW_ROUTER_TABLE110) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE111_REG_OFST   _UINT32_(0x23C)     /* (SPW_ROUTER_TABLE111) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE112_REG_OFST   _UINT32_(0x240)     /* (SPW_ROUTER_TABLE112) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE113_REG_OFST   _UINT32_(0x244)     /* (SPW_ROUTER_TABLE113) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE114_REG_OFST   _UINT32_(0x248)     /* (SPW_ROUTER_TABLE114) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE115_REG_OFST   _UINT32_(0x24C)     /* (SPW_ROUTER_TABLE115) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE116_REG_OFST   _UINT32_(0x250)     /* (SPW_ROUTER_TABLE116) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE117_REG_OFST   _UINT32_(0x254)     /* (SPW_ROUTER_TABLE117) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE118_REG_OFST   _UINT32_(0x258)     /* (SPW_ROUTER_TABLE118) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE119_REG_OFST   _UINT32_(0x25C)     /* (SPW_ROUTER_TABLE119) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE120_REG_OFST   _UINT32_(0x260)     /* (SPW_ROUTER_TABLE120) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE121_REG_OFST   _UINT32_(0x264)     /* (SPW_ROUTER_TABLE121) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE122_REG_OFST   _UINT32_(0x268)     /* (SPW_ROUTER_TABLE122) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE123_REG_OFST   _UINT32_(0x26C)     /* (SPW_ROUTER_TABLE123) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE124_REG_OFST   _UINT32_(0x270)     /* (SPW_ROUTER_TABLE124) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE125_REG_OFST   _UINT32_(0x274)     /* (SPW_ROUTER_TABLE125) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE126_REG_OFST   _UINT32_(0x278)     /* (SPW_ROUTER_TABLE126) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE127_REG_OFST   _UINT32_(0x27C)     /* (SPW_ROUTER_TABLE127) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
