Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#define SPW_ROUTER_TABLE128_REG_OFST   _UINT32_(0x280)     /* (SPW_ROUTER_TABLE128) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE129_REG_OFST   _UINT32_(0x284)     /* (SPW_ROUTER_TABLE129) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE130_REG_OFST   _UINT32_(0x288)     /* (SPW_ROUTER_TABLE130) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE131_REG_OFST   _UINT32_(0x28C)     /* (SPW_ROUTER_TABLE131) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE132_REG_OFST   _UINT32_(0x290)     /* (SPW_ROUTER_TABLE132) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE133_REG_OFST   _UINT32_(0x294)     /* (SPW_ROUTER_TABLE133) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE134_REG_OFST   _UINT32_(0x298)     /* (SPW_ROUTER_TABLE134) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE135_REG_OFST   _UINT32_(0x29C)     /* (SPW_ROUTER_TABLE135) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE136_REG_OFST   _UINT32_(0x2A0)     /* (SPW_ROUTER_TABLE136) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE137_REG_OFST   _UINT32_(0x2A4)     /* (SPW_ROUTER_TABLE137) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE138_REG_OFST   _UINT32_(0x2A8)     /* (SPW_ROUTER_TABLE138) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE139_REG_OFST   _UINT32_(0x2AC)     /* (SPW_ROUTER_TABLE139) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE140_REG_OFST   _UINT32_(0x2B0)     /* (SPW_ROUTER_TABLE140) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE141_REG_OFST   _UINT32_(0x2B4)     /* (SPW_ROUTER_TABLE141) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE142_REG_OFST   _UINT32_(0x2B8)     /* (SPW_ROUTER_TABLE142) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE143_REG_OFST   _UINT32_(0x2BC)     /* (SPW_ROUTER_TABLE143) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE144_REG_OFST   _UINT32_(0x2C0)     /* (SPW_ROUTER_TABLE144) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE145_REG_OFST   _UINT32_(0x2C4)     /* (SPW_ROUTER_TABLE145) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE146_REG_OFST   _UINT32_(0x2C8)     /* (SPW_ROUTER_TABLE146) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE147_REG_OFST   _UINT32_(0x2CC)     /* (SPW_ROUTER_TABLE147) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE148_REG_OFST   _UINT32_(0x2D0)     /* (SPW_ROUTER_TABLE148) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE149_REG_OFST   _UINT32_(0x2D4)     /* (SPW_ROUTER_TABLE149) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE150_REG_OFST   _UINT32_(0x2D8)     /* (SPW_ROUTER_TABLE150) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE151_REG_OFST   _UINT32_(0x2DC)     /* (SPW_ROUTER_TABLE151) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE152_REG_OFST   _UINT32_(0x2E0)     /* (SPW_ROUTER_TABLE152) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE153_REG_OFST   _UINT32_(0x2E4)     /* (SPW_ROUTER_TABLE153) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE154_REG_OFST   _UINT32_(0x2E8)     /* (SPW_ROUTER_TABLE154) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE155_REG_OFST   _UINT32_(0x2EC)     /* (SPW_ROUTER_TABLE155) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE156_REG_OFST   _UINT32_(0x2F0)     /* (SPW_ROUTER_TABLE156) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE157_REG_OFST   _UINT32_(0x2F4)     /* (SPW_ROUTER_TABLE157) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE158_REG_OFST   _UINT32_(0x2F8)     /* (SPW_ROUTER_TABLE158) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE159_REG_OFST   _UINT32_(0x2FC)     /* (SPW_ROUTER_TABLE159) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE160_REG_OFST   _UINT32_(0x300)     /* (SPW_ROUTER_TABLE160) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE161_REG_OFST   _UINT32_(0x304)     /* (SPW_ROUTER_TABLE161) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE162_REG_OFST   _UINT32_(0x308)     /* (SPW_ROUTER_TABLE162) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE163_REG_OFST   _UINT32_(0x30C)     /* (SPW_ROUTER_TABLE163) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE164_REG_OFST   _UINT32_(0x310)     /* (SPW_ROUTER_TABLE164) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE165_REG_OFST   _UINT32_(0x314)     /* (SPW_ROUTER_TABLE165) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE166_REG_OFST   _UINT32_(0x318)     /* (SPW_ROUTER_TABLE166) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE167_REG_OFST   _UINT32_(0x31C)     /* (SPW_ROUTER_TABLE167) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE168_REG_OFST   _UINT32_(0x320)     /* (SPW_ROUTER_TABLE168) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE169_REG_OFST   _UINT32_(0x324)     /* (SPW_ROUTER_TABLE169) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE170_REG_OFST   _UINT32_(0x328)     /* (SPW_ROUTER_TABLE170) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE171_REG_OFST   _UINT32_(0x32C)     /* (SPW_ROUTER_TABLE171) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE172_REG_OFST   _UINT32_(0x330)     /* (SPW_ROUTER_TABLE172) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE173_REG_OFST   _UINT32_(0x334)     /* (SPW_ROUTER_TABLE173) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE174_REG_OFST   _UINT32_(0x338)     /* (SPW_ROUTER_TABLE174) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE175_REG_OFST   _UINT32_(0x33C)     /* (SPW_ROUTER_TABLE175) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE176_REG_OFST   _UINT32_(0x340)     /* (SPW_ROUTER_TABLE176) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE177_REG_OFST   _UINT32_(0x344)     /* (SPW_ROUTER_TABLE177) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE178_REG_OFST   _UINT32_(0x348)     /* (SPW_ROUTER_TABLE178) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE179_REG_OFST   _UINT32_(0x34C)     /* (SPW_ROUTER_TABLE179) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE180_REG_OFST   _UINT32_(0x350)     /* (SPW_ROUTER_TABLE180) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE181_REG_OFST   _UINT32_(0x354)     /* (SPW_ROUTER_TABLE181) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE182_REG_OFST   _UINT32_(0x358)     /* (SPW_ROUTER_TABLE182) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE183_REG_OFST   _UINT32_(0x35C)     /* (SPW_ROUTER_TABLE183) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE184_REG_OFST   _UINT32_(0x360)     /* (SPW_ROUTER_TABLE184) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE185_REG_OFST   _UINT32_(0x364)     /* (SPW_ROUTER_TABLE185) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE186_REG_OFST   _UINT32_(0x368)     /* (SPW_ROUTER_TABLE186) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE187_REG_OFST   _UINT32_(0x36C)     /* (SPW_ROUTER_TABLE187) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE188_REG_OFST   _UINT32_(0x370)     /* (SPW_ROUTER_TABLE188) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE189_REG_OFST   _UINT32_(0x374)     /* (SPW_ROUTER_TABLE189) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE190_REG_OFST   _UINT32_(0x378)     /* (SPW_ROUTER_TABLE190) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE191_REG_OFST   _UINT32_(0x37C)     /* (SPW_ROUTER_TABLE191) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE192_REG_OFST   _UINT32_(0x380)     /* (SPW_ROUTER_TABLE192) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE193_REG_OFST   _UINT32_(0x384)     /* (SPW_ROUTER_TABLE193) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE194_REG_OFST   _UINT32_(0x388)     /* (SPW_ROUTER_TABLE194) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE195_REG_OFST   _UINT32_(0x38C)     /* (SPW_ROUTER_TABLE195) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE196_REG_OFST   _UINT32_(0x390)     /* (SPW_ROUTER_TABLE196) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE197_REG_OFST   _UINT32_(0x394)     /* (SPW_ROUTER_TABLE197) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE198_REG_OFST   _UINT32_(0x398)     /* (SPW_ROUTER_TABLE198) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE199_REG_OFST   _UINT32_(0x39C)     /* (SPW_ROUTER_TABLE199) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE200_REG_OFST   _UINT32_(0x3A0)     /* (SPW_ROUTER_TABLE200) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE201_REG_OFST   _UINT32_(0x3A4)     /* (SPW_ROUTER_TABLE201) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE202_REG_OFST   _UINT32_(0x3A8)     /* (SPW_ROUTER_TABLE202) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE203_REG_OFST   _UINT32_(0x3AC)     /* (SPW_ROUTER_TABLE203) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE204_REG_OFST   _UINT32_(0x3B0)     /* (SPW_ROUTER_TABLE204) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE205_REG_OFST   _UINT32_(0x3B4)     /* (SPW_ROUTER_TABLE205) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE206_REG_OFST   _UINT32_(0x3B8)     /* (SPW_ROUTER_TABLE206) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE207_REG_OFST   _UINT32_(0x3BC)     /* (SPW_ROUTER_TABLE207) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE208_REG_OFST   _UINT32_(0x3C0)     /* (SPW_ROUTER_TABLE208) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE209_REG_OFST   _UINT32_(0x3C4)     /* (SPW_ROUTER_TABLE209) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE210_REG_OFST   _UINT32_(0x3C8)     /* (SPW_ROUTER_TABLE210) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE211_REG_OFST   _UINT32_(0x3CC)     /* (SPW_ROUTER_TABLE211) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE212_REG_OFST   _UINT32_(0x3D0)     /* (SPW_ROUTER_TABLE212) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE213_REG_OFST   _UINT32_(0x3D4)     /* (SPW_ROUTER_TABLE213) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE214_REG_OFST   _UINT32_(0x3D8)     /* (SPW_ROUTER_TABLE214) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE215_REG_OFST   _UINT32_(0x3DC)     /* (SPW_ROUTER_TABLE215) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE216_REG_OFST   _UINT32_(0x3E0)     /* (SPW_ROUTER_TABLE216) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE217_REG_OFST   _UINT32_(0x3E4)     /* (SPW_ROUTER_TABLE217) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE218_REG_OFST   _UINT32_(0x3E8)     /* (SPW_ROUTER_TABLE218) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE219_REG_OFST   _UINT32_(0x3EC)     /* (SPW_ROUTER_TABLE219) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE220_REG_OFST   _UINT32_(0x3F0)     /* (SPW_ROUTER_TABLE220) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE221_REG_OFST   _UINT32_(0x3F4)     /* (SPW_ROUTER_TABLE221) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE222_REG_OFST   _UINT32_(0x3F8)     /* (SPW_ROUTER_TABLE222) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_ROUTER_TABLE223_REG_OFST   _UINT32_(0x3FC)     /* (SPW_ROUTER_TABLE223) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) Offset */
#define SPW_LINK1_PI_RM_REG_OFST       _UINT32_(0x400)     /* (SPW_LINK1_PI_RM) SpW Link 1 Pending Read Masked Interrupt Offset */
#define SPW_LINK1_PI_R_REG_OFST        _UINT32_(0x408)     /* (SPW_LINK1_PI_R) SpW Link 1 Pending Read Interrupt Offset */
#define SPW_LINK1_PI_RCS_REG_OFST      _UINT32_(0x40C)     /* (SPW_LINK1_PI_RCS) SpW Link 1 Pending Read, Clear and Enabed Interrupt Offset */
#define SPW_LINK1_IM_REG_OFST          _UINT32_(0x410)     /* (SPW_LINK1_IM) SpW Link 1 Interrupt Mask Offset */
#define SPW_LINK1_PI_C_REG_OFST        _UINT32_(0x414)     /* (SPW_LINK1_PI_C) SpW Link 1 Clear Pending Interrupt Offset */
#define SPW_LINK1_IM_S_REG_OFST        _UINT32_(0x418)     /* (SPW_LINK1_IM_S) SpW Link 1 Interrupt Set Mask Offset */
#define SPW_LINK1_IM_C_REG_OFST        _UINT32_(0x41C)     /* (SPW_LINK1_IM_C) SpW Link 1 Interrupt Clear Mask Offset */
#define SPW_LINK1_CFG_REG_OFST         _UINT32_(0x420)     /* (SPW_LINK1_CFG) SpW Link 1 Config Offset */
#define SPW_LINK1_CLKDIV_REG_OFST      _UINT32_(0x424)     /* (SPW_LINK1_CLKDIV) SpW Link 1 Clock Division Offset */
#define SPW_LINK1_STATUS_REG_OFST      _UINT32_(0x428)     /* (SPW_LINK1_STATUS) SpW Link 1 Status Offset */
#define SPW_LINK1_SWRESET_REG_OFST     _UINT32_(0x42C)     /* (SPW_LINK1_SWRESET) SpW Link 1 Software Reset Offset */
#define SPW_LINK1_ESCCHAREVENT_REG_OFST _UINT32_(0x430)     /* (SPW_LINK1_ESCCHAREVENT) SpW Link 1 Escape Character Event Offset */
#define SPW_LINK1_ESCCHAREVENT0_REG_OFST _UINT32_(0x430)     /* (SPW_LINK1_ESCCHAREVENT0) SpW Link 1 Escape Character Event Offset */
#define SPW_LINK1_ESCCHAREVENT1_REG_OFST _UINT32_(0x434)     /* (SPW_LINK1_ESCCHAREVENT1) SpW Link 1 Escape Character Event Offset */
#define SPW_LINK1_ESCCHARSTS_REG_OFST  _UINT32_(0x438)     /* (SPW_LINK1_ESCCHARSTS) SpW Link 1 Escape Character Status Offset */
#define SPW_LINK1_TRANSESC_REG_OFST    _UINT32_(0x43C)     /* (SPW_LINK1_TRANSESC) SpW Link 1 Transmit Escape Character Offset */
#define SPW_LINK1_DISTINTPI_RM_REG_OFST _UINT32_(0x440)     /* (SPW_LINK1_DISTINTPI_RM) SpW Link 1 Distributed Interrupt Pending Read Masked Interrupt Offset */
#define SPW_LINK1_DISTINTPI_RCM_REG_OFST _UINT32_(0x444)     /* (SPW_LINK1_DISTINTPI_RCM) SpW Link 1 Distributed Interrupt Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK1_DISTINTPI_R_REG_OFST _UINT32_(0x448)     /* (SPW_LINK1_DISTINTPI_R) SpW Link 1 Distributed Interrupt Pending Read Interrupt Offset */
#define SPW_LINK1_DISTINTPI_RCS_REG_OFST _UINT32_(0x44C)     /* (SPW_LINK1_DISTINTPI_RCS) SpW Link 1 Distributed Interrupt Pending Read and Clear Interrupt Offset */
#define SPW_LINK1_DISTINTIM_REG_OFST   _UINT32_(0x450)     /* (SPW_LINK1_DISTINTIM) SpW Link 1 Distributed Interrupt Mask Offset */
#define SPW_LINK1_DISTINTPI_C_REG_OFST _UINT32_(0x454)     /* (SPW_LINK1_DISTINTPI_C) SpW Link 1 Distributed Interrupt Clear Pending Interrupt Offset */
#define SPW_LINK1_DISTINTIM_S_REG_OFST _UINT32_(0x458)     /* (SPW_LINK1_DISTINTIM_S) SpW Link 1 Distributed Interrupt Set Mask Offset */
#define SPW_LINK1_DISTINTIM_C_REG_OFST _UINT32_(0x45C)     /* (SPW_LINK1_DISTINTIM_C) SpW Link 1 Distributed Interrupt Clear Mask Offset */
#define SPW_LINK1_DISTACKPI_RM_REG_OFST _UINT32_(0x460)     /* (SPW_LINK1_DISTACKPI_RM) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Masked Interrupt Offset */
#define SPW_LINK1_DISTACKPI_RCM_REG_OFST _UINT32_(0x464)     /* (SPW_LINK1_DISTACKPI_RCM) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK1_DISTACKPI_R_REG_OFST _UINT32_(0x468)     /* (SPW_LINK1_DISTACKPI_R) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Interrupt Offset */
#define SPW_LINK1_DISTACKPI_RCS_REG_OFST _UINT32_(0x46C)     /* (SPW_LINK1_DISTACKPI_RCS) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt Offset */
#define SPW_LINK1_DISTACKIM_REG_OFST   _UINT32_(0x470)     /* (SPW_LINK1_DISTACKIM) SpW Link 1 Distributed Interrupt Acknowledge Mask Offset */
#define SPW_LINK1_DISTACKPI_C_REG_OFST _UINT32_(0x474)     /* (SPW_LINK1_DISTACKPI_C) SpW Link 1 Distributed Interrupt Acknowledge Clear Pending Interrupt Offset */
#define SPW_LINK1_DISTACKIM_S_REG_OFST _UINT32_(0x478)     /* (SPW_LINK1_DISTACKIM_S) SpW Link 1 Distributed Interrupt Acknowledge Set Mask Offset */
#define SPW_LINK1_DISTACKIM_C_REG_OFST _UINT32_(0x47C)     /* (SPW_LINK1_DISTACKIM_C) SpW Link 1 Distributed Interrupt Acknowledge Clear Mask Offset */
#define SPW_LINK2_PI_RM_REG_OFST       _UINT32_(0x480)     /* (SPW_LINK2_PI_RM) SpW Link 2 Pending Read Masked Interrupt Offset */
#define SPW_LINK2_PI_R_REG_OFST        _UINT32_(0x488)     /* (SPW_LINK2_PI_R) SpW Link 2 Pending Read Interrupt Offset */
#define SPW_LINK2_PI_RCS_REG_OFST      _UINT32_(0x48C)     /* (SPW_LINK2_PI_RCS) SpW Link 2 Pending Read, Clear and Enabled Interrupt Offset */
#define SPW_LINK2_IM_REG_OFST          _UINT32_(0x490)     /* (SPW_LINK2_IM) SpW Link 2 Interrupt Mask Offset */
#define SPW_LINK2_PI_C_REG_OFST        _UINT32_(0x494)     /* (SPW_LINK2_PI_C) SpW Link 2 Clear Pending Interrupt Offset */
#define SPW_LINK2_IM_S_REG_OFST        _UINT32_(0x498)     /* (SPW_LINK2_IM_S) SpW Link 2 Interrupt Set Mask Offset */
#define SPW_LINK2_IM_C_REG_OFST        _UINT32_(0x49C)     /* (SPW_LINK2_IM_C) SpW Link 2 Interrupt Clear Mask Offset */
#define SPW_LINK2_CFG_REG_OFST         _UINT32_(0x4A0)     /* (SPW_LINK2_CFG) SpW Link 2 Config Offset */
#define SPW_LINK2_CLKDIV_REG_OFST      _UINT32_(0x4A4)     /* (SPW_LINK2_CLKDIV) SpW Link 2 Clock Division Offset */
#define SPW_LINK2_STATUS_REG_OFST      _UINT32_(0x4A8)     /* (SPW_LINK2_STATUS) SpW Link 2 Status Offset */
#define SPW_LINK2_SWRESET_REG_OFST     _UINT32_(0x4AC)     /* (SPW_LINK2_SWRESET) SpW Link 2 Software Reset Offset */
#define SPW_LINK2_ESCCHAREVENT_REG_OFST _UINT32_(0x4B0)     /* (SPW_LINK2_ESCCHAREVENT) SpW Link 2 Escape Character Event Offset */
#define SPW_LINK2_ESCCHAREVENT0_REG_OFST _UINT32_(0x4B0)     /* (SPW_LINK2_ESCCHAREVENT0) SpW Link 2 Escape Character Event Offset */
#define SPW_LINK2_ESCCHAREVENT1_REG_OFST _UINT32_(0x4B4)     /* (SPW_LINK2_ESCCHAREVENT1) SpW Link 2 Escape Character Event Offset */
#define SPW_LINK2_ESCCHARSTS_REG_OFST  _UINT32_(0x4B8)     /* (SPW_LINK2_ESCCHARSTS) SpW Link 2 Escape Character Status Offset */
#define SPW_LINK2_TRANSESC_REG_OFST    _UINT32_(0x4BC)     /* (SPW_LINK2_TRANSESC) SpW Link 2 Transmit Escape Character Offset */
#define SPW_LINK2_DISTINTPI_RM_REG_OFST _UINT32_(0x4C0)     /* (SPW_LINK2_DISTINTPI_RM) SpW Link 2 Distributed Interrupt Pending Read Masked Interrupt Offset */
#define SPW_LINK2_DISTINTPI_RCM_REG_OFST _UINT32_(0x4C4)     /* (SPW_LINK2_DISTINTPI_RCM) SpW Link 2 Distributed Interrupt Pending Read and Clear Masked Interrupt Offset */
#define SPW_LINK2_DISTINTPI_R_REG_OFST _UINT32_(0x4C8)     /* (SPW_LINK2_DISTINTPI_R) SpW Link 2 Distributed Interrupt Pending Read Interrupt Offset */
#define SPW_LINK2_DISTINTPI_RCS_REG_OFST _UINT32_(0x4CC)     /* (SPW_LINK2_DISTINTPI_RCS) SpW Link 2 Distributed Interrupt Pending Read and Clear Interrupt Offset */
