Microchip-MPLAB-Harmony/mc_apps_sam_rh707/apps/pmsm_foc_encoder_sam_rh707/firmware/src/packs/ATSAMRH707F18A_DFP/component/spw.h
#if !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__))
/** \brief SPW register API structure */
typedef struct
{
  __I   uint32_t                       SPW_ROUTER_STS;     /**< Offset: 0x00 (R/   32) SpW Router Status */
  __IO  uint32_t                       SPW_ROUTER_CFG;     /**< Offset: 0x04 (R/W  32) SpW Router Config */
  __I   uint32_t                       SPW_ROUTER_TIMEOUT; /**< Offset: 0x08 (R/   32) SpW Router Timeout */
  __I   uint8_t                        Reserved1[0x74];
  __IO  uint32_t                       SPW_ROUTER_TABLE[224]; /**< Offset: 0x80 (R/W  32) SpW Router Table (Logical addresses 32 to 255, index 0 for logical address 32) */
  __I   uint32_t                       SPW_LINK1_PI_RM;    /**< Offset: 0x400 (R/   32) SpW Link 1 Pending Read Masked Interrupt */
  __I   uint8_t                        Reserved2[0x04];
  __I   uint32_t                       SPW_LINK1_PI_R;     /**< Offset: 0x408 (R/   32) SpW Link 1 Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK1_PI_RCS;   /**< Offset: 0x40C (R/W  32) SpW Link 1 Pending Read, Clear and Enabed Interrupt */
  __IO  uint32_t                       SPW_LINK1_IM;       /**< Offset: 0x410 (R/W  32) SpW Link 1 Interrupt Mask */
  __O   uint32_t                       SPW_LINK1_PI_C;     /**< Offset: 0x414 ( /W  32) SpW Link 1 Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK1_IM_S;     /**< Offset: 0x418 ( /W  32) SpW Link 1 Interrupt Set Mask */
  __O   uint32_t                       SPW_LINK1_IM_C;     /**< Offset: 0x41C ( /W  32) SpW Link 1 Interrupt Clear Mask */
  __IO  uint32_t                       SPW_LINK1_CFG;      /**< Offset: 0x420 (R/W  32) SpW Link 1 Config */
  __IO  uint32_t                       SPW_LINK1_CLKDIV;   /**< Offset: 0x424 (R/W  32) SpW Link 1 Clock Division */
  __I   uint32_t                       SPW_LINK1_STATUS;   /**< Offset: 0x428 (R/   32) SpW Link 1 Status */
  __IO  uint32_t                       SPW_LINK1_SWRESET;  /**< Offset: 0x42C (R/W  32) SpW Link 1 Software Reset */
  __IO  uint32_t                       SPW_LINK1_ESCCHAREVENT[2]; /**< Offset: 0x430 (R/W  32) SpW Link 1 Escape Character Event */
  __I   uint32_t                       SPW_LINK1_ESCCHARSTS; /**< Offset: 0x438 (R/   32) SpW Link 1 Escape Character Status */
  __IO  uint32_t                       SPW_LINK1_TRANSESC; /**< Offset: 0x43C (R/W  32) SpW Link 1 Transmit Escape Character */
  __I   uint32_t                       SPW_LINK1_DISTINTPI_RM; /**< Offset: 0x440 (R/   32) SpW Link 1 Distributed Interrupt Pending Read Masked Interrupt */
  __I   uint32_t                       SPW_LINK1_DISTINTPI_RCM; /**< Offset: 0x444 (R/   32) SpW Link 1 Distributed Interrupt Pending Read and Clear Masked Interrupt */
  __I   uint32_t                       SPW_LINK1_DISTINTPI_R; /**< Offset: 0x448 (R/   32) SpW Link 1 Distributed Interrupt Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK1_DISTINTPI_RCS; /**< Offset: 0x44C (R/W  32) SpW Link 1 Distributed Interrupt Pending Read and Clear Interrupt */
  __IO  uint32_t                       SPW_LINK1_DISTINTIM; /**< Offset: 0x450 (R/W  32) SpW Link 1 Distributed Interrupt Mask */
  __O   uint32_t                       SPW_LINK1_DISTINTPI_C; /**< Offset: 0x454 ( /W  32) SpW Link 1 Distributed Interrupt Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK1_DISTINTIM_S; /**< Offset: 0x458 ( /W  32) SpW Link 1 Distributed Interrupt Set Mask */
  __O   uint32_t                       SPW_LINK1_DISTINTIM_C; /**< Offset: 0x45C ( /W  32) SpW Link 1 Distributed Interrupt Clear Mask */
  __I   uint32_t                       SPW_LINK1_DISTACKPI_RM; /**< Offset: 0x460 (R/   32) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Masked Interrupt */
  __I   uint32_t                       SPW_LINK1_DISTACKPI_RCM; /**< Offset: 0x464 (R/   32) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt */
  __I   uint32_t                       SPW_LINK1_DISTACKPI_R; /**< Offset: 0x468 (R/   32) SpW Link 1 Distributed Interrupt Acknowledge Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK1_DISTACKPI_RCS; /**< Offset: 0x46C (R/W  32) SpW Link 1 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt */
  __IO  uint32_t                       SPW_LINK1_DISTACKIM; /**< Offset: 0x470 (R/W  32) SpW Link 1 Distributed Interrupt Acknowledge Mask */
  __O   uint32_t                       SPW_LINK1_DISTACKPI_C; /**< Offset: 0x474 ( /W  32) SpW Link 1 Distributed Interrupt Acknowledge Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK1_DISTACKIM_S; /**< Offset: 0x478 ( /W  32) SpW Link 1 Distributed Interrupt Acknowledge Set Mask */
  __O   uint32_t                       SPW_LINK1_DISTACKIM_C; /**< Offset: 0x47C ( /W  32) SpW Link 1 Distributed Interrupt Acknowledge Clear Mask */
  __I   uint32_t                       SPW_LINK2_PI_RM;    /**< Offset: 0x480 (R/   32) SpW Link 2 Pending Read Masked Interrupt */
  __I   uint8_t                        Reserved3[0x04];
  __I   uint32_t                       SPW_LINK2_PI_R;     /**< Offset: 0x488 (R/   32) SpW Link 2 Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK2_PI_RCS;   /**< Offset: 0x48C (R/W  32) SpW Link 2 Pending Read, Clear and Enabled Interrupt */
  __IO  uint32_t                       SPW_LINK2_IM;       /**< Offset: 0x490 (R/W  32) SpW Link 2 Interrupt Mask */
  __O   uint32_t                       SPW_LINK2_PI_C;     /**< Offset: 0x494 ( /W  32) SpW Link 2 Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK2_IM_S;     /**< Offset: 0x498 ( /W  32) SpW Link 2 Interrupt Set Mask */
  __O   uint32_t                       SPW_LINK2_IM_C;     /**< Offset: 0x49C ( /W  32) SpW Link 2 Interrupt Clear Mask */
  __IO  uint32_t                       SPW_LINK2_CFG;      /**< Offset: 0x4A0 (R/W  32) SpW Link 2 Config */
  __IO  uint32_t                       SPW_LINK2_CLKDIV;   /**< Offset: 0x4A4 (R/W  32) SpW Link 2 Clock Division */
  __I   uint32_t                       SPW_LINK2_STATUS;   /**< Offset: 0x4A8 (R/   32) SpW Link 2 Status */
  __IO  uint32_t                       SPW_LINK2_SWRESET;  /**< Offset: 0x4AC (R/W  32) SpW Link 2 Software Reset */
  __IO  uint32_t                       SPW_LINK2_ESCCHAREVENT[2]; /**< Offset: 0x4B0 (R/W  32) SpW Link 2 Escape Character Event */
  __I   uint32_t                       SPW_LINK2_ESCCHARSTS; /**< Offset: 0x4B8 (R/   32) SpW Link 2 Escape Character Status */
  __IO  uint32_t                       SPW_LINK2_TRANSESC; /**< Offset: 0x4BC (R/W  32) SpW Link 2 Transmit Escape Character */
  __I   uint32_t                       SPW_LINK2_DISTINTPI_RM; /**< Offset: 0x4C0 (R/   32) SpW Link 2 Distributed Interrupt Pending Read Masked Interrupt */
  __I   uint32_t                       SPW_LINK2_DISTINTPI_RCM; /**< Offset: 0x4C4 (R/   32) SpW Link 2 Distributed Interrupt Pending Read and Clear Masked Interrupt */
  __I   uint32_t                       SPW_LINK2_DISTINTPI_R; /**< Offset: 0x4C8 (R/   32) SpW Link 2 Distributed Interrupt Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK2_DISTINTPI_RCS; /**< Offset: 0x4CC (R/W  32) SpW Link 2 Distributed Interrupt Pending Read and Clear Interrupt */
  __IO  uint32_t                       SPW_LINK2_DISTINTIM; /**< Offset: 0x4D0 (R/W  32) SpW Link 2 Distributed Interrupt Mask */
  __O   uint32_t                       SPW_LINK2_DISTINTPI_C; /**< Offset: 0x4D4 ( /W  32) SpW Link 2 Distributed Interrupt Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK2_DISTINTIM_S; /**< Offset: 0x4D8 ( /W  32) SpW Link 2 Distributed Interrupt Set Mask */
  __O   uint32_t                       SPW_LINK2_DISTINTIM_C; /**< Offset: 0x4DC ( /W  32) SpW Link 2 Distributed Interrupt Clear Mask */
  __I   uint32_t                       SPW_LINK2_DISTACKPI_RM; /**< Offset: 0x4E0 (R/   32) SpW Link 2 Distributed Interrupt Acknowledge Pending Read Masked Interrupt */
  __I   uint32_t                       SPW_LINK2_DISTACKPI_RCM; /**< Offset: 0x4E4 (R/   32) SpW Link 2 Distributed Interrupt Acknowledge Pending Read and Clear Masked Interrupt */
  __I   uint32_t                       SPW_LINK2_DISTACKPI_R; /**< Offset: 0x4E8 (R/   32) SpW Link 2 Distributed Interrupt Acknowledge Pending Read Interrupt */
  __IO  uint32_t                       SPW_LINK2_DISTACKPI_RCS; /**< Offset: 0x4EC (R/W  32) SpW Link 2 Distributed Interrupt Acknowledge Pending Read and Clear Interrupt */
  __IO  uint32_t                       SPW_LINK2_DISTACKIM; /**< Offset: 0x4F0 (R/W  32) SpW Link 2 Distributed Interrupt Acknowledge Mask */
  __O   uint32_t                       SPW_LINK2_DISTACKPI_C; /**< Offset: 0x4F4 ( /W  32) SpW Link 2 Distributed Interrupt Acknowledge Clear Pending Interrupt */
  __O   uint32_t                       SPW_LINK2_DISTACKIM_S; /**< Offset: 0x4F8 ( /W  32) SpW Link 2 Distributed Interrupt Acknowledge Set Mask */
  __O   uint32_t                       SPW_LINK2_DISTACKIM_C; /**< Offset: 0x4FC ( /W  32) SpW Link 2 Distributed Interrupt Acknowledge Clear Mask */
  __I   uint8_t                        Reserved4[0x300];
  __I   uint32_t                       SPW_PKTRX1_PI_RM;   /**< Offset: 0x800 (R/   32) PktRx Pending Read Masked Interrupt */
  __I   uint8_t                        Reserved5[0x04];
  __I   uint32_t                       SPW_PKTRX1_PI_R;    /**< Offset: 0x808 (R/   32) PktRx Pending Read Interrupt */
  __IO  uint32_t                       SPW_PKTRX1_PI_RCS;  /**< Offset: 0x80C (R/W  32) PktRx Pending Read, Clear and Enabled Interrupt */
  __IO  uint32_t                       SPW_PKTRX1_IM;      /**< Offset: 0x810 (R/W  32) PktRx Interrupt Mask */
  __O   uint32_t                       SPW_PKTRX1_PI_C;    /**< Offset: 0x814 ( /W  32) PktRx Clear Pending Interrupt */
  __O   uint32_t                       SPW_PKTRX1_IM_S;    /**< Offset: 0x818 ( /W  32) PktRx Interrupt Set Mask */
  __O   uint32_t                       SPW_PKTRX1_IM_C;    /**< Offset: 0x81C ( /W  32) PktRx Interrupt Clear Mask */
  __IO  uint32_t                       SPW_PKTRX1_CFG;     /**< Offset: 0x820 (R/W  32) PktRx Config */
  __I   uint32_t                       SPW_PKTRX1_STATUS;  /**< Offset: 0x824 (R/   32) PktRx Status */
  __I   uint8_t                        Reserved6[0x08];
  __IO  uint32_t                       SPW_PKTRX1_NXTBUFDATAADDR; /**< Offset: 0x830 (R/W  32) PktRx Next Buffer Data Address */
  __IO  uint32_t                       SPW_PKTRX1_NXTBUFDATALEN; /**< Offset: 0x834 (R/W  32) PktRx Next Buffer Data Length */
  __IO  uint32_t                       SPW_PKTRX1_NXTBUFPKTADDR; /**< Offset: 0x838 (R/W  32) PktRx Next Buffer Packet Address */
  __IO  uint32_t                       SPW_PKTRX1_NXTBUFCFG; /**< Offset: 0x83C (R/W  32) PktRx Next Buffer Config */
  __I   uint32_t                       SPW_PKTRX1_CURBUFDATAADDR; /**< Offset: 0x840 (R/   32) PktRx Current Buffer Data Address */
  __I   uint32_t                       SPW_PKTRX1_CURBUFDATALEN; /**< Offset: 0x844 (R/   32) PktRx Current Buffer Data Length */
  __I   uint32_t                       SPW_PKTRX1_CURBUFPKTADDR; /**< Offset: 0x848 (R/   32) PktRx Current Buffer Packet Address */
  __IO  uint32_t                       SPW_PKTRX1_CURBUFCFG; /**< Offset: 0x84C (R/W  32) PktRx Current Buffer Config */
  __I   uint32_t                       SPW_PKTRX1_PREVBUFDATALEN; /**< Offset: 0x850 (R/   32) PktRx Previous Buffer Data Length */
  __I   uint32_t                       SPW_PKTRX1_PREVBUFSTS; /**< Offset: 0x854 (R/   32) PktRx Previous Buffer Status */
  __I   uint8_t                        Reserved7[0x24];
  __IO  uint32_t                       SPW_PKTRX1_SWRESET; /**< Offset: 0x87C (R/W  32) PktRx Software Reset */
  __I   uint8_t                        Reserved8[0x380];
  __I   uint32_t                       SPW_PKTTX1_PI_RM;   /**< Offset: 0xC00 (R/   32) PktTx Pending Read Masked Interrupt */
  __I   uint8_t                        Reserved9[0x04];
  __I   uint32_t                       SPW_PKTTX1_PI_R;    /**< Offset: 0xC08 (R/   32) PktTx Pending Read Interrupt */
  __IO  uint32_t                       SPW_PKTTX1_PI_RCS;  /**< Offset: 0xC0C (R/W  32) PktTx Pending Read, Clear and Enabled Interrupt */
  __IO  uint32_t                       SPW_PKTTX1_IM;      /**< Offset: 0xC10 (R/W  32) PktTx Interrupt Mask */
  __O   uint32_t                       SPW_PKTTX1_PI_C;    /**< Offset: 0xC14 ( /W  32) PktTx Clear Pending Interrupt */
  __O   uint32_t                       SPW_PKTTX1_IM_S;    /**< Offset: 0xC18 ( /W  32) PktTx Interrupt Set Mask */
  __O   uint32_t                       SPW_PKTTX1_IM_C;    /**< Offset: 0xC1C ( /W  32) PktTx Interrupt Clear Mask */
  __IO  uint32_t                       SPW_PKTTX1_STATUS;  /**< Offset: 0xC20 (R/W  32) PktTx Status */
  __IO  uint32_t                       SPW_PKTTX1_NXTSENDROUT; /**< Offset: 0xC24 (R/W  32) PktTx Next Send List Router Bytes */
  __IO  uint32_t                       SPW_PKTTX1_NXTSENDADDR; /**< Offset: 0xC28 (R/W  32) PktTx Next Send List Address */
  __IO  uint32_t                       SPW_PKTTX1_NXTSENDCFG; /**< Offset: 0xC2C (R/W  32) PktTx Next Send List Config */
  __I   uint32_t                       SPW_PKTTX1_CURSENDROUT; /**< Offset: 0xC30 (R/   32) PktTx Current Send List Router Bytes */
  __I   uint32_t                       SPW_PKTTX1_CURSENDADDR; /**< Offset: 0xC34 (R/   32) PktTx Current Send List Address */
  __IO  uint32_t                       SPW_PKTTX1_CURSENDCFG; /**< Offset: 0xC38 (R/W  32) PktTx Current Send List Config */
  __IO  uint32_t                       SPW_PKTTX1_SWRESET; /**< Offset: 0xC3C (R/W  32) PktTx Software Reset */
  __I   uint8_t                        Reserved10[0x1C0];
  __IO  uint32_t                       SPW_RMAP1_CFG;      /**< Offset: 0xE00 (R/W  32) SpW RMAP 1 Config */
  __I   uint32_t                       SPW_RMAP1_STS_RC;   /**< Offset: 0xE04 (R/   32) SpW RMAP 1 Read and Clear Status */
  __I   uint32_t                       SPW_RMAP1_STS;      /**< Offset: 0xE08 (R/   32) SpW RMAP 1 Read Status */
  __I   uint8_t                        Reserved11[0x74];
  __I   uint32_t                       SPW_TCH_PI_RM;      /**< Offset: 0xE80 (R/   32) SpW Tch Pending Read Masked Interrupt */
  __I   uint8_t                        Reserved12[0x04];
  __I   uint32_t                       SPW_TCH_PI_R;       /**< Offset: 0xE88 (R/   32) SpW Tch Pending Read Interrupt */
  __IO  uint32_t                       SPW_TCH_PI_RCS;     /**< Offset: 0xE8C (R/W  32) SpW Tch Pending Read, Clear and Enabled Interrupt */
  __IO  uint32_t                       SPW_TCH_IM;         /**< Offset: 0xE90 (R/W  32) SpW Tch Interrupt Mask */
  __O   uint32_t                       SPW_TCH_PI_C;       /**< Offset: 0xE94 ( /W  32) SpW Tch Clear Pending Interrupt */
  __O   uint32_t                       SPW_TCH_IM_S;       /**< Offset: 0xE98 ( /W  32) SpW Tch Interrupt Set Mask */
  __O   uint32_t                       SPW_TCH_IM_C;       /**< Offset: 0xE9C ( /W  32) SpW Tch Interrupt Clear Mask */
  __IO  uint32_t                       SPW_TCH_CFGLISTEN;  /**< Offset: 0xEA0 (R/W  32) SpW Tch Config Listener */
  __IO  uint32_t                       SPW_TCH_CFGSEND;    /**< Offset: 0xEA4 (R/W  32) SpW Tch Config Sender */
  __IO  uint32_t                       SPW_TCH_CFG;        /**< Offset: 0xEA8 (R/W  32) SpW Tch Config */
  __IO  uint32_t                       SPW_TCH_CFGRESTART; /**< Offset: 0xEAC (R/W  32) SpW Tch Config Restart */
  __IO  uint32_t                       SPW_TCH_CFGTCEVENT; /**< Offset: 0xEB0 (R/W  32) SpW Tch Config Tc Event */
  __IO  uint32_t                       SPW_TCH_CFGWD;      /**< Offset: 0xEB4 (R/W  32) SpW Tch Config Watchdog */
  __IO  uint32_t                       SPW_TCH_LASTTIMECODE; /**< Offset: 0xEB8 (R/W  32) SpW Tch Last Time Code */
  __IO  uint32_t                       SPW_TCH_SWRESET;    /**< Offset: 0xEBC (R/W  32) SpW Tch Software Reset */
  __I   uint8_t                        Reserved13[0x40];
  __I   uint32_t                       SPW_GROUP_IRQSTS1;  /**< Offset: 0xF00 (R/   32) SpW Group Interrupt status 1 */
  __I   uint32_t                       SPW_GROUP_IRQSTS2;  /**< Offset: 0xF04 (R/   32) SpW Group Interrupt status 2 */
  __I   uint8_t                        Reserved14[0x04];
  __I   uint32_t                       SPW_GROUP_EDACSTS;  /**< Offset: 0xF0C (R/   32) SpW Group Interrupt status */
} spw_registers_t;


#endif /* !(defined(__ASSEMBLER__) || defined(__IAR_SYSTEMS_ASM__)) */
#endif /* _SAMRH707_SPW_COMPONENT_H_ */
